{
    "3DO Interactive Multiplayer": {
        "id": 1,
        "name": "3DO Interactive Multiplayer",
        "emulated": "true",
        "releasedate": "1993-10-04T00:00:00-07:00",
        "developer": "The 3DO Company",
        "manufacturer": "Panasonic Corporation, Sanyo Electric Co., Ltd., GoldStar",
        "cpu": "32-bit RISC ARM60 @ 12.5 MHz",
        "memory": "2 MB main RAM and 1 MB video RAM",
        "graphics": "3DO \"CLIO\" @ 25 MHz,  3DO \"MADAM\" @ 25 MHz",
        "sound": "16-bit Stereo, Dolby Surround",
        "display": "320x240 and 640x480",
        "media": "CD-ROM",
        "maxcontrollers": "1 (up to 8 if daisy-chained)",
        "notes": "The 3DO Interactive Multiplayer (often called simply 3DO) is a video game console originally produced by Panasonic in 1993. Further renditions of the hardware were released in 1994 by Sanyo and Goldstar. The consoles were manufactured according to specifications created by The 3DO Company, and were originally designed by Dave Needle and RJ Mical of New Technology Group. The system was conceived by entrepreneur and Electronic Arts founder Trip Hawkins.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "3DO",
            "Panasonic 3DO",
            "Panasonic 3DO Interactive Multiplayer"
        ]
    },
    "Commodore Amiga": {
        "id": 2,
        "name": "Commodore Amiga",
        "emulated": "true",
        "releasedate": "1985-07-23T00:00:00-07:00",
        "developer": "Commodore International",
        "manufacturer": "Commodore International",
        "cpu": "Motorola 680x0 (68000-68060)",
        "memory": "512kb",
        "graphics": "OCS \/ ECS \/ AGA chipset",
        "sound": "4-channel",
        "display": "320 x 200 \/ 640 x 400 \/ NTSC or 320 x 256 \/ 640 x 512 PAL",
        "media": "3.5\" disk",
        "maxcontrollers": "2",
        "notes": "The Amiga is a family of personal computers marketed by Commodore in the 1980s and 1990s. The first model was launched in 1985 as a high-end home computer and became popular for its graphical, audio and multi-tasking abilities. The Amiga provided a significant upgrade from 8-bit computers, such as the Commodore 64, and the platform quickly grew in popularity among computer enthusiasts. The best selling model, the Amiga 500, was introduced in 1987 and became the leading home computer of the late 1980s and early 1990s in much of Western Europe",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Amiga"
        ]
    },
    "Amstrad CPC": {
        "id": 3,
        "name": "Amstrad CPC",
        "emulated": "true",
        "releasedate": "1984-01-01T00:00:00-08:00",
        "developer": "Amstrad",
        "manufacturer": "Amstrad",
        "cpu": "Zilog Z80A",
        "memory": "64 or 128 KB, expandable to 576 KB",
        "graphics": "CRTC Motorola 6845",
        "sound": "AY-3-8912",
        "display": "160x200, 320x200, 640x200",
        "media": "Cassette tape, 3 inch Hitachi\/Panasonic Floppy Disk",
        "notes": "The Amstrad Colour Personal Computer, better known as the Amstrad CPC, is a series of 8-bit home computers designed by Amstrad.  The first models were released in April 1984 in Europe at a retail price ranging from Â£199 to Â£299, depending on the package bought. The computers were not released outside of Europe.  The CPC series had five distinct models: The CPC464, CPC664, CPC6128, 464plus, and 6128plus. The computers were manufactured until an unspecified time in 1990.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Amstrad",
            "CPC",
            "Amstrad Colour Personal Computer",
            "Amstrad Color Personal Computer",
            "Colour Personal Computer",
            "Color Personal Computer"
        ]
    },
    "Android": {
        "id": 4,
        "name": "Android",
        "emulated": "true",
        "releasedate": "2008-09-23T00:00:00-07:00",
        "developer": "Google",
        "manufacturer": "Various",
        "cpu": "ARM architecture (ARMv7 and ARMv8-A architectures), with x86 and MIPS architectures",
        "display": "Touchscreen",
        "notes": "Android is a mobile operating system (OS) based on the Linux kernel and currently developed by Google. With a user interface based on direct manipulation, Android is designed primarily for touchscreen mobile devices such as smartphones and tablet computers, with specialized user interfaces for televisions (Android TV), cars (Android Auto), and wrist watches (Android Wear). The OS uses touch inputs that loosely correspond to real-world actions, like swiping, tapping, pinching, and reverse pinching to manipulate on-screen objects, and a virtual keyboard. Despite being primarily designed for touchscreen input, it has also been used in game consoles, digital cameras, regular PCs, and other electronics. As of 2015, Android has the largest installed base of all operating systems.\n\nAs of July 2013, the Google Play store has had over one million Android applications (\"apps\") published, and over 50 billion applications downloaded. An Aprilâ\u0080\u0093May 2013 survey of mobile application developers found that 71% of them create applications for Android; another 2015 survey found that 40% of full-time professional developers see Android as the \"priority\" target platform, which is more than iOS (37%) or other platforms. At Google I\/O 2014, the company revealed that there were over one billion active monthly Android users, up from 538 million in June 2013.\n\nAndroid's source code is released by Google under open source licenses, although most Android devices ultimately ship with a combination of open source and proprietary software, including proprietary software developed and licensed by Google. Initially developed by Android, Inc., which Google bought in 2005, Android was unveiled in 2007, along with the founding of the Open Handset Alliance â\u0080\u0093 a consortium of hardware, software, and telecommunication companies devoted to advancing open standards for mobile devices.\n\nAndroid is popular with technology companies which require a ready-made, low-cost and customizable operating system for high-tech devices. Android's open nature has encouraged a large community of developers and enthusiasts to use the open-source code as a foundation for community-driven projects, which add new features for advanced users or bring Android to devices which were officially released running other operating systems. The operating system's success has made it a target for patent litigation as part of the so-called \"smartphone wars\" between technology companies.",
        "category": "Mobile",
        "usemamefiles": "false",
        "alternate": [
            "Droid"
        ]
    },
    "Arcade": {
        "id": 5,
        "name": "Arcade",
        "emulated": "true",
        "notes": "An arcade game or coin-op is a coin-operated entertainment machine typically installed in public businesses such as restaurants, bars and amusement arcades. Most arcade games are video games, pinball machines, electro-mechanical games, redemption games or merchandisers. While exact dates are debated, the golden age of arcade video games is usually defined as a period beginning sometime in the late 1970s and ending sometime in the mid-1980s. Excluding a brief resurgence in the early 1990s, the arcade industry subsequently declined in the Western hemisphere as competing home-based video game consoles such as Playstation and Xbox increased in their graphics and game-play capability and decreased in cost.",
        "category": "Arcade",
        "usemamefiles": "true",
        "alternate": [
            "MAME"
        ]
    },
    "Atari 2600": {
        "id": 6,
        "name": "Atari 2600",
        "emulated": "true",
        "releasedate": "1977-09-11T00:00:00-07:00",
        "developer": "Atari, Inc.",
        "manufacturer": "Atari, Inc.",
        "cpu": "8-bit MOS Technology 6507 @ 1.19 MHz",
        "memory": "128 bytes",
        "graphics": "Television Interface Adaptor (TIA)",
        "sound": "Mono 2-Channel (handled by the TIA)",
        "display": "160 x 192",
        "media": "Cartridge",
        "maxcontrollers": "2",
        "notes": "The Atari Video Computer System (VCS), later named the Atari 2600, is a second generation (1976â\u0080\u00931992) home video game console developed and distributed by Atari, Inc. It was released on September 11, 1977 in North America at a retail price of $199. The console was later released in Europe (1978) and Japan (1983 - as the Atari 2800). The Atari 2600 popularized the use of microprocessor-based hardware and games contained on ROM cartridges. The console was discontinued on January 1, 1992.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Atari",
            "2600"
        ]
    },
    "Atari 5200": {
        "id": 7,
        "name": "Atari 5200",
        "emulated": "true",
        "releasedate": "1982-11-01T00:00:00-08:00",
        "developer": "Atari, Inc.",
        "manufacturer": "Atari, Inc.",
        "cpu": "8-bit MOS Technology 6502C @ 1.79 MHz",
        "memory": "16 KB",
        "graphics": "Atari Alphanumeric Television Interface Controller (ANTIC) and Atari Graphic Television Interface Adaptor (GTIA)",
        "sound": "Atari Pot Keyboard Integrated Circuit (POKEY), 4 channels",
        "display": "320x192",
        "media": "Cartridge",
        "maxcontrollers": "2 or 4 (depending on model)",
        "notes": "The Atari 5200 SuperSystem, commonly known as the Atari 5200, is a second generation (1976â\u0080\u00931992) video game console developed and distributed by Atari, Inc. It was released in November 1982 in North America at a retail price of $269. It was not released outside North America. The 5200's internal hardware was almost identical to Atari's 8-bit computers however it came with an innovative controller featuring a 360-degree non-centering joystick with a numeric keypad, start, pause, and reset buttons. The console was discontinued on May 21, 1984.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "5200",
            "Atari 5200 SuperSystem",
            "5200 SuperSystem",
            "Atari SuperSystem",
            "SuperSystem"
        ]
    },
    "Atari 7800": {
        "id": 8,
        "name": "Atari 7800",
        "emulated": "true",
        "releasedate": "1986-05-01T00:00:00-07:00",
        "developer": "Atari Corporation",
        "manufacturer": "Atari Corporation",
        "cpu": "8-bit Atari SALLY 6502 (\"6502C\") @ 1.79 MHz",
        "memory": "4 KB",
        "graphics": "MARIA custom graphics controller  @ 7.16 MHz",
        "sound": "Television Interface Adaptor (TIA), 2 channels",
        "display": "320x192",
        "media": "Cartridge",
        "maxcontrollers": "2",
        "notes": "The Atari 7800 Pro System, commonly known as the Atari 7800, is a third generation (1983-2003) video game console developed and distributed by Atari Corporation. It was released in May 1986 in North America at a retail price of $79.95. The console was later released in Europe (1987). The 7800 is considered one of the first backward-compatible consoles as it could play Atari 2600 games without the use of additional modules. The console was discontinued on January 1, 1992.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "7800",
            "Atari 7800 ProSystem",
            "7800 ProSystem",
            "Atari ProSystem",
            "ProSystem"
        ]
    },
    "Atari Jaguar": {
        "id": 9,
        "name": "Atari Jaguar",
        "emulated": "true",
        "releasedate": "1993-11-23T00:00:00-08:00",
        "developer": "Atari Corporation",
        "manufacturer": "IBM",
        "cpu": "Motorola 68000 @ 13.29 MHz",
        "memory": "2 MB DRAM",
        "graphics": "Atari custom \"Tom\" chip @ 26.59 MHz, GPU 32-bit RISC, 4KB RAM",
        "sound": "Atari custom \"Jerry\" chip @ 26.59 MHz, 16-bit stereo",
        "display": "320x224p, 360x224p, 640x224p, 720x224p, 320x448i, 360x448i, 640x448i, 720x448i",
        "media": "ROM cartridge",
        "maxcontrollers": "2",
        "notes": "The Atari Jaguar is a fifth generation (1993â\u0080\u00932005) video game console developed and distributed by Atari Corporation. It was released in November 1993 in North America at a retail price of $249.99. The console was later released in Europe (1994), Australia (1994), and Japan (1994). The Jaguar was marketed as being the first 64-bit video game console; however this claim was widely criticized.  The console was discontinued in early 1996, possibly at the time of the company's sale on April 8, 1996.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Jaguar"
        ]
    },
    "Atari Jaguar CD": {
        "id": 10,
        "name": "Atari Jaguar CD",
        "emulated": "true",
        "releasedate": "1995-09-21T00:00:00-07:00",
        "developer": "Atari Corporation",
        "manufacturer": "Atari Corporation",
        "media": "CD-ROM",
        "notes": "The Atari Jaguar CD is a fifth generation (1993â\u0080\u00932005) CD-ROM peripheral for the Atari Jaguar video game console developed and distributed by Atari Corporation. It was released in September 1995 in North America at a retail price of $149.95. The peripheral was also released in Europe (1995). The Jaguar CD unit featured a double-speed (2Ã\u0097) drive and its own cartridge slot to allow cartridge games to be played without removing the CD drive. The peripheral was discontinued in early 1996, possibly at the time of the company's sale on April 8, 1996.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Jaguar CD",
            "Jag CD"
        ]
    },
    "Atari Lynx": {
        "id": 11,
        "name": "Atari Lynx",
        "emulated": "true",
        "releasedate": "1989-09-01T00:00:00-07:00",
        "developer": "Atari Corporation, Epyx, Inc.",
        "manufacturer": "Atari Corporation",
        "cpu": "WDC 65SC02 (Mikey) @ 4 MHz",
        "memory": "64 KB",
        "graphics": "16-bit custom CMOS chip Atari Suzy @ 16 MHz",
        "sound": "4-channels, 8-bit DAC per channel",
        "display": "160 x 102",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The Atari Lynx, usually just referred to as Lynx, is a fourth generation (1987-2004) handheld video game console developed in partnership with Epyx, Inc. and distributed by the Atari Corporation. It was released in September 1989 in North America at a retail price of $149.95. The handheld was also released in Europe (1990) and Japan (1990). The Lynx was the world's first handheld electronic game with a color LCD screen. The console was discontinued in early 1996, possibly at the time of the company's sale on April 8, 1996.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Lynx"
        ]
    },
    "Atari XEGS": {
        "id": 12,
        "name": "Atari XEGS",
        "emulated": "true",
        "releasedate": "1987-11-01T00:00:00-08:00",
        "developer": "Atari",
        "manufacturer": "Atari",
        "cpu": "Custom MOS Technology 6502C",
        "memory": "64 KB RAM",
        "graphics": "Atari Graphic Television Interface Adaptor (GTIA)",
        "sound": "Atari Pot Keyboard Integrated Circuit (POKEY), 4 channels",
        "display": "320 x 192",
        "media": "ROM Cartridge",
        "maxcontrollers": "2",
        "notes": "The Atari XE Video Game System, commonly known as the Atari XEGS, is a third generation (1983-2003) video game console developed and distributed by Atari Corporation. It was released in November 1987 in North America at a retail price of $199.99. The console was not released outside North America. The XEGS was able to operate as either a stand-alone console or full computer with the addition of its specially designed keyboard. The console was discontinued on January 1, 1992.",
        "category": "Consoles",
        "usemamefiles": "false"
    },
    "ColecoVision": {
        "id": 13,
        "name": "ColecoVision",
        "emulated": "true",
        "releasedate": "1982-08-01T00:00:00-07:00",
        "developer": "Coleco Industries, Inc.",
        "manufacturer": "Coleco Industries, Inc.",
        "cpu": "8-bit NEC uPD780C @ 3.58 MHz",
        "memory": "1 KB main RAM, 16 KB Video RAM",
        "graphics": "TI TMS9918A @ 10.74 MHz",
        "sound": "TI SN76489A, 3 tone and 1 noise channels",
        "display": "256x192",
        "media": "Cartridge",
        "maxcontrollers": "2",
        "notes": "The ColecoVision is a second generation (1976â\u0080\u00931992) home video game console developed and distributed by Coleco Industries. It was released in August 1982 in North America at a retail price of $175. The console was later released in Europe (1983). The ColecoVision offered a closer experience to arcade games than its competitors at the time. The console was discontinued in mid-1985.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Coleco",
            "Coleco Vision"
        ]
    },
    "Commodore 64": {
        "id": 14,
        "name": "Commodore 64",
        "emulated": "true",
        "releasedate": "1982-01-01T00:00:00-08:00",
        "developer": "Commodore Business Machines",
        "manufacturer": "Commodore Business Machines",
        "cpu": "MOS Technology 6510",
        "memory": "64 KB RAM and 20 KB ROM",
        "graphics": "MOS Technology VIC-ll",
        "sound": "MOS Technology 6581\/8580 SID",
        "display": "320x200",
        "media": "Cartridge, Tape, Floppy optional",
        "maxcontrollers": "2",
        "notes": "The Commodore 64 is an 8-bit home computer introduced in January 1982 by Commodore International. It is listed in the Guinness World Records as the highest-selling single computer model of all time, with independent estimates placing the number sold between 10 and 17 million units. Volume production started in early 1982, marketing in August for US$595 (equivalent to $1,461 in 2015). Preceded by the Commodore VIC-20 and Commodore PET, the C64 took its name from its 64 kilobytes (65,536 bytes) of RAM. It had superior sound and graphical specifications compared to other earlier systems such as the Apple II and Atari 800, with multi-color sprites and a more advanced sound processor.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "C64",
            "C=64",
            "CBM 64",
            "VIC-64",
            "C 64",
            "CBM64",
            "VIC 64",
            "VIC64",
            "Comm 64",
            "Comm. 64",
            "Comm64",
            "Comodore 64",
            "Commodore"
        ]
    },
    "Mattel Intellivision": {
        "id": 15,
        "name": "Mattel Intellivision",
        "emulated": "true",
        "releasedate": "1979-12-03T00:00:00-08:00",
        "developer": "Mattel Electronics",
        "manufacturer": "Mattel Electronics",
        "cpu": "16-bit GI CP1610 @ 894.886 KHz",
        "memory": "944 Bytes main RAM, 512 Bytes video RAM",
        "graphics": "GI AY-3-8900 @ 3.58 MHz",
        "sound": "GI AY-3-8910, 4 channels (3 sound, 1 noise)",
        "display": "159x96, (159x192 on TV with scanline doubling)",
        "media": "Cartridge",
        "maxcontrollers": "2",
        "notes": "The Mattel Intellivision is a second generation (1976â\u0080\u00931992) home video game console developed and distributed by Mattel Electronics. It was released in summer 1979 in North America at a retail price of $299. The console was later released in Europe (1981), South America (1982), and Japan (1982). The Intellivision was the first home console to use a tile based playfield and was the first game console to provide real-time human voices in the middle of gameplay, courtesy of the IntelliVoice module. The console was discontinued in early-1990.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Intellivision"
        ]
    },
    "Apple iOS": {
        "id": 16,
        "name": "Apple iOS",
        "emulated": "true",
        "releasedate": "2007-06-29T00:00:00-07:00",
        "developer": "Apple",
        "manufacturer": "Apple",
        "cpu": "64- and 32-bit ARM architectures:  iOS 7 and later (ARMv8-A)  iPhone OS 3 and later (ARMv7-A)  iPhone OS 1â\u0080\u0093iOS 4.2.1 (ARMv6)",
        "display": "Touchscreen",
        "notes": "iOS (originally iPhone OS) is a mobile operating system created and developed by Apple Inc. and distributed exclusively for Apple hardware. It is the operating system that presently powers many of the company's mobile devices, including the iPhone, iPad, and iPod touch.\n\nOriginally unveiled in 2007 for the iPhone, it has been extended to support other Apple devices such as the iPod Touch (September 2007), iPad (January 2010), iPad Mini (November 2012) and second-generation Apple TV onward (September 2010). As of January 2015, Apple's App Store contained more than 1.4 million iOS applications, 725,000 of which are native for iPad. These mobile apps have collectively been downloaded more than 100 billion times. It had a 21% share of the smartphone mobile operating system units shipped in the fourth quarter of 2012, behind Google's Android. By the middle of 2012, there were 410 million devices activated. At WWDC 2014, Tim Cook said 800 million devices had been sold by June 2014. During Apple's quarterly earnings call in January 27, 2015, Apple announced that they have now sold one billion iOS devices.\n\nThe user interface of iOS is based on the concept of direct manipulation, using multi-touch gestures. Interface control elements consist of sliders, switches, and buttons. Interaction with the OS includes gestures such as swipe, tap, pinch, and reverse pinch, all of which have specific definitions within the context of the iOS operating system and its multi-touch interface. Internal accelerometers are used by some applications to respond to shaking the device (one common result is the undo command) or rotating it in three dimensions (one common result is switching from portrait to landscape mode).\n\niOS shares with OS X some frameworks such as Core Foundation and Foundation; however, its UI toolkit is Cocoa Touch rather than OS X's Cocoa, so that it provides the UIKit framework rather than the AppKit framework. It is therefore not compatible with OS X for applications. Also while iOS also shares the Darwin foundation with OS X, Unix-like shell access is not available for users and restricted for apps, making iOS not fully Unix-compatible either.\n\nMajor versions of iOS are released annually. The current release, iOS 8.4, was released on June 30, 2015. In iOS, there are four abstraction layers: the Core OS layer, the Core Services layer, the Media layer, and the Cocoa Touch layer. The current version of the operating system (iOS 8), dedicates 1.3-1.5 GB of the device's flash memory for the system partition, using roughly 800 MB of that partition (varying by model) for iOS itself. It runs on the iPhone 4S and later, iPad 2 and later, all models of the iPad Mini, and the 5th-generation iPod Touch and later.",
        "category": "Mobile",
        "usemamefiles": "false",
        "alternate": [
            "iOS",
            "iPhone",
            "iPad",
            "iPod",
            "iPod Touch"
        ]
    },
    "Apple Mac OS": {
        "id": 17,
        "name": "Apple Mac OS",
        "emulated": "true",
        "releasedate": "1984-01-24T00:00:00-08:00",
        "developer": "Apple",
        "manufacturer": "Apple",
        "notes": "Mac OS is a series of graphical user interfaceâ\u0080\u0093based operating systems developed by Apple Inc. for their Macintosh line of computer systems. The original operating system was first introduced in 1984 as being integral to the original Macintosh, and referred to as the \"System\". Referred to by its major revision starting with \"System 6\" and \"System 7\", Apple rebranded version 7.6 as \"Mac OS\" as part of their Macintosh clone program in 1996. The Macintosh, specifically its system software, is credited with having popularized the early graphical user interface concept.  There have been two operating systems popularly known as \"Mac OS\". Up to major revision 9, from 1984 to 2000, it is historically known as Classic Mac OS. Major revision 10, from 2001 to present, is branded OS X (originally referred to as Mac OS X). Major revisions to the Macintosh OS are now issued as point revisions, such that, for example, 10.2 is substantially different from 10.5. Both operating systems share a general interface design, and there has been some overlap of application frameworks for compatibility; but the two systems have different origins and use deeply different architectures.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "OSX",
            "Mac OS X",
            "Mac OSX",
            "Mac",
            "Mac OS"
        ]
    },
    "Microsoft Xbox": {
        "id": 18,
        "name": "Microsoft Xbox",
        "emulated": "true",
        "releasedate": "2001-11-15T00:00:00-08:00",
        "developer": "Microsoft Corporation",
        "manufacturer": "Flextronics International Ltd.",
        "cpu": "Intel Pentium III KC @ 733 MHz",
        "memory": "64 MB DDR SDRAM",
        "graphics": "Nvidia NV2A \"XGPU\" @ 233 MHz",
        "sound": "Nvidia SoundStorm \"MCPX\"",
        "display": "NTSC: 480i, 480p, 720p, 1080i \/ PAL: 576i, 576p, 720p, 1080i",
        "media": "DVD-ROM",
        "maxcontrollers": "4",
        "notes": "The Microsoft Xbox is a sixth generation (1998â\u0080\u00932013) home video game console developed and distributed by Microsoft. It was released on November 15, 2001 in North America at a retail price of $299.99. The console was later released in Europe (2002), Japan (2002), and Australia (2002). The Xbox was the first game console to have a built in hard disk. The console was discontinued on March 2, 2009.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "X-box",
            "MS Xbox",
            "Microsoft X-box",
            "MS X-box",
            "Xbox"
        ]
    },
    "Microsoft Xbox 360": {
        "id": 19,
        "name": "Microsoft Xbox 360",
        "emulated": "true",
        "releasedate": "2005-11-22T00:00:00-08:00",
        "developer": "Microsoft Corporation",
        "manufacturer": "Flextronics International Ltd., Foxconn Technology Group, Celestica Inc., Wistron Corporation",
        "cpu": "IBM PowerPC \"Xenon\" @ 3.2 GHz",
        "memory": "512 MB RAM, 10 MB VRAM",
        "graphics": "ATI R520 \"Xenos\" @ 500 MHz",
        "sound": "Over 256 audio channels and 320 independent decompression channels using 32-bit processing for audio, with support for 48 kHz 16-bit sound.",
        "display": "NTSC: 480i, 480p, 720p, 1080i, 1080p \/ PAL: 576i, 576p, 720p, 1080i, 1080p",
        "media": "Dual-Layer DVD-ROM",
        "maxcontrollers": "4",
        "notes": "The Microsoft Xbox 360 is a seventh generation (2005â\u0080\u00932017) home video game console developed and distributed by Microsoft. It was released on November 22, 2005 in North America at a retail price of $299.99 or $399.99, depending on the model. The console was later released in Europe (2005), Japan (2005), South America (2006), and Australia (2006). The Xbox 360 was known for its graphical power at the time, as well as defining controller free gameplay via the Kinect device. The console was discontinued on April 20, 2017.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Xbox 360",
            "360",
            "MS Xbox 360"
        ]
    },
    "Microsoft Xbox One": {
        "id": 20,
        "name": "Microsoft Xbox One",
        "emulated": "true",
        "releasedate": "2013-11-22T00:00:00-08:00",
        "developer": "Microsoft",
        "manufacturer": "Microsoft",
        "cpu": "AMD Jaguar APU @ 1.75 GHz (One\/One S) \/ AMD Jaguar APU @ 2.3 GHz (One X)",
        "memory": "8 GB (One\/One S) \/ 12 GB RAM (One X)",
        "graphics": "AMD GCN 1 \"Durango\" @ 853 MHz (One) \/ AMD GCN 1 \"Durango 2\" @ 914 MHz (One S) \/ AMD GCN 4 \"Scorpio\" @ 1.17 GHz (One X)",
        "sound": "7.1 surround sound, Dolby Atmos, DTS:X",
        "display": "480p, 720p 1080p, 1440p (One X), 4K (One X)",
        "media": "CD, DVD, Blu-Ray, Ultra HD Blu-Ray (One X)",
        "maxcontrollers": "8",
        "notes": "The Microsoft Xbox One is an eighth generation (2012-present) home video game console developed and distributed by Microsoft. It was released on November 22, 2013 in North America at a retail price of $499.99. The console was simultaneously released in Europe (2013), South America (2013), Australia (2013) and later Japan (2014). The Xbox One is marketed as an all-in-one entertainment system, providing games, movies, music, and web browsing from the console. As of this date, the console is still in production.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Xbox One"
        ]
    },
    "SNK Neo Geo Pocket": {
        "id": 21,
        "name": "SNK Neo Geo Pocket",
        "emulated": "true",
        "releasedate": "1998-12-31T00:00:00-08:00",
        "developer": "SNK",
        "manufacturer": "SNK",
        "cpu": "Toshiba TLCS-900\/H @ 6.14 MHz",
        "memory": "12 KB RAM",
        "graphics": "N\/A",
        "sound": "Zilog Z80 @ 3 MHz",
        "display": "160x152p",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The Neo Geo Pocket is a monochrome handheld game console released by SNK. It was the company's first handheld system and is part of the Neo Geo family. It debuted in Japan in late 1998 but never saw a western release, being exclusive to Japan and smaller Asian markets such as Hong Kong.  The Neo Geo Pocket is considered to be an unsuccessful console. Lower than expected sales resulted in its discontinuation in 1999, and was immediately succeeded by the Neo Geo Pocket Color, a full color device allowing the system to compete more easily with the dominant Game Boy Color handheld, and which also saw a western release. Though the system enjoyed only a short life, there were some significant games released on the system such as Samurai Shodown, and King of Fighters R-1.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "NeoGeo Pocket",
            "NGP",
            "Neo Geo Pocket",
            "SNK Neo-Geo Pocket"
        ]
    },
    "SNK Neo Geo Pocket Color": {
        "id": 22,
        "name": "SNK Neo Geo Pocket Color",
        "emulated": "true",
        "releasedate": "1999-03-16T00:00:00-08:00",
        "developer": "SNK",
        "manufacturer": "SNK",
        "cpu": "Toshiba TLCS-900\/H @ 6.14 MHz, Zilog Z80 @ 3 MHz (sound)",
        "memory": "12 KB (900H) and 4 KB (Z80 and 900H)",
        "graphics": "N\/A",
        "sound": "SN76489, T6W28 (3 tone 1 noise)",
        "display": "160x152 (256x256 virtual screen)",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The Neo Geo Pocket Color (also stylized as NEOGEOPOCKET COLOR, often abbreviated NGPC), is a 16-bit color handheld video game console manufactured by SNK. It is a successor to SNK's monochrome Neo Geo Pocket handheld which debuted in 1998 in Japan, with the Color being fully backward compatible. The Neo Geo Pocket Color was released on March 16, 1999 in Japan, August 6, 1999 in North America, and on October 1, 1999 in Europe, entering markets all dominated by Nintendo.  After a good sales start in both the U.S. and Japan with 14 launch titles (a record at the time) subsequent low retail support in the U.S., lack of communication with third-party developers by SNK's American management, the craze about Nintendo's PokÃ©mon franchise, anticipation of the 32-bit Game Boy Advance, as well as strong competition from Bandai's WonderSwan in Japan, led to a sales decline in both regions.  Meanwhile, SNK had been in financial trouble for at least a year; the company soon collapsed, and was purchased by American pachinko manufacturer Aruze in January 2000. However, Aruze didn't support SNK's video game business enough, leading to SNK's original founder and several other employees to leave and form a new company, BrezzaSoft. Eventually on June 13, 2000, Aruze decided to quit the North American and European markets, marking the end of SNK's worldwide operations and the discontinuation of Neo Geo hardware and software there. The Neo Geo Pocket Color (and other SNK\/Neo Geo products) did however, last until 2001 in Japan. It was SNK's last video game console, as the company went bankrupt on October 22, 2001.  Despite its failure the Neo Geo Pocket Color has been regarded as an influential system. Many highly acclaimed games were released for the system, such as SNK vs. Capcom: The Match of the Millennium, King of Fighters R-2, and other quality arcade titles derived from SNK's MVS and AES. It also featured an arcade-style microswitched 'clicky stick' joystick, which was praised for its accuracy and being well-suited for fighting games. The system's display and 40-hour battery life were also well received.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "SNK Neo-Geo Pocket Color",
            "Neo Geo Pocket Color",
            "NeoGeo Pocket Color",
            "NeoGeo Color",
            "NGPC"
        ]
    },
    "SNK Neo Geo AES": {
        "id": 23,
        "name": "SNK Neo Geo AES",
        "emulated": "true",
        "releasedate": "1990-01-31T00:00:00-08:00",
        "developer": "SNK",
        "manufacturer": "SNK",
        "cpu": "Motorola 68000 @ 12 MHz, Zilog Z80 @ 4 MHz",
        "memory": "64 KB main + 2 KB sound and 68 KB video RAM",
        "graphics": "SNK chipset (LSPC2-A2, PRO-B0, PRO-A0)",
        "sound": "Yamaha YM2610 15 sound channels",
        "display": "320x224",
        "media": "Cartridge",
        "maxcontrollers": "2",
        "notes": "The Advanced Entertainment System (AES), originally known just as the Neo Geo, is the first video game console in the family. The hardware features comparatively colorful 2D graphics. The hardware was in part designed by Alpha Denshi (later ADK).  Initially, the home system was only available for rent to commercial establishments, such as hotel chains, bars and restaurants, and other venues. When customer response indicated that some gamers were willing to buy a US$650 console, SNK expanded sales and marketing into the home console market. The Neo Geo console was officially launched on 31 January 1990 in Osaka, Japan. The AES is identical to its arcade counterpart, the MVS, so arcade games released for the home market are nearly identical conversions.",
        "category": "Consoles",
        "usemamefiles": "true",
        "alternate": [
            "Neo Geo",
            "Neo Geo Multi Video System",
            "Neo Geo Advanced Entertainment System",
            "MVS",
            "AES",
            "Multi Video System",
            "Advanced Entertainment System",
            "Neo Geo MVS",
            "Neo Geo AES",
            "NeoGeo MVS",
            "NeoGeo AES",
            "NeoGeo Multi Video System",
            "NeoGeo Advanced Entertainment System",
            "SNK Neo-Geo AES",
            "SNK Neo-Geo MVS",
            "SNK Neo Geo AES",
            "SNK NeoGeo",
            "NeoGeo"
        ]
    },
    "Nintendo 3DS": {
        "id": 24,
        "name": "Nintendo 3DS",
        "emulated": "true",
        "releasedate": "2011-02-26T00:00:00-08:00",
        "developer": "Nintendo RED",
        "manufacturer": "Nintendo, Foxconn",
        "cpu": "ARM11MPcore @ 268 MHz, ARM946E-S @ 134 MHz",
        "memory": "128 MB FCRAM, 6 MB VRAM",
        "graphics": "DMP PICA200 @ 268 MHz",
        "sound": "CEVA TeakLite @ 134 MHz",
        "display": "Top 400x240 per eye, Bottom (touch) 320x240",
        "media": "3DS & DS Game Cards, SD\/SDHC, Digital",
        "maxcontrollers": "1",
        "notes": "The Nintendo 3DS, abbreviated to 3DS, is a portable game console produced by Nintendo. It is capable of displaying stereoscopic 3D effects without the use of 3D glasses or additional accessories. Nintendo announced the device in March 2010 and officially unveiled it at E3 2010 on June 15, 2010. The console succeeds the Nintendo DS, featuring backward compatibility with older Nintendo DS and Nintendo DSi video games.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "3DS"
        ]
    },
    "Nintendo 64": {
        "id": 25,
        "name": "Nintendo 64",
        "emulated": "true",
        "releasedate": "1996-06-23T00:00:00-07:00",
        "developer": "Nintendo IRD",
        "manufacturer": "Nintendo, Foxconn",
        "cpu": "64-bit NEC VR4300",
        "memory": "4 MB RDRAM expandable to 8 MB",
        "graphics": "64-bit SGI RCP",
        "sound": "64-bit SGI RCP",
        "display": "Up to 480i (576i PAL region), also widescreen",
        "media": "ROM Cartridge, Magnetic disc R\/W (with 64DD)",
        "maxcontrollers": "4",
        "notes": "Named for its 64-bit central processing unit, it was released in June 1996 in Japan, September 1996 in North America, March 1997 in Europe and Australia, September 1997 in France and December 1997 in Brazil.\n\nAs part of the fifth generation of gaming, the N64 competed primarily with the PlayStation and the Sega Saturn. The Nintendo 64 was launched with three games: Super Mario 64 and Pilotwings 64, released worldwide; and Saikyo Habu Shogi, released only in Japan.\n\nWhile the N64 was succeeded by Nintendo's MiniDVD-based GameCube in November 2001, N64 consoles remained available until the system was retired in late 2003.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "N64",
            "Nintendo N64"
        ]
    },
    "Nintendo DS": {
        "id": 26,
        "name": "Nintendo DS",
        "emulated": "true",
        "releasedate": "2004-11-21T00:00:00-08:00",
        "developer": "Nintendo",
        "manufacturer": "Foxconn",
        "cpu": "ARM946E-S @ 67 MHz, ARM7TDMI @ 33 MHz",
        "memory": "4 MB RAM, 656 KB VRAM",
        "graphics": "ARM946E-S",
        "sound": "ARM7TDMI",
        "display": "256x192 (native) and 240x160 (GBA mode)",
        "media": "DS game card, GBA cartridge",
        "notes": "The Nintendo DS or simply, DS, is a 32-bit dual-screen handheld game console developed and released by Nintendo. The device went on sale in North America on November 21, 2004. The DS, short for \"Developers' System\" or \"Dual Screen\", introduced distinctive new features to handheld gaming: two LCD screens working in tandem (the bottom one featuring a touchscreen), a built-in microphone, and support for wireless connectivity. Both screens are encompassed within a clamshell design similar to the Game Boy Advance SP. The Nintendo DS also features the ability for multiple DS consoles to directly interact with each other over Wi-Fi within a short range without the need to connect to an existing wireless network. Alternatively, they could interact online using the now-closed Nintendo Wi-Fi Connection service.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Nintendo DSi",
            "NDS",
            "NDSi",
            "DSi",
            "DS"
        ]
    },
    "Nintendo Entertainment System": {
        "id": 27,
        "name": "Nintendo Entertainment System",
        "emulated": "true",
        "releasedate": "1985-10-18T00:00:00-07:00",
        "developer": "Nintendo R&D2",
        "manufacturer": "Nintendo Co., Ltd.",
        "cpu": "8-bit Ricoh 2A03 @ 1.79 MHz (NTSC) or 8-bit Ricoh 2A07 @ 1.66 MHz (PAL)",
        "memory": "2 KB RAM, 2 KB video RAM",
        "graphics": "Ricoh 2C02 @ 5.4 MHz (NTSC) or RP2C07 (PAL) PPU",
        "sound": "PSG 5 channel mono",
        "display": "NTSC: 256x224p \/ PAL: 256x240p",
        "media": "Cartridge",
        "maxcontrollers": "2",
        "notes": "The Nintendo Entertainment System is an 8-bit video game console that was released by Nintendo in North America during 1985, in Europe during 1986 and Australia in 1987. In most of Asia, including Japan (where it was first launched in 1983), China, Vietnam, Singapore, the Middle East and Hong Kong, it was released as the Family Computer, commonly shortened as either the romanized contraction Famicom, or abbreviated to FC. In South Korea, it was known as the Hyundai Comboy, and was distributed by Hynix which then was known as Hyundai Electronics.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "NES",
            "Nintendo",
            "Famicom",
            "FC",
            "Nintendo NES",
            "Nintendo Entertainment System (NES)"
        ]
    },
    "Nintendo Game Boy": {
        "id": 28,
        "name": "Nintendo Game Boy",
        "emulated": "true",
        "releasedate": "1989-04-21T00:00:00-07:00",
        "developer": "Nintendo",
        "manufacturer": "Nintendo",
        "cpu": "Sharp LR35902 @ 4.19 MHz",
        "memory": "8 KB SRAM and 8 KB video RAM",
        "graphics": "N\/A",
        "sound": "4 channel mono",
        "display": "160x144",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The Game Boy is an 8-bit handheld video game console developed and manufactured by Nintendo. It was released in Japan on April 21, 1989, in North America in August 1989, and in Europe in 1990. In Southern Asia, it is known as the \"Tata Game Boy\" It is the first handheld console in the Game Boy line. It was created by Gunpei Yokoi and Nintendo's Research and Development â\u0080\u0094 the same staff who had designed the Game & Watch series as well as several popular games for the NES.  The Game Boy was Nintendo's second handheld system following the Game & Watch series introduced in 1980, and it combined features from both the Nintendo Entertainment System and Game and Watch. It was also the first handheld game to use video game cartridges since Milton Bradley's Microvision handheld console. It was originally bundled with the puzzle game Tetris.  Despite many other, technologically superior handheld consoles introduced during its lifetime, the Game Boy was a tremendous success. The Game Boy and Game Boy Color combined have sold 118.69 million units worldwide. Upon its release in the United States, it sold its entire shipment of one million units within weeks.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Super Game Boy",
            "Super GameBoy",
            "Nintendo Super Gameboy",
            "Game Boy",
            "GameBoy",
            "NGB",
            "GB",
            "Nintendo GameBoy",
            "Nintendo GB",
            "Nintendo Super Game Boy"
        ]
    },
    "Nintendo Game Boy Advance": {
        "id": 29,
        "name": "Nintendo Game Boy Advance",
        "emulated": "true",
        "releasedate": "2001-06-11T00:00:00-07:00",
        "developer": "Nintendo",
        "manufacturer": "Nintendo",
        "cpu": "ARM7TDMI @16.78 MHz and Sharp LR35902 @ 4.19 MHz",
        "memory": "32 KB + 96 KB VRAM (CPU), 256 KB DRAM (ex CPU)",
        "graphics": "Custom 2D core",
        "sound": "Dual 8-bit DAC plus all Gameboy legacy channels",
        "display": "240x160",
        "media": "ROM cartridge",
        "maxcontrollers": "1",
        "notes": "The Game Boy Advance (abbreviated as GBA) is a 32-bit handheld video game console developed, manufactured and marketed by Nintendo as the successor to the Game Boy Color. It was released in Japan on March 21, 2001, in North America on June 11, 2001, in Australia and Europe on June 22, 2001, and in mainland China on June 8, 2004 (iQue Player). Nintendo's competitors in the handheld market at the time were the Neo Geo Pocket Color, WonderSwan, GP32, Tapwave Zodiac, and the N-Gage. Despite the competitors' best efforts, Nintendo maintained a majority market share with the Game Boy Advance.  As of June 30, 2010, the Game Boy Advance series has sold 81.51 million units worldwide. Its successor, the Nintendo DS, was released in November 2004 and is also compatible with Game Boy Advance software.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Game Boy Advance",
            "GameBoy Advance",
            "GBA",
            "Nintendo GameBoy Advance",
            "Nintendo GBA"
        ]
    },
    "Nintendo Game Boy Color": {
        "id": 30,
        "name": "Nintendo Game Boy Color",
        "emulated": "true",
        "releasedate": "1998-10-21T00:00:00-07:00",
        "developer": "Nintendo",
        "manufacturer": "Nintendo",
        "cpu": "Sharp LR35902 @ 8.38 MHz",
        "memory": "32 KB plus 16 KB VRAM",
        "graphics": "N\/A",
        "sound": "4 channel mono",
        "display": "160x144",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The Game Boy Color, (abbreviated as GBC) is a handheld game console manufactured by Nintendo, which was released on October 21, 1998 in Japan and was released in November of the same year in international markets. It is the successor of the Game Boy.  The Game Boy Color, as suggested by the name, features a color screen, but no backlight. It is slightly thicker and taller than the Game Boy Pocket, which is a redesigned Game Boy released in 1996. As with the original Game Boy, it has a custom 8-bit processor somewhat related to a Zilog Z80 central processing unit (CPU). The original name - with its American English spelling of \"color\" - remained unchanged even in markets where \"colour\" was the accepted English spelling.  The Game Boy Color's primary competitors were the much more advanced Neo Geo Pocket by SNK and the WonderSwan by Bandai (both released in Japan only), though the Game Boy Color outsold these by a wide margin. The Game Boy and Game Boy Color combined have sold 118.69 million units worldwide. It was discontinued in 2003, shortly after the release of the Game Boy Advance SP.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Game Boy Color",
            "GameBoy Color",
            "GBC",
            "Nintendo GameBoy Color",
            "Nintendo GBC"
        ]
    },
    "Nintendo GameCube": {
        "id": 31,
        "name": "Nintendo GameCube",
        "emulated": "true",
        "releasedate": "2001-11-18T00:00:00-08:00",
        "developer": "Nintendo",
        "manufacturer": "Nintendo \/ Foxconn",
        "cpu": "IBM PowerPC 750CXe \"Gekko\" @ 485 MHz",
        "memory": "24 MB RAM, 3 MB VRAM, 16 MB Audio RAM",
        "graphics": "ATI Rage 5 \"Flipper\" @ 162 MHz",
        "sound": "Macronix DSP @ 81 MHz",
        "display": "240p, 480i, 480p",
        "media": "Optical Disc",
        "maxcontrollers": "4",
        "notes": "The Nintendo GameCube was the first Nintendo console to use optical discs as its primary storage medium. In contrast with the GameCube's contemporary competitors, Sony's PlayStation 2, Sega's Dreamcast and Microsoft's Xbox, the GameCube uses mini DVD-based discs instead of full-size DVDs. Partially as a result of this, it does not have the DVD-Video playback functionality of these systems, nor the audio CD playback ability of other consoles that use full-size optical discs.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Nintendo Game Cube",
            "NGC",
            "GameCube",
            "Game Cube",
            "GCN"
        ]
    },
    "Nintendo Virtual Boy": {
        "id": 32,
        "name": "Nintendo Virtual Boy",
        "emulated": "true",
        "releasedate": "1995-07-21T00:00:00-07:00",
        "developer": "Nintendo",
        "manufacturer": "Nintendo",
        "cpu": "NEC V810 32-bit RISC",
        "memory": "1 MB DRAM and 512 KB P-SRAM",
        "graphics": "Reflection Technologies Inc Scanning LED array",
        "sound": "Digital stereo",
        "display": "384x224",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The Virtual Boy is a 32-bit table-top video game console developed and manufactured by Nintendo. Released in 1995, it was marketed as the first console capable of displaying stereoscopic 3D. The player uses the console in a manner similar to a head-mounted display, placing their head against the eyepiece to see a red monochrome display. The games use a parallax effect to create the illusion of depth. Sales failed to meet targets, and by early 1996, Nintendo ceased distribution and game development after shipping 1.26 million units and releasing 22 games.  Development of the Virtual Boy lasted four years, and began originally under the project name of VR32. Nintendo entered a licensing agreement to utilize a 3D LED eyepiece technology originally developed by U.S.-based company Reflection Technology. It also built a factory in China to be used exclusively for Virtual Boy manufacturing. Over the course of development, the console technology was down-scaled due to high costs and potential health concerns. Furthermore, an increasing amount of company resources were being re-allocated to Nintendo 64 development. Lead Nintendo game designer, Shigeru Miyamoto, had little involvement with the Virtual Boy software. The console was pushed to market in an unfinished state in 1995 to focus on Nintendo 64 development.  The Virtual Boy was panned by critics and was a commercial failure. Its failure has been cited as due to its high price, monochrome display, unimpressive 3D effect, lack of true portability, health concerns, and low quality games. Its negative reception was unaffected by continued price drops. 3D technology in video game consoles re-emerged in later years to more success, including in Nintendo's own 3DS handheld console. The Virtual Boy is Nintendo's second lowest-selling platform after the 64DD.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Virtual Boy",
            "VirtualBoy",
            "Nintendo VirtualBoy",
            "NVB"
        ]
    },
    "Nintendo Wii": {
        "id": 33,
        "name": "Nintendo Wii",
        "emulated": "true",
        "releasedate": "2006-12-02T00:00:00-08:00",
        "developer": "Nintendo",
        "manufacturer": "Foxconn",
        "cpu": "IBM PowerPC 750CL \"Broadway\" @ 729 MHz",
        "memory": "64 MB RAM, 24 MB VRAM",
        "graphics": "ATI R500 \"Hollywood\" @ 243 MHz",
        "sound": "Macronix DSP @ 81 MHz + Controllers with built-in speakers",
        "display": "480i, 480p",
        "media": "Optical Disc, Download",
        "maxcontrollers": "4",
        "notes": "The Wii is a home video game console released by Nintendo on November 19, 2006. As a seventh-generation console, the Wii competes with Microsoft's Xbox 360 and Sony's PlayStation 3. Nintendo states that its console targets a broader demographic than that of the two others. As of the first quarter of 2012, the Wii leads its generation over PlayStation 3 and Xbox 360 in worldwide sales, with more than 101 million units sold; in December 2009, the console broke the sales record for a single month in the United States. The Wii introduced the Wii Remote controller, which can be used as a handheld pointing device and which detects movement in three dimensions. Another notable feature of the console is the now-defunct WiiConnect24, which enabled it to receive messages and updates over the Internet while in standby mode. Like other seventh-generation consoles, it features a game download service, called \"Virtual Console\", which features emulated games from past systems. It succeeded the Nintendo GameCube, and early models are fully backwards-compatible with all GameCube games and most accessories. Nintendo first spoke of the console at the 2004 E3 press conference and later unveiled it at the 2005 E3. Nintendo CEO Satoru Iwata revealed a prototype of the controller at the September 2005 Tokyo Game Show. At E3 2006, the console won the first of several awards. By December 8, 2006, it had completed its launch in the four key markets. In late 2011, Nintendo released a reconfigured model, the \"Wii Family Edition\", which lacks Nintendo GameCube compatibility; this model was not released in Japan. The Wii Mini, Nintendo's first major console redesign since the compact SNES, succeeded the standard Wii model and was released first in Canada on December 7, 2012. The Wii Mini can only play Wii optical discs, as it omits GameCube compatibility and all networking capabilities. The Wii's successor, the Wii U, was released on November 18, 2012. On October 20, 2013, Nintendo confirmed it had discontinued production of the Wii in Japan and Europe, although the Wii Mini is still in production and available in Europe.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Wii"
        ]
    },
    "Nintendo Wii U": {
        "id": 34,
        "name": "Nintendo Wii U",
        "emulated": "true",
        "releasedate": "2012-11-18T00:00:00-08:00",
        "developer": "Nintendo",
        "manufacturer": "Nintendo, Foxconn, Mitsumi",
        "cpu": "IBM PowerPC 750CL \"Espresso\" @ 1.24 GHz",
        "memory": "2 GB DDR3",
        "graphics": "AMD TeraScale 2 \"Latte\" @ 550 MHz",
        "sound": "5.1 Linear PCM, Analog stereo",
        "display": "480p, 720p, 1080i, 1080p",
        "media": "Wii U Optical Disc (25 GB), Wii Optical Disc (4.7 GB\/8.54 GB)",
        "maxcontrollers": "8",
        "notes": "The Nintendo Wii U is an eighth generation (2012â\u0080\u0093present) home video game console developed and distributed by Nintendo. It was released on November 18, 2012 in North America at a retail price of $299. The console was later released in Europe (2012), Japan (2012), South America (2012), and Australia (2012). The Wii U was much like its predecessor the Wii, but with the added GamePad, which allowed games to be played on its screen instead of the TV, or was utilized for interesting multi-player game mechanics in some games. The console was discontinued in January 2017.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Wii U",
            "WiiU"
        ]
    },
    "Ouya": {
        "id": 35,
        "name": "Ouya",
        "emulated": "true",
        "releasedate": "2012-12-28T00:00:00-08:00",
        "developer": "Ouya, Inc.",
        "manufacturer": "Ouya, Inc.",
        "cpu": "1.7 GHz Quad-Core ARM Cortex-A9",
        "memory": "1 GiB DDR3 SDRAM",
        "graphics": "NVidia GeForce ULP @ 520 MHz (12.48 GFLOPS)",
        "sound": "HDMI (ARC), 2.0 channel",
        "display": "HDMI 1080p, 720p",
        "notes": "The Ouya, stylized OUYA, is a microconsole running its own version of the Android operating system, developed by Ouya Inc. Julie Uhrman founded the project in 2012. She brought in designer Yves BÃ©har to collaborate on the design of the project, and Muffi Al-Ghadiali as product manager to put together the engineering team. Development was funded via Kickstarter, raising $8.5 million and becoming the website's fifth-highest earning project in its history.\n\nUnits started to ship to Kickstarter backers on March 28, 2013. The console was released to the general public on June 25, 2013, and features an exclusive Ouya store for applications and games designed specifically for the Ouya platform, of which the majority are casual games targeted at or used by a mass audience of casual gamers. Out of the box, Ouya supports media apps such as TwitchTV and XBMC media player. It runs a modified version of Android 4.1 Jelly Bean, and is open to rooting without voiding the warranty (developer models ordered during the Kickstarter campaign for $699 or $1,337 come pre-rooted). The console's hardware design allows it to be easily opened up, requiring only a standard screwdriver for easy modding and possible hardware addons.\n\nAll systems can be used as development kits, allowing any Ouya owner to also be a developer, without the need for licensing fees. All games were initially required to have some kind of free-to-play aspect, whether that be completely free, has a free trial, or has purchasable upgrades, levels, or other in-game items. This requirement has since been removed. The Ouya was released during the eighth generation of video game consoles, competing against the PlayStation 4, Xbox One, and Wii U.",
        "category": "Consoles",
        "usemamefiles": "false"
    },
    "Philips CD-i": {
        "id": 36,
        "name": "Philips CD-i",
        "emulated": "true",
        "releasedate": "1991-12-03T00:00:00-08:00",
        "developer": "Philips",
        "manufacturer": "Philips",
        "cpu": "Philips SCC68070",
        "memory": "1 MB main RAM",
        "graphics": "SCC66470, later MCD 212",
        "sound": "MCD 221 16-bit stereo",
        "display": "384x280 (min), 768x560 (max)",
        "media": "CD-ROM",
        "maxcontrollers": "2",
        "notes": "The Philips CD-i (Compact Disc Interactive) is an interactive multimedia CD player developed and marketed by Royal Philips Electronics N.V. This category of device was created to provide more functionality than an audio CD player or game console, but at a lower price than a personal computer with CD-ROM drive at the time. The cost savings were due to the lack of a hard drive, floppy drive, keyboard, mouse, monitor (a standard television was used), and less operating system software. In addition to games, educational and multimedia reference titles were produced, such as interactive encyclopedias, museum tours, etc. before public Internet access was widespread. Competitors included the Tandy VIS and Commodore CDTV.\n\nSeen as a game console, the CD-i format proved to be a commercial failure. The company lost nearly one billion dollars on the entire project. The failure of the CD-i caused Philips to leave the video game industry after it was discontinued.\n\nThe CD-i is also one of the earliest consoles to implement internet features, including subscriptions, web browsing, downloading, e-mail, and online play. This was facilitated by the use of an additional hardware modem that Philips released in 1996.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Philips CD-i (Compact Disc Interactive)",
            "Compact Disc Interactive",
            "Philips Compact Disc Interactive",
            "Philips",
            "CD-i"
        ]
    },
    "Sega 32X": {
        "id": 37,
        "name": "Sega 32X",
        "emulated": "true",
        "releasedate": "1994-06-01T00:00:00-07:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "Two Hitachi SH2 32-bit RISC processors with a clock speed of 23 MHz",
        "memory": "256 Kilobytes of random-access memory (RAM)",
        "graphics": "32,768 colors and rendering 50,000 polygons per second",
        "sound": "Pulse-width modulation sound source",
        "display": "Input\/output is supplied to a television set via a provided A\/V cable that supplies composite video and stereo audio, or through an RF modulator",
        "media": "Cartridges",
        "maxcontrollers": "2",
        "notes": "The Sega 32X is an add-on for the Sega Genesis video game console. Codenamed \"Project Mars\", the 32X was designed to expand the power of the Genesis and serve as a transitional console into the 32-bit era until the release of the Sega Saturn. Independent of the Genesis, the 32X uses its own ROM cartridges and has its own library of games. The add-on was distributed under the name Super 32X (????32X?) in Japan, Sega Genesis 32X in North America, Sega Mega Drive 32X in the PAL region, and Sega Mega 32X in Brazil.\n\nUnveiled by Sega at June 1994's Consumer Electronics Show, the 32X was presented as a low-cost option for consumers looking to play 32-bit games. Developed in response to the Atari Jaguar and concerns that the Saturn would not make it to market by the end of 1994, the product was first conceived as an entirely new console. At the suggestion of Sega of America executive Joe Miller and his team, the console was converted into an add-on to the existing Genesis and made more powerful. The final design contained two 32-bit central processing unit chips and a 3D graphics processor. To bring the new add-on to market by its scheduled release date of November 1994, development of the new system and its games were rushed. The console failed to attract third-party video game developers and consumers because of the announcement of the Sega Saturn's simultaneous release in Japan. Sega's efforts to rush the 32X to market cut into available time for game development, resulting in a weak library of forty titles that could not fully utilize the add-on's hardware, including Genesis ports. By the end of 1994, the 32X had sold 665,000 units. After price reductions in 1995, it was discontinued in 1996 as Sega turned its focus to the Saturn.\n\nThe 32X is considered a commercial failure. Reception after the add-on's unveiling and launch was positive, highlighting the low price of the system and power expansion to the Genesis. Later reviews, both contemporary and retrospective, for the 32X have been mostly negative because of its shallow game library, poor market timing and the resulting market fragmentation for the Genesis.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "32X"
        ]
    },
    "Sega CD": {
        "id": 38,
        "name": "Sega CD",
        "emulated": "true",
        "releasedate": "1991-12-12T00:00:00-08:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "MC68000 @ 12.5 MHz",
        "sound": "Ricoh RF5C164",
        "display": "HDMI 1080p, 720p",
        "media": "CD-ROM, CD+G",
        "maxcontrollers": "2",
        "notes": "The Sega CD, released as the Mega-CD in most regions outside North America, is a CD-ROM accessory for the Sega Genesis video game console designed and produced by Sega as part of the fourth generation of video game consoles. The add-on was released on December 12, 1991 in Japan, October 15, 1992 in North America, and 1993 in Europe. The Sega CD lets the user play CD-based games and adds extra hardware functionality, such as a faster central processing unit and graphic enhancements. It can also play audio CDs and CD+G discs.\n\nSeeking to create an add-on device for the Genesis, Sega developed the unit to read compact discs as its storage medium. The main benefit of CD technology was greater storage capacity, which allowed for games to be nearly 320 times larger than their Genesis cartridge counterparts. This benefit manifested in the form of full motion video (FMV) games like the controversial Night Trap, which became a focus of the 1993 Congressional hearings on issues of video game violence and ratings. Sega of Japan partnered with JVC to design the add-on and refused to consult with Sega of America until the project was completed. Sega of America assembled parts from various \"dummy\" units to obtain a working prototype. While the add-on became known for several well-received games such as Sonic the Hedgehog CD and Lunar: Eternal Blue, its game library contained a large number of Genesis ports and FMV titles. The Sega CD was redesigned a number of times, including once by Sega and several times by licensed third-party developers.\n\nBy the end of 1994, the add-on had sold approximately 2.7 million units worldwide, compared to 29 million units for the Genesis sold by that time. In 1995, Sega began shifting its focus towards its new console, the Sega Saturn, over the Genesis and Sega CD. The Sega CD was officially discontinued in 1996. Retrospective reception to the add-on is mixed, praising the Sega CD for its individual offerings and additions to the Genesis' functions, but offering criticism to the game library for its depth issues, high price of the unit, and how the add-on was supported by Sega.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "CD"
        ]
    },
    "Sega Dreamcast": {
        "id": 39,
        "name": "Sega Dreamcast",
        "emulated": "true",
        "releasedate": "1998-11-27T00:00:00-08:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "Hitachi SH-4 @ 200 MHz",
        "memory": "16 MB main RAM, 8 MB video RAM",
        "graphics": "PowerVR2 CLX2 @ 100 MHz",
        "sound": "ARM7DI (Yamaha AICA) @ 45 MHz",
        "display": "Up to 640x480",
        "media": "1.2 GB GD-ROM",
        "maxcontrollers": "4",
        "notes": "The Dreamcast is a 128-bit video game console which was released by Sega in late 1998 in Japan and from September 1999 in other territories. It was the first entry in the sixth generation of video game consoles, preceding Sony's PlayStation 2, Microsoft's Xbox and the Nintendo GameCube.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Dreamcast"
        ]
    },
    "Sega Game Gear": {
        "id": 40,
        "name": "Sega Game Gear",
        "emulated": "true",
        "releasedate": "1990-10-06T00:00:00-07:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "Zilog Z80 @ 3.58 MHz",
        "memory": "8 KB RAM, 16 KB video RAM",
        "graphics": "Yamaha YM2602 @ 10.74 MHz",
        "sound": "TI SN76489",
        "display": "160x144",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The Sega Game Gear was Sega's first handheld game console. It was the third commercially available color handheld console, after the Atari Lynx and the TurboExpress.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Game Gear",
            "GameGear"
        ]
    },
    "Sega Genesis": {
        "id": 41,
        "name": "Sega Genesis",
        "emulated": "true",
        "releasedate": "1989-08-14T00:00:00-07:00",
        "developer": "Sega Enterprises",
        "manufacturer": "Sega Enterprises",
        "cpu": "Motorola 68000, Zilog Z80 co-processor",
        "memory": "64 KB main RAM and 64 KB video RAM",
        "graphics": "Yahama YM7101 VDP",
        "sound": "Yamaha YM2612, Texas Instruments SN76489A",
        "display": "256x224, 256x448, 320x224, 320x448",
        "media": "ROM cartridge",
        "maxcontrollers": "2",
        "notes": "The Sega Genesis, known as the Mega Drive in most regions outside North America, is a 16-bit home video game console which was developed and sold by Sega Enterprises, Ltd. The Genesis was Sega's third console and the successor to the Master System. Sega first released the console as the Mega Drive in Japan in 1988, followed by a North American debut under the Genesis moniker in 1989. In 1990, the console was distributed as the Mega Drive by Virgin Mastertronic in Europe, by Ozisoft in Australasia, and by Tec Toy in Brazil. In South Korea, the systems were distributed by Samsung and were known as the Super Gam*Boy, and later the Super Aladdin Boy.\n\nThe main microprocessor of the Genesis is a 16\/32-bit Motorola 68000 CPU clocked at 7.6 MHz. The console also includes a Zilog Z80 sub-processor, which was mainly used to control the sound hardware and also provides backwards compatibility with the Master System.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Genesis",
            "Mega Drive",
            "MegaDrive",
            "Sega MegaDrive",
            "Sega Mega Drive"
        ]
    },
    "Sega Master System": {
        "id": 42,
        "name": "Sega Master System",
        "emulated": "true",
        "releasedate": "1986-09-01T00:00:00-07:00",
        "developer": "SEGA Enterprises Ltd.",
        "manufacturer": "SEGA Enterprises Ltd.",
        "cpu": "8-bit NEC uPD780C @ 3.58 MHz",
        "memory": "8 KB RAM, 16 KB video RAM",
        "graphics": "Yamaha YM2602 @ 10.74 MHz",
        "sound": "TI SN76489 PSG 4 channels",
        "display": "256x224 (NTSC) or 256x240 (PAL)",
        "media": "ROM cartridge, Sega My Card",
        "maxcontrollers": "2",
        "notes": "The Master System (abbreviated to SMS) is a third-generation video game console that was manufactured and released by Sega in 1985 in Japan (as the Sega Mark III), 1986 in North America and 1987 in Europe. The original SMS could play both cartridges and the credit card-sized \"Sega Cards,\" which retailed for cheaper prices than cartridges but had less code. The SMS also featured accessories such as a light gun and 3D glasses which were designed to work with a range of specially coded games. The Master System was released as a direct competitor to the Nintendo Entertainment System in the third videogame generation The SMS was technically superior to the NES, which predated its release significantly, but failed to overturn Nintendo's significant market share advantage in Japan and North America.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Master System",
            "SMS"
        ]
    },
    "Sega Saturn": {
        "id": 43,
        "name": "Sega Saturn",
        "emulated": "true",
        "releasedate": "1994-11-22T00:00:00-08:00",
        "developer": "Sega",
        "manufacturer": "Sega, Victor, Samsung, Hitachi",
        "cpu": "2x Hitachi SH-2 @ 28.64 MHz",
        "memory": "2 MB RAM, 1,5 MB VRAM",
        "graphics": "Hitachi VDP1 @ 28.64 MHz, Yamaha VDP2 @ 28.64 MHz",
        "sound": "Yamaha FH1 DSP, Motorola 68EC000 SPU, Yamaha YM292 (SCSP)",
        "display": "320x224, 640x224, 720x576",
        "media": "CD-ROM",
        "maxcontrollers": "2 (12 with two multitaps)",
        "notes": "The Sega Saturn is a 32-bit fifth-generation video game console that was first released by Sega on November 22, 1994 in Japan, May 11, 1995 in North America, and July 8, 1995 in Europe. The system was discontinued in North America and Europe in 1998, and in 2000 in Japan. While it was popular in Japan, the Saturn failed to gain a similar market share in North America and Europe against its main competitors: Sony's PlayStation and the Nintendo 64.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Saturn"
        ]
    },
    "Sinclair ZX Spectrum": {
        "id": 44,
        "name": "Sinclair ZX Spectrum",
        "emulated": "true",
        "releasedate": "1982-04-21T00:00:00-07:00",
        "developer": "Sinclair Research",
        "manufacturer": "Sinclair Research",
        "cpu": "Zilog Z80A (or a NEC D780C-1 clone)",
        "memory": "16, 48, or 128 KB",
        "graphics": "N\/A",
        "sound": "1-channel beeper speaker (16 and 32K models) 3-channel AY-3-8912 (128K Model)",
        "display": "256x192 graphics and 32x24 text",
        "media": "Cassette tape (some latter models had external floppy support)",
        "maxcontrollers": "1",
        "notes": "The ZX Spectrum is an 8-bit personal home computer released in the United Kingdom in 1982 by Sinclair Research Ltd. It was the follow-up to the Sinclair ZX81. The Spectrum was ultimately released as eight different models (although the models after the Spectrum 128K were technically developed and manufactured by Amstrad), ranging from the entry level model with 16 kB RAM released in 1982 to the ZX Spectrum +3 with 128 kB RAM and built in floppy disk drive. The Spectrum was among the first mainstream audience home computers in the UK, similar in significance to the Commodore 64 in the USA. The Commodore 64, BBC Microcomputer and later the Amstrad CPC range were major rivals to the Spectrum in the UK market during the early 1980s.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "ZX Spectrum",
            "Spectrum",
            "ZX"
        ]
    },
    "Sony Playstation": {
        "id": 45,
        "name": "Sony Playstation",
        "emulated": "true",
        "releasedate": "1994-12-03T00:00:00-08:00",
        "developer": "Sony Computer Entertainment",
        "manufacturer": "Sony Computer Entertainment",
        "cpu": "LSI MIPS I R3000A @ 33.86 MHz",
        "memory": "2 MB RAM, 1 MB video RAM",
        "graphics": "32-bit Sony GPU @ 53 MHz",
        "sound": "16-bit Sony SPU, 24 channel ADPCM",
        "display": "256x224 to 640x480",
        "media": "CD-ROM",
        "maxcontrollers": "4",
        "notes": "The Sony PlayStation, or PS for short, is a fifth generation (1993â\u0080\u00932005) home video game console developed and distributed by Sony Interactive Entertainment. It was released on December 3, 1994 in Japan at a retail price of Â¥37,000. The console was later released in North America (1995), Europe (1995), Australia (1995), and Korea (1996). The PlayStation was known for standardizing disc based games over cartridges, as well as controllers with two analog sticks and vibration feedback.  The console was discontinued on March 23, 2006.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Playstation",
            "Play Station",
            "Sony Play Station",
            "PS1",
            "PSX",
            "PS",
            "Sony PS1",
            "Sony PSX",
            "Sony PS"
        ]
    },
    "Sony Playstation 2": {
        "id": 46,
        "name": "Sony Playstation 2",
        "emulated": "true",
        "releasedate": "2000-03-04T00:00:00-08:00",
        "developer": "Sony",
        "manufacturer": "Sony",
        "cpu": "MIPS IV 5900 \"Emotion Engine\" @ 295 MHz",
        "memory": "32 MG RDRAM and 4 MB video DRAM",
        "graphics": "Sony \"Graphics Synthesizer\" @ 147 MHz",
        "sound": "Dolby Digital 5.1 SS, Dolby Pro Logic, DTS",
        "display": "256x224 up to 1280x1024",
        "media": "CD-ROM, DVD-ROM",
        "maxcontrollers": "2",
        "notes": "The Sony PlayStation 2, or PS2 for short, is a sixth generation (1998â\u0080\u00932013) home video game console developed and distributed by Sony Interactive Entertainment. It was released on March 4, 2000 in Japan at a retail price of Â¥45,000. The console was later released in North America (2000), Europe (2000), and Australia (2000). The PlayStation 2 was the first PlayStation console to offer backwards compatibility for its predecessor's DualShock controller, as well as for its games. The console was discontinued on January 4, 2013.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Playstation 2",
            "Play Station 2",
            "Sony Play Station 2",
            "PS2"
        ]
    },
    "Sony Playstation 3": {
        "id": 47,
        "name": "Sony Playstation 3",
        "emulated": "true",
        "releasedate": "2006-11-11T00:00:00-08:00",
        "developer": "SCEI",
        "manufacturer": "Sony EMCS, Foxconn, ASUSTeK",
        "cpu": "IBM PowerPC \"Cell\/BE\" @ 3.2 GHz",
        "memory": "256 MB system and 256 MB video",
        "graphics": "Nvidia G70 \"RSX\" @ 550 MHz",
        "sound": "Analog stereo TOSLINK LPCM 2ch 44.1 kHz, 48 kHz, 88 kHz, 176.4 kHz, Dolby Digital 5.1, DTS 5.1 AAC",
        "display": "480p, 720p, 1080i, 1080p",
        "media": "Blu-Ray",
        "maxcontrollers": "7",
        "notes": "The Sony PlayStation 3, or PS3 for short, is a seventh generation (2005â\u0080\u00932017) home video game console developed and distributed by Sony Interactive Entertainment. It was released on November 11, 2006 in Japan at a retail price of Â¥59,800. The console was later released in North America (2006), Europe (2007), and Australia (2007). The PlayStation 3 was the first console to use Blu-ray Disc as its primary storage medium. The console was discontinued on May 29, 2017.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Playstation 3",
            "Play Station 3",
            "Sony Play Station 3",
            "PS3"
        ]
    },
    "Sony Playstation 4": {
        "id": 48,
        "name": "Sony Playstation 4",
        "emulated": "true",
        "releasedate": "2013-11-15T00:00:00-08:00",
        "developer": "Sony",
        "manufacturer": "Sony, Foxconn",
        "cpu": "AMD Jaguar APU @ 1.6 GHz (PS4) \/ AMD Jaguar APU @ 2.13 GHz (PS4 Pro)",
        "memory": "8 GB GDDR5 (unified), 256 MB DDR3 RAM (for background tasks)",
        "graphics": "AMD GCN 1 \"Liverpool\" @ 800 MHz (PS4) \/ AMD GCN 4 \"Neo\" @ 911 MHz (PS4 Pro)",
        "sound": "AMD TrueAudio",
        "display": "HDMI up to 4K",
        "media": "Blu-Ray",
        "maxcontrollers": "4",
        "notes": "The Sony PlayStation 4, or PS4 for short, is an eighth generation (2012-present) home video game console developed and distributed by Sony Interactive Entertainment. It was released on November 15, 2013 in North America at a retail price of $399.99. The console was later released in Europe (2013), South America (2013), Australia (2013) and Japan (2014). The PlayStation 4 places an increased emphasis on social interaction and integration with other devices and services, including the ability to play games off-console on PlayStation Vita and other supported devices via Remote Play. As of this date, the console is still in production.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Playstation 4",
            "Play Station 4",
            "Sony Play Station 4",
            "PS4"
        ]
    },
    "Sony Playstation Vita": {
        "id": 49,
        "name": "Sony Playstation Vita",
        "emulated": "true",
        "releasedate": "2011-12-17T00:00:00-08:00",
        "developer": "Sony",
        "manufacturer": "Sony",
        "cpu": "4 core ARM Cortex-A9 MPCore",
        "memory": "512 MB RAM, 128 MB VRAM",
        "graphics": "4 core SGX543MP4+",
        "sound": "Stereo speakers",
        "display": "960x544",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The PlayStation Vita is a handheld game console manufactured and marketed by Sony Computer Entertainment. It is the successor to the PlayStation Portable.\n\nThe handheld includes two analog sticks, a 5-inch (130 mm) OLED multi-touch capacitive touchscreen, and supports Bluetooth, Wi-Fi and optional 3G.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Playstation Vita",
            "PS Vita",
            "PSVita",
            "Vita"
        ]
    },
    "Sony PSP": {
        "id": 50,
        "name": "Sony PSP",
        "emulated": "true",
        "releasedate": "2004-12-12T00:00:00-08:00",
        "developer": "Sony",
        "manufacturer": "Sony",
        "cpu": "MIPS32 4K \"Allegrex\" @ 333 MHz",
        "memory": "32 MB RAM (PSP-1000), 64 MB RAM (PSP-2000), 2 MB VRAM",
        "graphics": "MIPS32 4K \"Allegrex\" @ 133 MHz",
        "sound": "Embedded VME sound core",
        "display": "480x272",
        "media": "UMD disc",
        "maxcontrollers": "1",
        "notes": "The PlayStation Portable (PSP) is a handheld game console developed by Sony. Development of the handheld was announced during E3 2003, and it was unveiled on May 11, 2004, at a Sony press conference before E3 2004. The system was released in Japan on December 12, 2004, in North America on March 24, 2005, and in the PAL region on September 1, 2005. It primarily competed with the Nintendo DS, as part of the seventh generation of video games.  The PlayStation Portable became the most powerful portable system when launched, just after the Nintendo DS in 2004. It was the first real competitor to Nintendo's handheld domination, where many challengers, such as SNK's Neo Geo Pocket and Nokia's N-Gage, failed. Its GPU encompassed high-end graphics on a handheld, while its 4.3 inch viewing screen and multi-media capabilities, such as its video player and TV tuner, made the PlayStation Portable a major mobile entertainment device at the time. It also features connectivity with the PlayStation 3, other PSPs and the Internet. It is the only handheld console to use an optical disc format, Universal Media Disc (UMD), as its primary storage medium.  The original PSP model (PSP-1000) was replaced by a slimmer model with design changes (PSP-2000\/\"Slim & Lite\") in 2007. Another remodeling followed in 2008, PSP-3000, which included a new screen and an inbuilt microphone. A complete redesign, PSP Go, came in 2009, followed by a budget model, PSP-E1000, in 2011. The PSP line was succeeded by the PlayStation Vita, released in December 2011 in Japan, and in February 2012 worldwide. The PlayStation Vita features backward compatibility with many PlayStation Portable games digitally released on the PlayStation Network, via PlayStation Store. Shipments of the PlayStation Portable ended throughout 2014 worldwide, having sold 80 million units in its 10-year lifetime.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "PSP",
            "Sony Playstation Portable",
            "PlayStation Portable"
        ]
    },
    "Super Nintendo Entertainment System": {
        "id": 51,
        "name": "Super Nintendo Entertainment System",
        "emulated": "true",
        "releasedate": "1990-11-21T00:00:00-08:00",
        "developer": "Nintendo",
        "manufacturer": "Nintendo",
        "cpu": "Ricoh 5A22",
        "memory": "Main 128 KB DRAM, Video 64 KB SRAM",
        "graphics": "16 bit PPU",
        "sound": "Sony SPC700 and Sony DSP",
        "display": "512x478 max",
        "media": "ROM cartridge",
        "maxcontrollers": "2",
        "notes": "The Super Nintendo Entertainment System (also known as the Super NES, SNES or Super Nintendo) is a 16-bit home video game console developed by Nintendo that was released in 1990 in Japan, 1991 in North America, 1992 in Europe and Australasia (Oceania), and 1993 in South America.\n\nIn Japan, the system is called the Super Famicom, officially adopting the abbreviated name of its predecessor, the Family Computer, or SFC for short.\n\nIn South Korea, it is known as the Super Comboy and was distributed by Hyundai Electronics.\n\nAlthough each version is essentially the same, several forms of regional lockout prevent the different versions from being compatible with one another.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Super Nintendo",
            "SNES",
            "Super Nintendo (SNES)",
            "Super NES",
            "Super Famicom",
            "SFC",
            "Super Comboy",
            "Comboy",
            "Super Famicom",
            "Nintendo SNES",
            "Nintendo Super Famicom"
        ]
    },
    "NEC TurboGrafx-16": {
        "id": 52,
        "name": "NEC TurboGrafx-16",
        "emulated": "true",
        "releasedate": "1989-08-29T00:00:00-07:00",
        "developer": "NEC Corporation, Hudson Soft",
        "manufacturer": "NEC Corporation, Hudson Soft",
        "cpu": "8-bit Hudson HuC6280 @ 7.16 MHz",
        "memory": "8 KB RAM, 64 KB video RAM",
        "graphics": "16-bit Hudson HuC6260 @ 10 MHz, 16-bit Hudson HuC6270 @ 10 MHz",
        "sound": "6 PSG audio channels",
        "display": "256x224p, 352x224p, 512x224p, 256x240p, 352x240p, 512x240p, 256x448i, 352x448i, 512x448i, 256x480i, 352x480i, 512x480i",
        "media": "HuCards (aka Turbo Chips)",
        "maxcontrollers": "1 (up to 5 with TurboTap)",
        "notes": "TurboGrafx-16, fully titled as TurboGrafx-16 Entertainment SuperSystem and known in Japan as the PC Engine, is a video game console developed by Hudson Soft and NEC, released in Japan on October 30, 1987, and in North America on August 29, 1989.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "NEC TurboGrafx-16",
            "NEC PC Engine",
            "PC Engine",
            "NEC TurboGrafx 16",
            "TurboGrafx 16 Entertainment SuperSystem",
            "NEC TurboGrafx",
            "TurboGrafx-16 Entertainment SuperSystem",
            "TurboGrafx 16",
            "TurboGrafx",
            "TESS"
        ]
    },
    "WonderSwan": {
        "id": 53,
        "name": "WonderSwan",
        "emulated": "true",
        "releasedate": "1999-03-04T00:00:00-08:00",
        "developer": "Bandai Co., Ltd.",
        "manufacturer": "Bandai Co., Ltd.",
        "cpu": "NEC V30MZ @ 3 MHz",
        "memory": "64 KB",
        "graphics": "Custom Chip (Supports 8 Shades of Gray)",
        "sound": "Custom Chip (4 Channels)",
        "display": "224 x 144",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "TheÂ Bandai WonderSwan, usually just referred to as WonderSwan, is a fifth generation (1993-2005) handheld video game console developed and distributed by Bandai Co., Ltd. It was released on March 4, 1999 in Japan at a retail price of Â¥4,800. The console was not released outside of Japan. The WonderSwan system had a low price point and long battery life which made it a formable competitor to Nintendo in Japan. The console was discontinued in Mid to late 2003.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Wonder Swan",
            "Bandai WonderSwan"
        ]
    },
    "WonderSwan Color": {
        "id": 54,
        "name": "WonderSwan Color",
        "emulated": "true",
        "releasedate": "2000-12-09T00:00:00-08:00",
        "developer": "Bandai Co., Ltd.",
        "manufacturer": "Bandai Co., Ltd.",
        "cpu": "NEC V30 MZ 3.072 MHz",
        "memory": "512 KB VRAM\/WRAM shared",
        "graphics": "Custom Chip (Supports 241 Colors)",
        "sound": "Custom Chip (4 Channels)",
        "display": "224 x 144",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The Bandai WonderSwan Color, usually just referred to as WonderSwan Color, is a fifth generation (1993-2005) handheld video game console developed and distributed by Bandai Co., Ltd. It was released on December 9, 2000 in Japan at a retail price of Â¥6,900. The console was not released outside of Japan. The WonderSwan Color was backwards compatible to the Wonderswan and still held a long lasting battery life. The console was discontinued in mid to late 2003.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Bandai WonderSwan Color",
            "Wonder Swan Color"
        ]
    },
    "Magnavox Odyssey 2": {
        "id": 55,
        "name": "Magnavox Odyssey 2",
        "emulated": "true",
        "releasedate": "1978-12-01T00:00:00-08:00",
        "developer": "Magnavox \/ Philips",
        "manufacturer": "Magnavox \/ Philips",
        "cpu": "Intel 8048 @ 1.79 MHz",
        "memory": "64 bytes RAM, 128 bytes VRAM",
        "graphics": "Intel 8244 (NTSC)  @ 3.58 MHz or 8245 (PAL) @ 3.58 MHz",
        "sound": "1 channel, handled by the graphics chip",
        "display": "160x200",
        "media": "ROM cartridge",
        "maxcontrollers": "2",
        "notes": "The Magnavox Odyssey 2 is a second generation (1976â\u0080\u00931992) home video game console developed and distributed by Magnavox. It was released in February 1979 in North America at a retail price of $179. The console was also released in Europe (1979), and later South America (1983), and Japan (1982). The Odyssey 2 included a full alphanumeric membrane keyboard, which was to be used for educational games, selecting options, or programming. The console was discontinued on March 20, 1984.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Magnavox OdysseyÂ²",
            "Magnavox Odyssey Â²",
            "Odyssey 2",
            "OdysseyÂ²",
            "Odyssey Â²"
        ]
    },
    "Fairchild Channel F": {
        "id": 56,
        "name": "Fairchild Channel F",
        "emulated": "true",
        "releasedate": "1976-11-01T00:00:00-08:00",
        "developer": "Fairchild Semiconductor",
        "manufacturer": "Fairchild Semiconductor",
        "cpu": "Fairchild F8 (2-chip cpu)",
        "memory": "64 bytes main RAM, 2 KB video RAM",
        "graphics": "N\/A",
        "sound": "120, 500, 1000 Hz beeps modulatable",
        "display": "128x64",
        "media": "ROM cartridge",
        "maxcontrollers": "2",
        "notes": "The Fairchild Channel F is a home video game console released by Fairchild Semiconductor in November 1976.\n\nIt has the distinction of being the first programmable ROM cartridgeâ\u0080\u0093based video game console, and the first console to use a microprocessor. It was launched as the Video Entertainment System, or VES, but when Atari released their VCS the next year, Fairchild renamed it's machine.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Channel F",
            "Video Entertainment System",
            "VES"
        ]
    },
    "BBC Microcomputer System": {
        "id": 57,
        "name": "BBC Microcomputer System",
        "emulated": "true",
        "releasedate": "1981-12-01T00:00:00-08:00",
        "developer": "Acorn Computers",
        "manufacturer": "Acorn Computers",
        "cpu": "MOS Technology 6502A\/6512A",
        "memory": "16 KB, 32 KB, 64 KB, 128 KB",
        "graphics": "Motorola 6845 and Mullard SAA5050 Teletext",
        "sound": "Texas Instruments SN76489, 4 channels, mono",
        "display": "8 modes: 5 graphics, 2 text only and 1 Teletext",
        "media": "Cassette tape, Floppy disc, Winchester HD",
        "maxcontrollers": "2",
        "notes": "The British Broadcasting Corporation Microcomputer System, BBC Microcomputer System, or best known as the BBC Micro is a series of microcomputers designed by Acorn Computers Ltd. and distributed by the BBC. The first models were released in December 1981 in Europe for Â£235 or Â£335, depending on the model. The computers were also released in North America (1983). The computers were designed with an emphasis on education, and being more rugged then other brands. The computers were manufactured until an unspecified time in 1994.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Acorn BBC Micro",
            "BBC Micro",
            "BBC"
        ]
    },
    "Memotech MTX512": {
        "id": 58,
        "name": "Memotech MTX512",
        "emulated": "true",
        "releasedate": "1983-06-01T00:00:00-07:00",
        "developer": "Memotech",
        "manufacturer": "Memotech",
        "cpu": "Zilog Z80A",
        "memory": "64 KB fitted (512 KB max)",
        "graphics": "Texas TMS 9929A (PAL) TMS 9918 (NTSC)",
        "sound": "TI SN76489AN (4 channels - 3 voice 1 noise)",
        "display": "256x192 (3 modes - 2 graphics 1 text)",
        "media": "Cassette tape",
        "maxcontrollers": "2",
        "notes": "Like many of the other computers at the time, including the Sinclair ZX range, Memotech computers were based on the Zilog Z80 8-bit microprocessor. The computers were originally available in two models, the MTX500 with 32KBytes of RAM and the MTX512 with 64KBytes of RAM. The MTX500 was launched at the Earls Court Computer Fair in June 1983 and the MTX512 was available later in the year.\n\nThe final machine from Memotech Computers, released in September 1984, was the RS128. The RS128 was fitted with 128 KBytes of RAM and used page switching to get around the Z80 restriction of only being able to address a maximum of 64KBytes of RAM.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "MTX512"
        ]
    },
    "Camputers Lynx": {
        "id": 59,
        "name": "Camputers Lynx",
        "emulated": "true",
        "releasedate": "1983-01-01T00:00:00-08:00",
        "developer": "Camputers",
        "manufacturer": "Camputers",
        "cpu": "Z80A",
        "memory": "48 KB, 96KB, 128 KB, 192KB",
        "graphics": "Motorola 6845",
        "sound": "4-bit DAC",
        "display": "256x252 8 colours",
        "media": "Cassette tape, Floppy disc (optional)",
        "notes": "The Lynx was an 8-bit British home computer that was first released in early 1983 as a 48 kB model. Several models were available with 48 kB, 96 kB or 128 kB RAM. It was possible to reach 192 kB with RAM expansions on board. John Shireff designed the hardware and Davis Jansons the firmware.\n\nThe machine was based around a Z80A CPU clocked at 4 MHz, (6 MHz for the 128\/192 kB models) and featured a Motorola 6845 as video controller. It was possible to run CP\/M with the optional 5.25\" floppy disk-drive on the 96 kB and 128 kB models\n\nCompared to, for example, the Commodore 64, the BASIC was more extensive and faster and resolution of graphics was better; but computer games on the other hand suffered from the special implementation and lack of hardware for sound and sprites. Thus, it was better for exploring programming or working with maths.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Camputers"
        ]
    },
    "Tiger Game.com": {
        "id": 60,
        "name": "Tiger Game.com",
        "emulated": "true",
        "releasedate": "1997-09-01T00:00:00-07:00",
        "developer": "Tiger Electronics",
        "manufacturer": "Tiger Electronics",
        "cpu": "Sharp SM8521 @ 5.5 MHz",
        "memory": "1 MB RAM",
        "graphics": "Sharp SM8521",
        "sound": "8-bit PCM and FM synthesis",
        "display": "200x160 4 shade grayscale",
        "media": "ROM cartridge",
        "notes": "The Game.com is a fifth-generation handheld game console released by Tiger Electronics in August 1997. A smaller version, the Game.com Pocket Pro, was released in mid-1999. The first version of the Game.com can be connected to a 14.4 kbit\/s modem for Internet connectivity, hence its name referencing the top level domain .com. It was the first video game console to include a touchscreen and the first handheld console to include Internet connectivity. The Game.com sold less than 300,000 units and was discontinued in 2000 because of poor sales. While the Game.com was a commercial failure, similar features were later used with great success by Nintendo in their DS handheld console. The Game.com was the first to include basic PDA-functions, the first to allow two game carts to be inserted at once, and the first handheld to allow internet access.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Game.com",
            "Tiger Game com",
            "TGame com"
        ]
    },
    "Oric Atmos": {
        "id": 61,
        "name": "Oric Atmos",
        "emulated": "true",
        "releasedate": "1984-01-01T00:00:00-08:00",
        "developer": "Oric Products",
        "manufacturer": "Oric Products",
        "cpu": "MOS 6502A",
        "memory": "48 KB",
        "graphics": "Semi-custom ASIC",
        "sound": "GI 8912",
        "display": "200x240 graphics and 28x40 text mode",
        "media": "Cassette tape, Microdisc, Floppy disc",
        "notes": "The Oric Atmos was a British designed and built machine and was the successor to the Oric 1. Oric International to released the Oric Atmos, which added a true keyboard and an updated V1.1 ROM to the Oric-1.  Soon after the Atmos was released, the modem, printer and 3-inch floppy disk drive originally promised for the Oric-1 were announced and released by the end of 1984. Our Oric Atmos is on display in our main gallery.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Atmos",
            "Tangerine Oric"
        ]
    },
    "Acorn Electron": {
        "id": 62,
        "name": "Acorn Electron",
        "emulated": "true",
        "releasedate": "1983-08-25T00:00:00-07:00",
        "developer": "Acorn Computers",
        "manufacturer": "Acorn Computers",
        "cpu": "MOS Technology 6502A",
        "memory": "32 KB",
        "graphics": "BBC Micro hardware emulated in software",
        "sound": "1 sound channel and 1 emulated noise channel",
        "display": "5 graphics modes and 5 text",
        "media": "Tape, Floppy disc, ROM cartridge",
        "notes": "The Acorn Electron is a home computer designed by Acorn Computers Ltd. The computer was released in August 1983 in Europe at a retail price of Â£175. The computer was not released outside of Europe. The Electron was a budget version of the BBC Micro educational\/home computer, and for a short period, the Electron was reportedly the best selling micro in the United Kingdom. The computer was manufactured until an unspecified time in 1985.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Acorn Computers Electron",
            "Electron"
        ]
    },
    "Dragon 32\/64": {
        "id": 63,
        "name": "Dragon 32\/64",
        "emulated": "true",
        "releasedate": "1982-08-01T00:00:00-07:00",
        "developer": "Dragon Data",
        "manufacturer": "Dragon Data",
        "cpu": "Motorola MC6809E",
        "memory": "32 KB, 64 KB",
        "graphics": "MC6847 VDG",
        "sound": "N\/A",
        "display": "Various modes",
        "media": "Cassette tape",
        "maxcontrollers": "2",
        "notes": "The Dragon 32 and Dragon 64 are home computers that were built in the 1980s. The Dragons are very similar to the TRS-80 Color Computer, and were produced for the European market by Dragon Data, Ltd., in Port Talbot, Wales, and for the US market by Tano of New Orleans, Louisiana.\n\nA broad range of peripherals exist for the Dragon 32\/64, and on top of this there are add-ons such as the Dragon's Claw which give the Dragons access to the BBC Micro's large range of accessories (a particularly important factor in the UK home market).\n\nThe Dragon uses analogue joysticks, unlike most systems of the time which used less versatile but cheaper digital systems. Other uses for the joystick ports include light pens.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Dragon",
            "Dragon 32",
            "Dragon 64",
            "Dragon 32-64",
            "Dragon Data Dragon"
        ]
    },
    "Entex Adventure Vision": {
        "id": 64,
        "name": "Entex Adventure Vision",
        "emulated": "true",
        "releasedate": "1982-01-01T00:00:00-08:00",
        "developer": "Entex Industries",
        "manufacturer": "Entex Industries",
        "cpu": "Intel 8048",
        "memory": "1 KB",
        "graphics": "40x1 LED array and a spinning mirror, 15 fps",
        "sound": "National Semiconductor COP411L",
        "display": "150x40",
        "media": "ROM cartridge",
        "maxcontrollers": "1",
        "notes": "The Adventurevision is a cartridge based tabletop video game system produced by Entex in 1982. The system has a rather unique built in LED display composed of a column of 40 LEDs and a spinning mirror that produced a display with a resolution of 150x40 pixels. Another product using this technique was produced by Nintendo in the mid 1990sâ\u0080\u0093the Virtual Boy. Control is through a single multi-position joystick and two sets of four buttons, one on each side of the joystick, for ease of play by both left- and right-handed players. Four game cartridges can be stored in  bays on top of the case. With hindsight this seems inspired as ultimately only four games were released. Three were arcade ports, Defender, Super Cobra and Turtles and the fourth was an Asteroids clone called Space Force. It's a very rare system (only 10,000 units were made, and only 1000 each of the 3 separate games), and due to it's fragile nature and moving parts not many have survived. Boxed systems can sell for around 20 times the original retail price.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Adventure Vision"
        ]
    },
    "APF Imagination Machine": {
        "id": 65,
        "name": "APF Imagination Machine",
        "emulated": "true",
        "releasedate": "1979-12-31T00:00:00-08:00",
        "developer": "APF Electronics",
        "manufacturer": "APF Electronics",
        "cpu": "Motorola 6800",
        "memory": "1 KB expandable to 17 KB",
        "graphics": "MC6847",
        "sound": "One sound channel in 5 octaves",
        "display": "128x192 and 256x192 (8 and 4 colours)",
        "media": "ROM cartridge",
        "maxcontrollers": "2",
        "notes": "The APF Imagination Machine is a combination home video game console and computer system released by APF Electronics Inc. in late 1979. It was composed of two separate components, the APF-M1000 game system, and an add on docking bay with full sized typewriter keyboard and tape drive. The APF-M1000 was built specifically to compete with the Atari 2600.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Imagination Machine",
            "APF",
            "APF-M1000"
        ]
    },
    "Mattel Aquarius": {
        "id": 66,
        "name": "Mattel Aquarius",
        "emulated": "true",
        "releasedate": "1983-06-01T00:00:00-07:00",
        "developer": "Radofin",
        "manufacturer": "Radofin",
        "cpu": "Zilog Z80A",
        "memory": "4 KB expandable to 52 KB",
        "graphics": "N\/A",
        "sound": "1 voice expandable to 4",
        "display": "80x72 graphics and 40x24 text",
        "media": "Cassette tape, ROM cartridge",
        "notes": "The Mattel Aquarius was the first and only genuine home computer offered by Mattel Electronics. Mattel did not start by designing a computer. It instead began by looking around for a pre-made computer system it could market under its name. It discovered that one of its manufacturing partners, the Hong Kong based Radofin Electronics Far East, had already designed a three-system line of home computers. All Mattel had to do was secure the U.S. marketing rights, which it promptly did for the first two units in the line, and have Radofin handle the manufacturing.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Aquarius"
        ]
    },
    "Jupiter Ace": {
        "id": 67,
        "name": "Jupiter Ace",
        "emulated": "true",
        "releasedate": "1982-01-01T00:00:00-08:00",
        "developer": "Jupiter Cantab",
        "manufacturer": "Jupiter Cantab",
        "cpu": "Zilog Z80A",
        "memory": "3 KB expandable to 17 KB",
        "graphics": "Independent sub-system 2 banks of 1 KB SRAM",
        "sound": "1 channel buzzer",
        "display": "32x24 and 64x48 monochrome",
        "media": "Cassette tape",
        "notes": "The Jupiter Ace was a British home computer of the early 1980s, produced by a company set up for the purpose, named Jupiter Cantab. The Ace differed from other microcomputers of the time in that it used Forth instead of the more common BASIC.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Ace",
            "Jupiter"
        ]
    },
    "SAM CoupÃ©": {
        "id": 68,
        "name": "SAM CoupÃ©",
        "emulated": "true",
        "releasedate": "1989-01-01T00:00:00-08:00",
        "developer": "MGT",
        "manufacturer": "MGT",
        "cpu": "Zilog Z80B",
        "memory": "256 KB or 512 KB expandable to 4.5 MB max",
        "graphics": "VLSI ASIC",
        "sound": "Phillips SAA1099 6 channel stereo",
        "display": "256x192 512x192",
        "media": "Cassette tape, Floppy disc",
        "maxcontrollers": "1 (2 using a splitter)",
        "notes": "In the last quarter of 1989 MGT launched the Sam CoupÃ©. MGT was already known in the ZX Spectrum world for a range of hardware that they sold. The Sam was their pride and joy, and unfortunately to be their downfall.\n\nThe SAM name comes from a working name in the early design phases of â\u0080\u0098Some Amazing Machineâ\u0080\u0099 (or â\u0080\u0098Some Amazing Microâ\u0080\u0099 or even â\u0080\u0098Spectrum Advanced Machineâ\u0080\u0099 depending on who you talk to) and the â\u0080\u0098CoupÃ©â\u0080\u0099 was a nickname because the machine resembles a fastback car in profile.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "CoupÃ©",
            "SAM Coupe",
            "Coupe",
            "MGT SAM Coupe"
        ]
    },
    "Enterprise": {
        "id": 69,
        "name": "Enterprise",
        "emulated": "true",
        "releasedate": "1985-01-01T00:00:00-08:00",
        "developer": "Intelligent Software",
        "manufacturer": "Enterprise Computers",
        "cpu": "Zilog Z80A",
        "memory": "64 KB or 128 KB",
        "graphics": "Nick ASIC",
        "sound": "Dave ASIC",
        "display": "5 graphics and 2 text modes",
        "media": "Cassette tape, ROM cartridge",
        "maxcontrollers": "2",
        "notes": "The Enterprise (aka Elan) is a Zilog Z80-based home computer first produced in 1985. It was developed by British company Intelligent Software and marketed by Enterprise Computers. Its two variants are the Enterprise 64, with 64 kilobytes (kB) of Random Access Memory (RAM), and the Enterprise 128, with 128 kB of RAM.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Enterprise 64",
            "Enterprise 128",
            "Flan",
            "Elan"
        ]
    },
    "EACA EG2000 Colour Genie": {
        "id": 70,
        "name": "EACA EG2000 Colour Genie",
        "emulated": "true",
        "releasedate": "1982-08-01T00:00:00-07:00",
        "developer": "EACA",
        "manufacturer": "EACA",
        "cpu": "Zilog Z80",
        "memory": "16 KB expandable to 32 KB",
        "graphics": "Motorola 6845",
        "sound": "AY-3-8910",
        "display": "160x96 plus 40x24 text",
        "media": "Tape, ROM cartridge, Floppy disc",
        "maxcontrollers": "2",
        "notes": "The EACA EG2000 Colour Genie was a computer produced by Hong Kong-based manufacturer EACA and introduced in Germany in August 1982. It followed their earlier Video Genie I and II computers and was released around the same time as the business-oriented Video Genie III.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "EACA",
            "Colour Genie",
            "EG2000",
            "EACA EG2000",
            "EG2000 Colour Genie",
            "EG2000 Color Genie",
            "Color Genie"
        ]
    },
    "Acorn Archimedes": {
        "id": 71,
        "name": "Acorn Archimedes",
        "emulated": "true",
        "releasedate": "1989-06-18T00:00:00-07:00",
        "developer": "Acorn Computers",
        "manufacturer": "Acorn Computers",
        "cpu": "Type ARM2, Model VL2333-QC",
        "memory": "4 MB",
        "graphics": "VIDC1a",
        "sound": "8 channel stereo",
        "display": "Up to 1152x896",
        "media": "Floppy disc, Hard disc 20 MB",
        "notes": "The Acorn Archimedes is a family of personal computers designed by Acorn Computers Ltd. The first models were released in June 1987 in Europe at a retail price around Â£800. The computers were also released in Australia (1988) and in limited availability in North America (1990). The Archimedes computers were one of the most powerful available during the late 1980s and early 1990s. The computers were manufactured until an unspecified time in 1995.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Archimedes",
            "Acorn Computers Archimedes"
        ]
    },
    "Tapwave Zodiac": {
        "id": 72,
        "name": "Tapwave Zodiac",
        "emulated": "true",
        "releasedate": "2003-10-01T00:00:00-07:00",
        "developer": "Tapwave",
        "manufacturer": "Tapwave",
        "cpu": "Motorola i.MX1 ARM9",
        "memory": "32 MB (Zodiac 1), 128 MB (Zodiac2 )",
        "graphics": "ATI Imageon W4200 2D",
        "sound": "Yahama",
        "display": "480x320 half VGA",
        "media": "MMC \/ SD card",
        "maxcontrollers": "1 analog built in",
        "notes": "Tapwave, founded in May 2001 by former Palm executives, announced the Zodiac mobile entertainment console in May 2003 and began shipping in October 2003. Zodiac was designed to be a high-performance mobile entertainment system centered on games, music, photos, and video.\n\nBy running an enhanced version of the Palm Operating System (5.2T), Zodiac also provided access to Palmâ\u0080\u0099s personal information management software and many other applications from the Palm developer community.  \n\nThe Zodiac console was initially available in two models, Zodiac 1 (32MB), and Zodiac 2 (128MB).\n\nSome of the noteworthy game titles for the product included: Tony Hawkâ\u0080\u0099s Pro Skater 4 (Activision); Mototrax (Activision); Spyhunter (Midway); Madden NFL 2005 â\u0080\u0093 (EA\/MDM); DOOM II (id Software); Golden Axe 3 and Altered Beast (Sega); Warfare Incorporated (Handmark); and Duke Nukem Mobile (3D Realms\/MachineWorks).",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Zodiac",
            "Zodiac 1",
            "Zodiac 2",
            "Tapwave Zodiac 1",
            "Tapwave Zodiac 2"
        ]
    },
    "Atari ST": {
        "id": 73,
        "name": "Atari ST",
        "emulated": "true",
        "releasedate": "1985-06-01T00:00:00-07:00",
        "developer": "Atari",
        "manufacturer": "Atari",
        "cpu": "Motorola 68000",
        "memory": "512 KB or 1 MB",
        "graphics": "Custom",
        "sound": "YM2149F PSG",
        "display": "320x200, 640x200, 640x400",
        "media": "Cartridge, Floppy disc",
        "maxcontrollers": "1",
        "notes": "The Atari ST is a line of home computers from Atari Corporation. The first models were released in June 1985 in North America at a retail price around $799.99 or $999.99, depending on the model. The computers were also released in limited availability in Europe (1985). The ST is the first personal computer to come with a bitmapped color GUI. The computers were manufactured until an unspecified time in 1993.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Bally Astrocade": {
        "id": 74,
        "name": "Bally Astrocade",
        "emulated": "true",
        "releasedate": "1977-12-01T00:00:00-08:00",
        "developer": "Midway",
        "manufacturer": "Bally, Astrovision",
        "cpu": "Zilog Z80 @ 1.789 MHz",
        "memory": "4 KB RAM expandable to 64 KB, 8 KB ROM",
        "graphics": "Custom on-board chip, bitmap, 2 plane bitpacked",
        "sound": "3 voices + noise\/vibrato effects, (played through TV)",
        "display": "160x102 up to 320x204",
        "media": "Cartridge",
        "maxcontrollers": "4",
        "notes": "The Bally Astrocade, originally referred to as the Bally Home Library Computer, is a second generation (1976â\u0080\u00931992) home video game console developed by Midway and distributed by Bally Manufacturing. It was released in late 1977 in North America at a retail price of $299. The console was not released outside North America. The Astrocade was known for having the most powerful graphics and sound capabilities for all consoles of it's era. The console was discontinued in mid to late 1983.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Astrocade",
            "Bally Home Library Computer",
            "Bally Professional Arcade",
            "Professional Arcade"
        ]
    },
    "Magnavox Odyssey": {
        "id": 75,
        "name": "Magnavox Odyssey",
        "emulated": "true",
        "releasedate": "1972-05-01T00:00:00-07:00",
        "developer": "Magnavox",
        "manufacturer": "Magnavox",
        "cpu": "None - discrete components only",
        "memory": "None",
        "graphics": "White squares on a black background",
        "sound": "None",
        "display": "N\/A",
        "media": "Pin out cards",
        "maxcontrollers": "2",
        "notes": "The Magnavox Odyssey is a first generation (1972â\u0080\u00931980) home video game console developed and distributed by Magnavox. It was released in September 1972 in North America at a retail price of $99. The console was later released in Europe (1973). The Odyssey is the known to be the first commercial home video game console. The console was discontinued sometime in 1975.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Odyssey"
        ]
    },
    "Emerson Arcadia 2001": {
        "id": 76,
        "name": "Emerson Arcadia 2001",
        "emulated": "true",
        "releasedate": "1982-05-01T00:00:00-07:00",
        "developer": "Emerson Radio",
        "manufacturer": "Emerson Radio",
        "cpu": "Signetics 2650",
        "memory": "1 Kilobyte",
        "graphics": "Signetics 2637 VDC",
        "sound": "2 channel, beep and noise",
        "display": "Two modes: 208x108 and 128Ã\u0097104 (8 colors)",
        "media": "Cartridge",
        "maxcontrollers": "2",
        "notes": "Emerson Arcadia 2001 was supposed to be the Atari 2600 killer.  A great console with great games.  Unfortunately they fell prey to complete lack of third party development and the lack of arcade game titles.  Similar to other consoles before it, they were forced to release arcade clones.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Emerson Arcadia",
            "Arcadia",
            "Arcadia 2001"
        ]
    },
    "Sega SG-1000": {
        "id": 77,
        "name": "Sega SG-1000",
        "emulated": "true",
        "releasedate": "1983-07-15T00:00:00-07:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "NEC 780C",
        "memory": "2 KB RAM, 16 KB video RAM",
        "graphics": "Texas Instruments TMS9928A VDC",
        "sound": "Texas Instruments SN76489, 4 channel mono",
        "display": "256x192",
        "media": "Cartridge",
        "maxcontrollers": "2",
        "notes": "Sega's SG-1000 (Sega Game 1000) (a.k.a Mark I) was the company's first attempt at home consoles.  It was initially test marketed in 1981 and finally released to Japanese consumers in July of 1983.  It was a pretty advanced system for its time and featured impressive technical specifications.  The system would be sold in Japan until 1985 and was released in various markets throughout European and Australasia.\n\nIn 1984, Sega released an updated version of the console called the SG-1000 Mark II.  This remodeled version used gamepads instead of the original joysticks and had mounts to store them on each side.  It also featured a slot which allowed a keyboard attachment called SK-1100 and was compatible with software from the Sega SC-3000 computer.  Sega also sold an optional adaptor called Card Catcher.  This adaptor would allow the SG-1000 to play Sega \"Game Card\" software.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "SG-1000",
            "Sega Game 1000",
            "SG1000",
            "Sega SG1000"
        ]
    },
    "Epoch Super Cassette Vision": {
        "id": 78,
        "name": "Epoch Super Cassette Vision",
        "emulated": "true",
        "releasedate": "1984-07-17T00:00:00-07:00",
        "developer": "Epoch",
        "manufacturer": "Epoch",
        "cpu": "NEC PD7801G",
        "memory": "128 bytes RAM plus 4 KB video RAM",
        "graphics": "Epoch TD-1 VDC",
        "sound": "PD1771C, 1 channel",
        "display": "309x246",
        "media": "Cartridge",
        "maxcontrollers": "2",
        "notes": "The Super Cassette Vision was released in 1984 as the successor to Epoch's Cassette Vision.  The system was also manufactured and distributed for Europe (particularly France) by a company called ITMC.  In Europe it was called the Yeno Super Cassette Vision.\n\nIn 1985, Epoch decided to release a limited edition version called Lady Cassette Vision.  The pink colored console came bundled with it's own carrying case and a game called Milky Princess.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Super Cassette Vision",
            "SCV"
        ]
    },
    "Microsoft MSX": {
        "id": 79,
        "name": "Microsoft MSX",
        "emulated": "true",
        "releasedate": "1983-06-27T00:00:00-07:00",
        "developer": "Microsoft",
        "manufacturer": "Various",
        "cpu": "Zilog Z80A",
        "memory": "8 KB minimum, 32 or 64 KB common, 128 KB some",
        "graphics": "Texas Instruments TMS9918 family",
        "sound": "General Instruments AY-3-8910 PSG",
        "display": "256x192 plus 2 text modes 40x24 and 32x24",
        "media": "Cassette tape, Cartridge",
        "notes": "MSX is the name of a standardized home computer architecture, first announced by Microsoft on June 16, 1983.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "MSX 2",
            "MSX 2+",
            "MSX Laserdisc",
            "MSX"
        ]
    },
    "MS-DOS": {
        "id": 80,
        "name": "MS-DOS",
        "emulated": "false",
        "releasedate": "1981-08-01T00:00:00-07:00",
        "developer": "Microsoft",
        "manufacturer": "IBM",
        "notes": "MS-DOS, short for Microsoft Disk Operating System, was an operating system for x86-based personal computers mostly developed by Microsoft. It was the most commonly used member of the DOS family of operating systems, and was the main operating system for IBM PC compatible personal computers during the 1980s to the mid-1990s, when it was gradually superseded by operating systems offering a graphical user interface (GUI), in various generations of the Microsoft Windows operating system.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "DOS",
            "Microsoft MS-DOS",
            "Microsoft DOS",
            "PC DOS",
            "PC-DOS",
            "IBM DOS"
        ]
    },
    "Windows": {
        "id": 81,
        "name": "Windows",
        "emulated": "false",
        "releasedate": "1985-11-20T00:00:00-08:00",
        "developer": "Microsoft",
        "notes": "Microsoft introduced an operating environment named Windows on November 20, 1985 as a graphical operating system shell for MS-DOS in response to the growing interest in graphical user interfaces (GUIs). Microsoft Windows came to dominate the world's personal computer market with over 90% market share, overtaking Mac OS, which had been introduced in 1984.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Microsoft Windows",
            "Win32",
            "Win16",
            "Win64",
            "Windows 95",
            "Windows 98",
            "Windows XP",
            "Windows 2000",
            "Windows ME",
            "Windows Vista",
            "Windows 7",
            "Windows 8",
            "Windows 8.1",
            "Windows 10",
            "Windows 3.1",
            "Windows 3.11",
            "Windows 3.0",
            "Microsoft Windows 95",
            "Microsoft Windows 98",
            "Microsoft Windows XP",
            "Microsoft Windows 2000",
            "Microsoft Windows ME",
            "Microsoft Windows Vista",
            "Microsoft Windows 7",
            "Microsoft Windows 8",
            "Microsoft Windows 8.1",
            "Microsoft Windows 10",
            "Microsoft Windows 3.1",
            "Microsoft Windows 3.11",
            "Microsoft Windows 3.0",
            "PC"
        ]
    },
    "Web Browser": {
        "id": 82,
        "name": "Web Browser",
        "emulated": "false",
        "notes": "A browser game is a computer game that is played over the Internet using a web browser. Browser games can be run using standard web technologies or browser plug-ins. The creation of such games usually involves use of standard web technologies as a frontend and other technologies to provide a backend. Browser games include all video game genres and can be single-player or multiplayer. Browser games are also portable and can be played on multiple different devices, web browsers, and operating systems.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Web",
            "Browser",
            "Web Games",
            "Browser Games",
            "Internet",
            "Internet Games",
            "Chrome",
            "Firefox",
            "Internet Explorer"
        ]
    },
    "Sega Model 2": {
        "id": 83,
        "name": "Sega Model 2",
        "emulated": "true",
        "releasedate": "1993-01-01T00:00:00-08:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "Intel i960-KB @ 25 MHz",
        "memory": "9776 KB (Model 2\/2A-CRX), or 18,388 KB (Model 2B\/2C-CRX)",
        "graphics": "6Ã\u0097 Fujitsu TGP MB86234 (Model 2\/2A-CRX), or 2Ã\u0097 Analog Devices ADSP-21062 SHARC (Model 2B-CRX), or 2Ã\u0097 Fujitsu TGPx4 MB86235 (Model 2C-CRX)",
        "sound": "2Ã\u0097 Sega 315-5560 Custom MultiPCM (Model 2), or Yamaha SCSP (Model 2A\/2B\/2C-CRX)",
        "display": "496Ã\u0097384 pixels, 24 Hz horizontal sync, 60 Hz refresh rate, progressive scan (non-interlaced)",
        "media": "Arcade System Bosrd",
        "maxcontrollers": "2",
        "notes": "The Sega Model 2 is an arcade system board originally debuted by Sega in 1993 as a successor to the Sega Model 1 board. It is an extension of the Model 1 hardware, most notably introducing the concept of texture-mapped polygons, allowing for more realistic 3D graphics (for its time). The Model 2 board was an important milestone for the arcade industry, and helped launch several key arcade franchises of the 90s, including Daytona USA, Virtua Cop, Sega Rally Championship, Dead or Alive, Virtua Striker, Cyber Troopers Virtual-On and The House of the Dead. \n\nThe Model 2 was engineered with help from GE Aerospace (acquired by Martin Marietta in 1993, now part of Lockheed Martin), who designed the texture-mapping technology incorporated by the Model 2. The Model 2's development was led by famed game designer Yu Suzuki. The Model 2 arcade board debuted along with Daytona USA, a game which was finished, copyrighted and debuted at the JAMMA arcade show in 1993.[1] \n\nThere four versions of the system: the original Model 2 and the Model 2A-CRX, Model 2B-CRX and Model 2C-CRX variants. Model 2 and 2A-CRX used a custom DSP with internal code for the geometrizer while 2B-CRX and 2C-CRX used well documented DSPs and uploaded the geometrizer code at startup to the DSP.",
        "category": "Arcade",
        "usemamefiles": "true",
        "alternate": [
            "Model 2"
        ]
    },
    "Namco System 22": {
        "id": 84,
        "name": "Namco System 22",
        "emulated": "true",
        "releasedate": "1993-01-01T00:00:00-08:00",
        "developer": "Evans & Sutherland",
        "manufacturer": "Namco",
        "cpu": "Motorola 68020 32-bit @ 24.576 MHz",
        "graphics": "2x Texas Instruments TMS32025 @ 49.152 MHz",
        "sound": "Sound CPU: Mitsubishi M37702 (System 22 Games) or M37710 (Super System 22 Games) @ 16.384 MHz",
        "display": "Texture Mapping, Real-Time, Real-Visual, Rendering System",
        "media": "Arcade",
        "maxcontrollers": "2",
        "notes": "History\n\nThe Namco System 22 is the successor to the Namco System 21 arcade system board co-designed with the assistance of graphics & simulation experts Evans & Sutherland. It was first released in 1993 with the game Ridge Racer. It was essentially a continuation of the System 21 hardware design, where the main CPU provides a scene description to a bank of DSP chips which perform all necessary 3D calculations. Additional graphical improvements included texture mapping, Gouraud shading, transparency effects, and depth cueing thanks to the Evans & Sutherland 'TR3' chip\/chipset, which stands for: Texture Mapping, Real-Time, Real-Visual, Rendering System.\n\nA variant of the system, called the Super System 22, was released in 1995. The hardware was largely similar to the System 22, but with a slightly higher polygon rate and more special effects possible.\n\nBoth Super System 22 and System 22 can render significantly better graphics, more polygons with sharper texture-mapping, running in higher resolution and at a higher framerate compared to the graphics capabilities of the original Sony PlayStation, the Sega Saturn and the Nintendo 64 video game systems, but much less than what the Sega Dreamcast can produce.[citation needed]\n\nAccording to Namco America the twin seat Ridge Racer arcade unit sold to distribution for $11,995.00 in 1993.",
        "category": "Arcade",
        "usemamefiles": "true",
        "alternate": [
            "System 22"
        ]
    },
    "Sega Model 3": {
        "id": 85,
        "name": "Sega Model 3",
        "emulated": "true",
        "releasedate": "1996-01-01T00:00:00-08:00",
        "developer": "Sega and Lockheed Martin",
        "manufacturer": "Sega and Lockheed Martin",
        "cpu": "IBM-Motorola PowerPC 603e (32-bit & 64-bit instructions)",
        "memory": "8192 KB, (8 MB) 66 MHz",
        "graphics": "2Ã\u0097 Lockheed Martin Real3D\/Pro-1000",
        "sound": "Yamaha SCSP\/YMF292-F",
        "display": "496Ã\u0097384 to 640x480, progressive scan (non-interlaced), 24 kHz horizontal sync, one or two planes",
        "media": "Arcade system Board",
        "maxcontrollers": "2",
        "notes": "The Sega Model 3 is an arcade platform produced by Sega in partnership with Lockheed Martin. It is a successor to the Sega Model 2 platform, and was released in 1996. \n\nThe Model 3 hardware is very different to the Model 1 and Model 2 boards which preceded it. It was desinged with one purpose in mind - to push as many textured polygons as possible for as least money as possible. Upon release, the Model 3 board was more powerful than any other arcade platform on the market, as well as any home console or computer.",
        "category": "Arcade",
        "usemamefiles": "true",
        "alternate": [
            "Model 3"
        ]
    },
    "Sega System 32": {
        "id": 86,
        "name": "Sega System 32",
        "emulated": "true",
        "releasedate": "1990-01-01T00:00:00-08:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "NEC V60 @ 16.10795 MHz",
        "memory": "1844.125 KB",
        "graphics": "Sega Super Scaler 317-5964 chipset (315-5242 video DAC\/color encoder, 315-5385 system controller\/timer, 315-5386\/315-5386A tilemap generator, 315-5387 sprite generator, 315-5388 video mixer\/color blender).",
        "sound": "Zilog Z80 @ 8.053975 MHz (8-bit & 16-bit instructions @ 1.168 MIPS)",
        "display": "320Ã\u0097224 (display), 416Ã\u0097262[22] (overscan), progressive scan",
        "media": "Arcade System Board",
        "maxcontrollers": "2",
        "notes": "Sega System 32 is the name of an arcade platform released by Sega that debuted in 1990. It was a successor to the Sega System 16 and Sega System 24 boards, and contains a 32-bit RISC processor at 16 MHz, hence its name. \n\nIt was the last board to be released under the \"Sega System\" naming scheme - the \"Sega Model\" series would begin in 1992 with the Sega Model 1. Whereas Model 1 hardware was designed specifically with 3D games in mind, System 32 primarily catered for 2D games. Like the Sega X Board and Sega Y Board it is capable of scaling many sprites in real-time, resulting in several \"pseudo-3D\" games. \n\nA variant of this hardware, System Multi 32 was created for use with twin cabinets, specifically for games that where more than one player could play on separate screens. \n\nUnlike other Sega arcade hardware from this period, few System 32 games have ever been ported to home consoles. A re-imagining of Air Rescue hit European Sega Master Systems in 1992 (which although shares the same name, is almost completely different in design to the arcade version), OutRunners saw a vastly reduced port to the Sega Mega Drive by Data East and Rad Mobile was heavily tweaked and turned into Gale Racer for the Sega Saturn. Everything else seems to have been deemed \"too good\" for the Mega Drive and \"not good enough\" for the Saturn.",
        "category": "Arcade",
        "usemamefiles": "true",
        "alternate": [
            "System 32"
        ]
    },
    "Sega System 16": {
        "id": 87,
        "name": "Sega System 16",
        "emulated": "true",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "MC68000 @ 10 MHz",
        "memory": "32 MB",
        "graphics": "Zilog Z80 @ 4 MHz (5 MHz in System 16B)",
        "sound": "YM2151 @ 4 MHz & Nec uPD7759 @ 640 kHz",
        "display": "320 x 224 (vertical)",
        "media": "Arcade System board",
        "maxcontrollers": "2",
        "notes": "The Sega System 16 is an arcade board released by Sega in 1985 as a 16-bit successor to the Sega System 1. Throughout its lifespan, there would be around forty games released on this hardware, making it one of Sega's most successful hardware designs. It was produced in three variants, the Pre-System 16, System 16A and System 16B, though the only differences between the three are clock speeds. \n\nThe System 16 is the home to many of Sega's most successful franchises, including Shinobi, Fantasy Zone, Altered Beast and Golden Axe. It popularised the use of the Motorola 68000 CPI and Zilog Z80 combo, something which was copied for Capcom's successful CPS-1 and CPS-2 boards (among other arcade systems of the day), as well as most notably, the Sega Mega Drive. \n\nIn order to prevent piracy, as well as illegal bootleg games, many System 16 boards used an encryption system. A Hitachi FD1094 chip, containing the main CPU as well as the decryption key, was used in place of a regular CPU. \n\nThough Pre-System 16, System 16A and System 16B are the three most recognised variants of the hardware, there is technically a fourth, dubbed \"System 16C\" which was used by the 2008 release of Fantasy Zone II DX: The Tears of Opa-Opa. Fantasy Zone II DX arrived almost a decade and a half after the System 16 hardware was discontinued, however its real arcade release means that System 16C specifications may belong to the Sega System 16 series. Fantasy Zone II DX needs more RAM than any of the other System 16 boards can offer, but the game adhered to other restrictions of the hardware.",
        "category": "Arcade",
        "usemamefiles": "true",
        "alternate": [
            "System 16"
        ]
    },
    "Sammy Atomiswave": {
        "id": 88,
        "name": "Sammy Atomiswave",
        "emulated": "true",
        "releasedate": "2003-01-01T00:00:00-08:00",
        "developer": "Sammy Corporation",
        "manufacturer": "Sammy Corporation",
        "cpu": "Hitachi SH-4 32-bit RISC CPU 200 MHz Rated performance: 360 MIPS\/1.4 GFLOPS",
        "memory": "16 MB",
        "graphics": "PowerVR 2 100 MHz",
        "sound": "ARM7 Yamaha AICA (with internal 32-bit RISC CPU, 64 channel ADPCM) 45 MHz",
        "display": "3 to 5 million polygons\/sec",
        "media": "ROM board",
        "maxcontrollers": "2",
        "notes": "The Atomiswave is a custom arcade system board and cabinet from Sammy Corporation. It is based on Sega's NAOMI system board (thus it's common to see the \"Sega\" logo on its boot up screen). The Atomiswave uses interchangeable game cartridges and the cabinet's control panel can be easily switched out with different control sets, including dual joysticks, dual lightguns and a steering wheel.\n\nWith the retirement of the aging Neo Geo MVS system, SNK Playmore chose the Atomiswave as its next system to develop games for. In a contract with Sammy, SNK Playmore agreed to develop five games for the Atomiswave system. Metal Slug 6 was SNK Playmore's fifth game for the Atomiswave, after which SNK moved on to a Taito Type X2 arcade board.",
        "category": "Arcade",
        "usemamefiles": "true",
        "alternate": [
            "Atomiswave"
        ]
    },
    "Sega Naomi": {
        "id": 89,
        "name": "Sega Naomi",
        "emulated": "true",
        "releasedate": "1998-01-01T00:00:00-08:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "Hitachi SH-4 @ 200 MHz",
        "memory": "56 MB (64 MB with GD-ROM)",
        "graphics": "NEC-VideoLogic PowerVR 2 (PVR2DC\/CLX2) @ 100 MHz4",
        "sound": "Yamaha AICA Super Intelligent Sound Processor @ 67 MHz",
        "display": "VGA, 320Ã\u0097240 to 800Ã\u0097608 pixels, progressive scan",
        "media": "Rom Cartridges",
        "maxcontrollers": "2",
        "notes": "The Sega NAOMI (New Arcade Operation Machine Idea) is an arcade system board released in 1998 as a successor to Sega Model 3 hardware. It uses the same architecture as the Sega Dreamcast, and stands as one of Sega's most successful arcade systems of all time, along with the Sega Model 2. \n\nThe NAOMI debuted at a time when traditional arcades were on a decline, and so was engineered to be a mass-produced, cost-effective machine reliant on large game ROM \"cartridges\" which could be interchanged by the arcade operator. This is contrary to systems such as the Model 3, in which each board, despite sharing largely the same specifications, would be bespoke, with the built-in ROMs being flashed with games during the manufacturing process. This is not the first time such an idea was utilised by Sega, but never before had technology been used for a cutting-edge Sega arcade specification. \n\nUnlike most hardware platforms in the arcade industry, NAOMI was widely licensed for use by other manufacturers, many of which were former rivals to Sega such as Taito, Capcom and Namco. It is also one of the longest-serving arcade boards, being supported from 1998 to 2009. It is a platform where many top-rated Sega franchises were born, including Virtua Tennis, Samba de Amigo, Crazy Taxi and Monkey Ball. \n\nThe NAOMI was succeeded by the Sega Hikaru and Sega NAOMI 2 boards, though having out-lasted the NAOMI 2, Hikaru and Sega Aurora. The Sega Chihiro, or possibly even the Sega Lindbergh, could also be seen as successors.",
        "category": "Arcade",
        "usemamefiles": "true",
        "alternate": [
            "Naomi"
        ]
    },
    "Sega Naomi 2": {
        "id": 90,
        "name": "Sega Naomi 2",
        "emulated": "true",
        "releasedate": "2000-01-01T00:00:00-08:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "2Ã\u0097 Hitachi SH-4 @ 400 MHz",
        "memory": "168 MB",
        "graphics": "Main T&L geometry GPU coprocessor: VideoLogic Elan @ 100 MHz",
        "sound": "Yamaha AICA Super Intelligent Sound Processor @ 67 MHz",
        "display": "Single monitor: 496Ã\u0097384 to 800Ã\u0097608 pixels, Dual monitor: 992Ã\u0097768 to 1600Ã\u0097608 pixels",
        "media": "GD-ROM and Satellite Terminal variants.",
        "maxcontrollers": "2 to 4 players",
        "notes": "The Sega NAOMI 2 is an arcade board developed by Sega and is a successor to Sega NAOMI hardware. It was originally released in 2000, and stands as a beefed up version of the NAOMI specification. It is also fully backwards compatible with its predecessor. \n\nThe NAOMI 2 is by and large a more powerful successor of the NAOMI, adding a secondary CPU and GPU at higher clock rates, adding a new T&L GPU, and increasing the main graphics memory. This leads to games with much more polygons than a NAOMI game, rendered at much faster speeds, while the new T&L GPU adds advanced lighting and particle effects. It was more affordable than the Sega Hikaru arcade system that preceded it. \n\nAs with the NAOMI, the NAOMI 2 was also available in GD-ROM and Satellite Terminal variants.",
        "category": "Arcade",
        "usemamefiles": "true",
        "alternate": [
            "Naomi 2"
        ]
    },
    "Atari 800": {
        "id": 91,
        "name": "Atari 800",
        "emulated": "true",
        "releasedate": "1979-11-01T00:00:00-08:00",
        "developer": "Atari",
        "manufacturer": "Atari",
        "cpu": "MOS 6502, 1.8MHz ",
        "memory": "8K base, 48K max",
        "graphics": "384 pixels per TV line, 256 colors, 8x sprites, raster interrupts. RGB video output. TV video output.",
        "sound": "4x oscillators with noise mixing, or 2x AM digital",
        "display": "24 x 40 text. 320 x 192 monochrome. 160 x 96 with 128 colors.",
        "media": "Cartridge",
        "maxcontrollers": "4",
        "notes": "The Atari 800 was announced in December 1978, though it didn't actually start shipping until late in 1979.\n\nDesigned to look like a friendly typewriter, the Atari 800 is an expandable system with two easily accessable cartridge ports under a front cover, and a removable top with four expansion slots inside.  The cartridges are very handy, just plug 'em in and go! Technologically, there's not much to them, just some ROM chips with the program already burned into them.  The Atari 800 has multiple special purpose co-processors for sound and graphics to take the load off of the 6502 CPU, and it has sprites and collision-detection built into its hardware, so it is an excellent game machine.  Up to four Atari 810 floppy drives ($599.95 each) can be hooked-up, allowing fast and reliable data storage.  The floppy drive uses single-sided 5 1\/4-inch floppy disks, holding 90K of data on a disk. The data is transfered in serial format at 19200 baud.  The Atari 820 impact dot-matrix printer ($449.95) prints 40 columns of 5x7 characters, at approximately 40 characters per second.  The 810 and 820 are considered \"intelligent\" peripherals - they have built-in processor chips which lighten the load on the computer's main processor. They can each be plugged directly into the Atari 400 or 800, with no other inteface required. \n\nUnfortunately, the Atari 800 doesn't have any standard peripheral ports for non-Atari printers, modems, etc. So in 1980, Atari released the Atari 850 Interface Module, which provides 4 separate RS-232-C serials ports and a single Centronics compatible printer port. It plugs into one of the controller jacks on the computer, which are actually both input\/output, analog and digital ports.  There are two versions of the 850. The black metal version is the original unit and is very uncommon. The newer version was plastic.  The first Atari modem, the Atari 830 Acoustic Couple Modem. It has two cups on top to cradle the telephone handset, and it requires both the Atari 850 Interface Module and the TeleLink I ROM cartridge to operate.  The second modem released was the Atari 835 Direct Connect Modem, a stand-alone unit which hooks directly to the telephone line and does not use the 850 Interface Module. It does, however, require the Atari Telelink II ROM cartridge.  The 835 modem\/cartridge pair features 300 baud upload\/download speed, autodial, and they even remember the last two numbers dialed.\n\nAdditional accessories include the external keypad ($124.95) for fast data entry.  Although an external floppy drive was available, beginners often used the cheaper but less reliable cassette tape drive.  Numerous games were released on cassette tape, and Atari produced introductory and programming tapes.  Like the Atari 400, the 800 was designed by a team which included Jay Miner, who later went on to help design the Amiga 1000.  In 1983, Atari released the 800XL computer. It has the same CPU as the Atari 800, and runs at the same speed. Basically a cheaper version of the 800, it is supposed to be compatible with all Atari 800 software and peripherals, but it isn't. Improvements include: 64K base RAM vs. 8K, parallel I\/O port (PBI), and general purpose I\/O port.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Atari 8-bit"
        ]
    },
    "Sega Model 1": {
        "id": 92,
        "name": "Sega Model 1",
        "emulated": "true",
        "releasedate": "1992-01-01T00:00:00-08:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "32-bit RISC NEC V60 uPD-70616 @ 16 MHz (2.5 MIPS)",
        "memory": "1936 KB (1880 KB SRAM)",
        "graphics": "Fujitsu TGP MB86233 FPU 32bits 16M flops",
        "sound": "2 x Sega MultiPCM Custom 28 channel PCM chips @ 8 MHz",
        "display": "496x384 in 65536 colors",
        "maxcontrollers": "2",
        "notes": "Sega went to General Electric Aerospace (who made the first 3D simulators for NASA in the 1960s) in 1991-92 for assistance to develop a CG platform architecture for their new experimental 3D system, which later became known as Model 1. Virtua Racer was the game being written to find out how viable hardware 3D games were; it was never designed to be released, but it was such a success internally they decided to actually release it. \n\nUnfortunately, seeing as it was so expensive to manufacture it was never a stunning financial success for Sega, but it did cement their place in the history books as the world leader in 3D arcade technology, a title which they still hold to this day, and it led to possibly the most popular platform ever, Model 2.",
        "category": "Arcade",
        "usemamefiles": "true"
    },
    "Sega Pico": {
        "id": 93,
        "name": "Sega Pico",
        "emulated": "true",
        "releasedate": "1993-06-01T00:00:00-07:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "Motorola 68000 @ 7.6 MHz, Zilog Z80 @ 3.58 MHz",
        "memory": "72kB of RAM, as well as 64 kB of video RAM",
        "graphics": "Video Display Processor (VDP)",
        "sound": "Zilog Z80 sub-processor",
        "display": "Touchscreen",
        "media": "\"Storyware\" (Cartridge)",
        "notes": "The Sega Pico, also known as Kids Computer Pico, is an educational video game console by Sega. Marketed as \"edutainment\", the main focus of the Pico was educational video games for children between 3 and 7 years old. The Pico was released in 1993 in Japan and 1994 in North America and Europe, and later reached China. It was later succeeded by the Advanced Pico Beena, which was released in Japan in 2005. Though the Pico was sold continuously in Japan through the release of the Beena, in North America and Europe the Pico was less successful and was discontinued in early 1998, later being re-released by Majesco. Releases for the Pico were focused on education for children and included titles supported by licensed franchised animated characters, including Disney and Sega's own Sonic the Hedgehog series. Overall, Sega claims sales of 3.4 million Pico consoles and 11.2 million game cartridges, and over 350,000 Beena consoles and 800,000 cartridges.",
        "category": "Consoles",
        "usemamefiles": "false"
    },
    "Acorn Atom": {
        "id": 94,
        "name": "Acorn Atom",
        "emulated": "true",
        "releasedate": "1980-01-01T00:00:00-08:00",
        "developer": "Acorn Computers",
        "manufacturer": "Acorn Computers",
        "cpu": "MOS Technology 6502, 1MHz",
        "memory": "2 kb RAM (Expandable to 12), 8 kb ROM (Expandable to 12)",
        "graphics": "",
        "sound": "1 Channel, Integral Loudspeaker",
        "display": "64x64 (4 colors), 64x96 (4 colors), 128x96 (monochrome), 64x192 (4 colors), 128x192 (2 colors), 256x192 (monochrome)",
        "media": "100kb 5 1\/4 inch Floppy Disk, Cassette Tapes",
        "maxcontrollers": "",
        "notes": "The Acorn Atom is a home computer designed by Acorn Computers Ltd. The computer was released in 1980 in Europe at a retail price ranging from Â£120 to Â£200, depending on the package bought. The computer was not released outside of Europe. The Atom was Acorn's first computer to be aimed squarely at the home market. The computer was manufactured until an unspecified time in 1983.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Atom"
        ]
    },
    "Amstrad GX4000": {
        "id": 95,
        "name": "Amstrad GX4000",
        "emulated": "true",
        "releasedate": "1990-09-01T00:00:00-07:00",
        "developer": "Amstrad",
        "manufacturer": "Amstrad",
        "cpu": "8\/16-bit Zilog Z80A @ 4MHz",
        "memory": "64 kb RAM, 16 kb VRAM, 32 kb ROM",
        "graphics": "Custom on-board chip-set",
        "sound": "AY-3-8912 chip, 3 channel stereo",
        "display": "160x200 pixels with 16 colors, 320x200 pixels with 4 colors,  or 640x200 pixels with 2 colors",
        "media": "ROM Cartridge",
        "maxcontrollers": "2",
        "notes": "The Amstrad GX4000, commonly known as the GX4000, is a third generation (1983-2003) video game console developed and distributed by Amstrad. It was released in September of 1990 in Europe at a retail price of Â£99.99. The console was not released outside Europe. The GX4000 was Amstrad's short-lived attempt to enter the games console market, being primarily a home computer manufacturer. The console was discontinued in late 1991.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "GX4000"
        ]
    },
    "Apple II": {
        "id": 96,
        "name": "Apple II",
        "emulated": "true",
        "releasedate": "1977-06-01T00:00:00-07:00",
        "developer": "Steve Wozniak\/Steve Jobs, Apple Computer, Inc.",
        "manufacturer": "Apple Computer, Inc.",
        "cpu": "MOS Technology 6502",
        "memory": "4 KB up to 64 KB",
        "graphics": "NTSC Video Out",
        "sound": "1-bit speaker",
        "display": "Lo-res (40x48), Hi-res (280 x 192)",
        "media": "Audio Cassette, 5.25\" Floppy",
        "maxcontrollers": "1",
        "notes": "In 1976, computer pioneers Steve Wozniak and Steve Jobs began selling their Apple I computer in kit form to computer stores. A month later, Wozniak was working on a design for an improved version, the Apple II. They demonstrated a prototype in December, and then introduced it to the public in April 1977. The Apple II started the boom in personal computer sales in the late 1970s, and pushed Apple into the lead among personal computer makers.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Apple IIGS": {
        "id": 97,
        "name": "Apple IIGS",
        "emulated": "true",
        "releasedate": "1986-09-15T00:00:00-07:00",
        "developer": "Apple Computer, Inc.",
        "manufacturer": "Apple Computer, Inc.",
        "cpu": "WDC 65C816, 2.8 MHz",
        "memory": "1.125 MB Ram Built in, Expandable to 8 MB",
        "graphics": "VGC 12-bpp palette",
        "sound": "Ensoniq 5503 Digital Oscillator Chip, 8-bit audio",
        "display": "320 x 200, 640 x 200",
        "media": "5.25\" and 3.5\" Floppy Disks",
        "maxcontrollers": "1 Game I\/O Socket",
        "notes": "The Apple IIGS is a personal computer released by Apple Computer on September 15, 1986 that's compatible with the Apple II series, but otherwise has capabilities comparable to the Atari ST, Commodore Amiga, and Macintosh. The \"GS\" in the name stands for \"Graphics\" and \"Sound,\" referring to its enhanced multimedia hardware, especially its state of the art sound and music synthesis.\n\nThe machine is a radical departure from any previous Apple II, with its 16-bit processor, direct access to megabytes of RAM, and mouse. It's the first computer produced by Apple to use a color graphical user interface (color was introduced on the Macintosh II six months later) and Apple Desktop Bus interface for keyboards, mice, and other input devices. It is the first personal computer to come with a built-in wavetable synthesis chip, utilizing technology from Ensoniq.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Apple II GS"
        ]
    },
    "Casio Loopy": {
        "id": 98,
        "name": "Casio Loopy",
        "emulated": "true",
        "releasedate": "1995-10-19T00:00:00-07:00",
        "developer": "Casio",
        "manufacturer": "Casio",
        "cpu": "32-bit RISC SH-1 (SH7021)",
        "memory": "",
        "graphics": "32-Bit",
        "sound": "",
        "display": "",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The Casio Loopy, subtitled My Seal Computer SV-100, is a fifth generation (1993â\u0080\u00932005) video game console developed and distributed by Casio. It was released on October 19, 1995 in Japan at a retail price believed to be 25,000Â¥. The console was not released outside Japan. The Loopy was marketed to females and included a built-in thermal color printer that could be used to create stickers from game screenshots. The console was discontinued in October 1996.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Loopy"
        ]
    },
    "Casio PV-1000": {
        "id": 99,
        "name": "Casio PV-1000",
        "emulated": "true",
        "releasedate": "1983-10-01T00:00:00-07:00",
        "developer": "Casio",
        "manufacturer": "Casio",
        "cpu": "Z80A, 3.579 MHz",
        "memory": "2KB RAM",
        "graphics": "8 Colors",
        "sound": "D65010G031, 3 Channel",
        "display": "256 x 192",
        "media": "ROM Cartridge",
        "maxcontrollers": "2",
        "notes": "The Casio PV-1000, is a third generation (1983-2003) video game console developed and distributed by Casio. It was released in October 1983 in Japan at a retail price of 14,800Â¥. The console was not released outside Japan. The PV-1000 failed to achieve a significant market share, and thus only had 13 games released during it's life. The console was discontinued by early 1984.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "PV-1000"
        ]
    },
    "Coleco ADAM": {
        "id": 100,
        "name": "Coleco ADAM",
        "emulated": "true",
        "releasedate": "1983-10-01T00:00:00-07:00",
        "developer": "Coleco",
        "manufacturer": "Coleco",
        "cpu": "Zilog Z80, 3.58 MHz",
        "memory": "80 KB RAM, 16 KB VRAM, 32 KB ROM",
        "graphics": "Texas Instruments TMS9928A",
        "sound": "Texas Instruments SN76489AN",
        "display": "256 x 192",
        "media": "ROM Cartridge, Floppy",
        "maxcontrollers": "1",
        "notes": "The Coleco ADAM is a home computer, and expansion for the ColecoVision (port 3), released in 1983 by American toy manufacturer Coleco. It was an attempt to follow on the success of the company's ColecoVision video game console. The ADAM was not very successful, partly because of early production problems, and was orphaned in early 1985.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "ADAM"
        ]
    },
    "Commodore 128": {
        "id": 101,
        "name": "Commodore 128",
        "emulated": "true",
        "releasedate": "1985-01-01T00:00:00-08:00",
        "developer": "Commodore Business Machines",
        "manufacturer": "Commodore Business Machines",
        "cpu": "MOS Technology 8502, 2 MHz, Zilog Z80, 4 MHz, and MOS Technology 6502",
        "memory": "128 KB RAM",
        "graphics": "MOS 8564\/8566 VIC-II",
        "sound": "MOS 6581 SID synthesizer chip",
        "display": "160 x 200, 320 x 200",
        "media": "Floppy",
        "maxcontrollers": "2",
        "notes": "The Commodore 128, also known as the C128, C-128, C=128, or occasionally CBM 128, is the last 8-bit home computer that was commercially released by Commodore Business Machines (CBM). Introduced in January 1985 at the CES in Las Vegas, it appeared three years after its predecessor, the bestselling Commodore 64.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "C128",
            "C-128",
            "C=128",
            "C= 128",
            "CBM 128"
        ]
    },
    "Commodore Amiga CD32": {
        "id": 102,
        "name": "Commodore Amiga CD32",
        "emulated": "true",
        "releasedate": "1993-09-17T00:00:00-07:00",
        "developer": "Commodore International",
        "manufacturer": "Commodore International",
        "cpu": "Motorola 68EC020, 14.32 MHz(NTSC), 14.16MHz(PAL)",
        "memory": "2 MB Amiga Chip RAM",
        "graphics": "24-bit colour palette",
        "sound": "4 x 8-bit PCM Channels",
        "display": "320 x 200 (NTSC), 320 x 256 (PAL)",
        "media": "CD-ROM",
        "maxcontrollers": "2",
        "notes": "The Amiga CD32, styled \"CD32\" and code-named \"Spellbound\", is the first 32-bit home video game console released in western Europe, Australia, Canada and Brazil. It was first announced at the Science Museum in London on July 16, 1993, and was released in September of the same year. The CD32 uses CD-ROM media, and was developed by Commodore, creator of the Commodore Amiga computer. It was based on Commodore's Advanced Graphics Architecture chipset, and is of similar specification to the Amiga 1200 computer. Using third party devices, it is possible to upgrade the CD32 with keyboard, floppy drive, hard drive, RAM and mouse, turning it into the equivalent of an Amiga 1200 personal computer. A hardware MPEG decompression module for playing Video CD was also released. In the Christmas period following its launch, the CD32 accounted for 38% of all CD-ROM drive sales in the UK, exceeding sales of the Mega-CD; however, it was soon overshadowed by CD-ROM based games consoles from other companies, and was discontinued as Commodore went into bankruptcy.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Amiga CD32"
        ]
    },
    "Commodore CDTV": {
        "id": 103,
        "name": "Commodore CDTV",
        "emulated": "true",
        "releasedate": "1991-03-01T00:00:00-08:00",
        "developer": "Commodore International",
        "manufacturer": "Commodore International",
        "cpu": "Motorola 68000, 7.16 MHz",
        "memory": "1 MB Amiga Chip RAM",
        "graphics": "12-bit Color Palette",
        "sound": "4 x 8-bit PCM Channels",
        "display": "320 x 200, 320 x 256",
        "media": "CD-ROM, Floppy",
        "maxcontrollers": "1",
        "notes": "The CDTV (an acronym for \"Commodore Dynamic Total Vision\", a backronym of an acronym for \"Compact Disc Television\", giving it a double meaning) is a multimedia platform developed by Commodore International and launched in March 1991. The CDTV was intended as a media appliance rather than a personal computer.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "CDTV"
        ]
    },
    "Commodore Plus 4": {
        "id": 104,
        "name": "Commodore Plus 4",
        "emulated": "true",
        "releasedate": "1984-01-01T00:00:00-08:00",
        "developer": "Commodore Business Machines",
        "manufacturer": "Commodore Business Machines",
        "cpu": "MOS Technology 8501",
        "memory": "64 KB RAM, 64 KB ROM",
        "graphics": "MOS Technology TED",
        "sound": "MOS Technology TED",
        "display": "320 x 200",
        "media": "ROM Cartridge, Cassette Tape",
        "maxcontrollers": "2",
        "notes": "The Commodore Plus\/4 is a home computer released by Commodore International in 1984. The \"Plus\/4\" name refers to the four-application ROM resident office suite (word processor, spreadsheet, database, and graphing); it was billed as \"the productivity computer with software built-in\".  Internally, the Plus\/4 shares the same basic architecture as the lower-end Commodore 16 and 116 models, and is able to use software and peripherals designed for them. However, it is not compatible with the well-established Commodore 64.  While the Plus\/4 had some success in Europe, it was a failure in the United States, where it was derided as the \"Minus\/60\".",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Plus 4"
        ]
    },
    "Commodore VIC-20": {
        "id": 105,
        "name": "Commodore VIC-20",
        "emulated": "true",
        "releasedate": "1980-06-01T00:00:00-07:00",
        "developer": "Commodore Business Machines",
        "manufacturer": "Commodore Business Machines",
        "cpu": "MOS Technology 6502",
        "memory": "5 KB RAM, 20 KB ROM (expandable to 32 KB)",
        "graphics": "MOS Technology VIC",
        "sound": "3 Pulse Wave Sound Generators",
        "display": "176 x 184",
        "media": "ROM Cartridge",
        "maxcontrollers": "1",
        "notes": "The VIC-20 (Germany: VC-20; Japan: VIC-1001) is an 8-bit home computer that was sold by Commodore Business Machines. The VIC-20 was announced in 1980, roughly three years after Commodore's first personal computer, the PET. The VIC-20 was the first computer of any description to sell one million units.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "VIC-20"
        ]
    },
    "Fujitsu FM Towns Marty": {
        "id": 106,
        "name": "Fujitsu FM Towns Marty",
        "emulated": "true",
        "releasedate": "1993-02-20T00:00:00-08:00",
        "developer": "Fujitsu",
        "manufacturer": "Fujitsu",
        "cpu": "AMD 386SX, 16 MHz",
        "memory": "2 MB RAM, 640 KB VRAM",
        "graphics": "Fujitsu Custom Graphics Chip",
        "sound": "Yamaha YM2612, Ricoh RF5c68",
        "display": "256 x 240 - 720 x 480",
        "media": "CD-ROM, 3.5\" Floppy",
        "maxcontrollers": "2",
        "notes": "The FM Towns Marty (Efu Emu Taunzu Mati) is a fifth-generation home video game console released in 1993 by Fujitsu, exclusively for the Japanese market. It was the first 32-bit home video game system, and came complete with a built in CD-ROM drive and disk drive.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Fujitsu FM Towns",
            "FM Towns Marty",
            "FM Towns"
        ]
    },
    "GCE Vectrex": {
        "id": 107,
        "name": "GCE Vectrex",
        "emulated": "true",
        "releasedate": "1982-11-01T00:00:00-08:00",
        "developer": "Western Technologies\/Smith Engineering",
        "manufacturer": "General Consumer Electronics",
        "cpu": "Motorola 68A09 @ 1.5 MHz",
        "memory": "1 KB RAM",
        "graphics": "Vector Display",
        "sound": "General Instrument AY-3-8912",
        "display": "9\" Monitor",
        "media": "ROM Cartridge",
        "maxcontrollers": "2",
        "notes": "The GCE Vectrex, usually just referred to as Vectrex, is a second generation (1976â\u0080\u00931992) home video game console that was developed by Western Technologies\/Smith Engineering, and distributed first by General Consumer Electronics (GCE), and later by Milton Bradley Company after its purchase of GCE. It was released in November 1982 in North America at a retail price of $199. The console was later released in Europe (1983) and Japan (1983). The Vectrex had an integrated vector monitor which displayed vector graphics, which set it apart from other consoles that needed a TV to play on. The console discontinued in early 1984.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Vectrex"
        ]
    },
    "Nuon": {
        "id": 108,
        "name": "Nuon",
        "emulated": "true",
        "releasedate": "2000-11-09T00:00:00-08:00",
        "developer": "VM Labs",
        "manufacturer": "Motorola, Samsung, Toshiba",
        "cpu": "Quad Core VM Labs Nuon MPE (Media Processing Element) 108MHz",
        "memory": "RAM: 32 MB 33MHz, Sound RAM: 512 KB, Video RAM: 8MB 66MHz",
        "graphics": "2x 3d Media GL MPE (Media Processing Element)",
        "sound": "Dolby Digital 5.1 Channel",
        "display": "360 x 240",
        "media": "DVD",
        "maxcontrollers": "2",
        "notes": "The VM Labs Nuon, usually just referred to as Nuon, is a sixth generation (1998-2013) video game console developed by VM Labs and distributed by Motorola, Samsung, and Toshiba. It was released on November 9th, 2000 in North America at a retail price of $250.00 to $350.00, depending on additional features. The console was also released in Europe (2000) and Korea (2000). The Nuon was actualy technology imbedded into a DVD Player that added features for gaming. The technology was discontinued and phased out of DVD players in mid to late 2003.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Genesis Microchip Nuon",
            "VM Labs Nuon"
        ]
    },
    "Mega Duck": {
        "id": 109,
        "name": "Mega Duck",
        "emulated": "true",
        "releasedate": "1993-08-27T00:00:00-07:00",
        "developer": "Welback Holdings",
        "manufacturer": "Welback Holdings",
        "cpu": "Zilog Z80 @ 4.19 MHz",
        "memory": "16 KB RAM",
        "sound": "Built in speaker",
        "display": "160 Ã\u0097 144",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The Welback Holdings Mega Duck, usually just referred to as Mega Duck, is a fourth generation (1987-2004) handheld video game console developed and distributed by Welback Holdings, but marketed under different names like Creatronic, Videojet, Cougar USA, and Hartung. It was released in August 1993 in Netherlands at a retail price of fl 129 as the Creatronic Mega Duck. The console was also released in Germany (1993) distributed by Hartung, France (1993) distributed by Videojet, and Brazil (1993) but as the Cougar USA Cougar Boy. The Mega Duck was an obvious clone of the Game Boy in looks, and it sadly lacked any innovative games to set it apart to become a competitor. The console was discontinued quietly sometime in early 1995.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Creatronic Mega Duck"
        ]
    },
    "Sharp X68000": {
        "id": 110,
        "name": "Sharp X68000",
        "emulated": "true",
        "releasedate": "1987-03-01T00:00:00-08:00",
        "developer": "Sharp Corporation",
        "manufacturer": "Sharp Corporation",
        "cpu": "Motorola 68000 (10MHz) - XVI 16MHz â\u0080\u0093 X68030 25MHz",
        "memory": "1 MB (up to 12 MB)",
        "graphics": "Hardware scrolling, priority control, super-impose",
        "sound": "Yamaha 2151",
        "display": "256 x 240 \/ 256 x 256 \/ 512 x 240 \/ 512 x 256 \/ 512 x 512 \/ 640 x 480 \/ 768 x 512 \/ 1024 x 1024",
        "media": "Floppy disk",
        "notes": "The X68000 is a home computer created by Sharp Corporation, first released in 1987, sold only in Japan.  The first model features a 10 MHz Motorola 68000 CPU (hence the name), 1 MB of RAM, and no hard drive; the last model was released in 1993 with a 25 MHz Motorola 68030 CPU, 4 MB of RAM, and optional 80 MB SCSI hard drive. RAM in these systems is expandable to 12 MB, though most games and applications do not require more than 2 MB.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "X68000"
        ]
    },
    "Tandy TRS-80": {
        "id": 111,
        "name": "Tandy TRS-80",
        "emulated": "true",
        "releasedate": "1977-08-03T00:00:00-07:00",
        "developer": "Tandy Corporation",
        "manufacturer": "Tandy Corporation",
        "cpu": "Zilog Z80",
        "memory": "4KB, 16KB max",
        "media": "Cassette tape, Floppy disk",
        "notes": "The TRS-80 Micro Computer System (TRS-80; later known as the Model I to distinguish it from successors) is a desktop microcomputer launched in 1977 and sold by Tandy Corporation through their Radio Shack stores. The name is an abbreviation of Tandy\/Radio Shack, Z-80 microprocessor. It was one of the earliest mass-produced and mass-marketed retail personal computers.  Notable features of the TRS-80 included its full-stroke QWERTY keyboard, its then-new Zilog Z80 processor (rather than the more common Intel 8080), 4K RAM standard memory (many 8-bit computers then shipped with only 1K RAM), small size and desk footprint, its floating-point BASIC programming language, an included 64 column video monitor, and a starting price of US$600 (equivalent to US$2400 in 2016).  An extensive line of upgrades and hardware peripherals for the TRS-80 was developed and marketed by Tandy\/Radio Shack. The basic system could be expanded with up to 48K of RAM (in 16K increments), and up to four floppy disk drives and\/or hard disk drives. Tandy\/Radio Shack provided full service after-sales support including upgrade, repair, and training services in their thousands of stores worldwide.  By 1979, the TRS-80 had the largest selection of software in the microcomputer market. Until 1982, the TRS-80 was the best-selling PC line, outselling the Apple II series by a factor of 5 according to one analysis.  In mid-1980, the broadly compatible TRS-80 Model III was released. The Model I was discontinued shortly after, primarily due to stricter FCC regulations on the radio-frequency interference it caused in surrounding electronics. In April 1983 the Model III was in turn succeeded by the compatible Model 4.  As well as the original Model I and its compatible descendants, the TRS-80 name was later used as a generic brand on other technically unrelated computer lines sold by Tandy, such as the TRS-80 Model II, TRS-80 Model 2000, TRS-80 Model 100, TRS-80 Color Computer and TRS-80 Pocket Computer.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Tandy TRS-80 Color Computer",
            "Tandy TRS-80 Color",
            "TRS-80",
            "Tandy"
        ]
    },
    "Elektronika BK": {
        "id": 112,
        "name": "Elektronika BK",
        "emulated": "true",
        "releasedate": "1984-01-01T00:00:00-08:00",
        "developer": "NPO Scientific Center",
        "manufacturer": "NPO Scientific Center",
        "cpu": "K1801VM1, 3MHz - 4.6MHz (Depending on the Model)",
        "memory": "32KB",
        "graphics": "K1801VP1-037 VDC",
        "sound": "General Instrument AY-3-8910",
        "display": "512 x 256",
        "media": "Cassette Tape, Floppy",
        "maxcontrollers": "1",
        "notes": "The Electronika BK was a series of 16-bit PDP-11-compatible Soviet home computers developed by NPO Scientific Center, the leading Soviet microcomputer design team at the time. It was also responsible for the more powerful UKNC and DVK micros. First released in 1984 (developed in 1983), they were based on the ?1801??1 (Soviet LSI-11-compatible CPU) and were the only \"official\" Soviet home computer design in mass production.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "BK 0011",
            "Elektronika BK 0011"
        ]
    },
    "Epoch Game Pocket Computer": {
        "id": 113,
        "name": "Epoch Game Pocket Computer",
        "emulated": "true",
        "releasedate": "1984-11-30T00:00:00-08:00",
        "developer": "Epoch Co.",
        "manufacturer": "Epoch Co.",
        "cpu": "NEC ÂµPD78c06 @ 6 MHz",
        "memory": "2 KB",
        "graphics": "1-Plane Bitmap Format",
        "sound": "1 Piezoelectric Channel",
        "display": "75 x 64",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The Epoch Game Pocket Computer, usually just referred to as Game Pocket Computer, and also known as the Pokekon is a second generation (1976â\u0080\u00931992) handheld video game console developed and distributed by Epoch Co. It was released on November 1984 in Japan at a retail price of Â¥12,000. The console was not released outside of Japan. The Game Pocket Computer was the first handheld with interchangeable cartridges. The console was discontinued sometime 1985.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Epoch Game Pocket"
        ]
    },
    "Funtech Super Acan": {
        "id": 114,
        "name": "Funtech Super Acan",
        "emulated": "true",
        "releasedate": "1995-10-25T00:00:00-07:00",
        "developer": "Funtech",
        "manufacturer": "Funtech",
        "cpu": "Motorola 68000, 10.6 MHz",
        "memory": "64KB",
        "graphics": "GPU 128 KB VRAM, 32,768 Colors",
        "sound": "16 Audio Channels, PCM Stereo",
        "display": "320 x 240",
        "media": "ROM Cartridge",
        "maxcontrollers": "2",
        "notes": "The Super Acan is a home video game console that was released exclusively in Taiwan in 1995 by Funtech. Inside is a Motorola 68000, also used in the Sega Genesis and Neo Geo. Twelve games have been confirmed to exist for the system.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Super Acan"
        ]
    },
    "GamePark GP32": {
        "id": 115,
        "name": "GamePark GP32",
        "emulated": "true",
        "releasedate": "2001-11-23T00:00:00-08:00",
        "developer": "Game Park",
        "manufacturer": "Game Park",
        "cpu": "Samsung S3C2400X01",
        "memory": "8MB",
        "graphics": "16-Bit Color",
        "sound": "44.1 kHz 16-bit Stereo Sound",
        "display": "320 x 240",
        "media": "SmartMedia",
        "maxcontrollers": "Handheld",
        "notes": "The GP32 (GamePark 32) is a handheld game console developed by the Korean company Game Park. It was released on November 23, 2001, in South Korea only.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "GP32",
            "GamePark 32"
        ]
    },
    "Hartung Game Master": {
        "id": 116,
        "name": "Hartung Game Master",
        "emulated": "true",
        "releasedate": "1990-01-01T00:00:00-08:00",
        "developer": "Hartung",
        "manufacturer": "Hartung",
        "cpu": "NEC upd7810",
        "memory": "",
        "graphics": "Monochrome",
        "sound": "Built-In Speaker",
        "display": "64 x 64",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The Game Master is a handheld game console manufactured by Hartung, and designed to compete with the Nintendo Game Boy. In Germany it was marketed by Hartung itself, while in the UK it was released as the Systema 2000 by already well established maker of cheap LCD games Systema. It was also sold under alternate names in other countries, including Super Game and Game Tronic. The Game Master has a 64 x 64 monochrome LCD screen capable of displaying graphics on par with the Atari 2600.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Hartung"
        ]
    },
    "Interton VC 4000": {
        "id": 117,
        "name": "Interton VC 4000",
        "emulated": "true",
        "releasedate": "1978-01-01T00:00:00-08:00",
        "developer": "Interton",
        "manufacturer": "Interton",
        "cpu": "Signetics 2650A, 4.43 MHz",
        "memory": "32 KB RAM",
        "graphics": "Signetics 2635 Video Controller",
        "sound": "1 Channel",
        "display": "208 x 108",
        "media": "ROM Cartridge",
        "maxcontrollers": "2",
        "notes": "The VC 4000 (short for Video Computer 4000) is an early second generation 8-bit cartridge-based home video game console released in Germany in 1978 by Interton. The console is quite obscure outside Germany, but many software-compatible systems can be found in many European countries.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "VC 4000"
        ]
    },
    "MUGEN": {
        "id": 118,
        "name": "MUGEN",
        "emulated": "true",
        "releasedate": "1999-07-17T00:00:00-07:00",
        "developer": "Elecbyte",
        "maxcontrollers": "2",
        "notes": "M.U.G.E.N (also written as Mugen, MUGEN and M.U.G.E.N.) is a freeware 2D fighting game engine designed by Elecbyte. Content is created by the community, and thousands of fighters, both original and from popular fiction, have been created. It is written in C and originally used the Allegro library. The latest versions of the engine now use the SDL library.",
        "category": "Arcade",
        "usemamefiles": "false"
    },
    "OpenBOR": {
        "id": 119,
        "name": "OpenBOR",
        "emulated": "true",
        "releasedate": "2004-03-28T00:00:00-08:00",
        "developer": "Senile Team",
        "maxcontrollers": "4",
        "notes": "OpenBOR is an open source 2D customisable video game engine designed by Senile Team. It is a continuation of the Beats Of Rage 2D game engine. In 2004 Senile Team released Beats of Rage (BOR), a free beat-'em-up for DOS inspired by SEGA's classic \"Streets of Rage\" series of beat'em ups and using sprites from SNK Playmore's \"King of Fighters\" series. The game amassed popularity very quickly. Senile Team soon released an edit pack allowing anyone interested to create a module for the BOR engine. Later, in 2005, Senile Team opened the source code to BOR, and OpenBOR was born. Development on the engine was continued by the community, and still is to this day.",
        "category": "Arcade",
        "usemamefiles": "false"
    },
    "Philips VG 5000": {
        "id": 120,
        "name": "Philips VG 5000",
        "emulated": "true",
        "releasedate": "1984-10-01T00:00:00-07:00",
        "developer": "Philips",
        "manufacturer": "Radiotechnique",
        "cpu": "Zilog Z80",
        "memory": "24KB RAM",
        "graphics": "SGS Thomson EF9345",
        "display": "320 x 250",
        "media": "Cassette tape",
        "notes": "The VG 5000 is a computer created by Philips in 1984 . It was manufactured in Le Mans by Radiotechnique and marketed under the Philips, Radiola and Schneider brands. It was the first home computer released by Philips. It was not MSX compliant and or compatible with the other Philips VG computers. The basic was written by Microsoft.  It was designed to be a cheap computer for beginners and school purpose. Philips planned to develop a lot of peripherals for this computer : synthetiser, memory card, floppy disk unit, videodisc interface, etc... but none of them was realised. Finally, it had a limited success.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "VG 5000"
        ]
    },
    "Philips Videopac+": {
        "id": 121,
        "name": "Philips Videopac+",
        "emulated": "true",
        "releasedate": "1983-08-01T00:00:00-07:00",
        "developer": "Philips",
        "manufacturer": "Philips",
        "cpu": "8-bit Intel microcontroller 8048",
        "memory": "64 KB",
        "graphics": "Intel 8244 (NTSC), Intel 8245 (PAL)",
        "sound": "Intel 8244\/8245",
        "display": "160 Ã\u0097 200",
        "media": "ROM cartridge",
        "maxcontrollers": "2",
        "notes": "The Videopac is a game console marketed by Philips in 1978. It was the European version of the Magnavox OdysseyÂ² console produced by the American Magnavox and, like this, had to counteract the newly released Fairchild Channel F and Atari 2600 cartridge consoles. Europe was also marketed as Radiola JET 25, Schneider G7000, Siera G7000 (all Philips companies) and Philips C52 (a version for the French market only). In Brazil it was sold as Philips Odissey.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Videopac+"
        ]
    },
    "RCA Studio II": {
        "id": 122,
        "name": "RCA Studio II",
        "emulated": "true",
        "releasedate": "1977-01-31T00:00:00-08:00",
        "developer": "RCA",
        "manufacturer": "RCA",
        "cpu": "RCA COSMAC 1802 @1.78 MHz",
        "memory": "512 bytes",
        "graphics": "RCA CDP1861 \"Pixie\" video chip",
        "sound": "Single Channel Buzzer",
        "display": "64 x 32",
        "media": "Cartridge",
        "maxcontrollers": "2",
        "notes": "The RCA Studio II, usually just referred to as the Studio II, is a second generation (1976â\u0080\u00931992) home video game console developed and distributed by RCA. It was released in January 1977 at a retail price of $149. The Studio II was released with five built-in games, and was capable of making beep sounds with variations in tone and length. The console was discontinued in February 1984.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Studio II"
        ]
    },
    "ScummVM": {
        "id": 123,
        "name": "ScummVM",
        "emulated": "true",
        "releasedate": "2001-10-05T00:00:00-07:00",
        "developer": "ScummVM Team",
        "notes": "Script Creation Utility for Maniac Mansion Virtual Machine (ScummVM) is a set of game engine recreations. Originally designed to play LucasArts adventure games that use the SCUMM system, it also supports a variety of non-SCUMM games by companies like Revolution Software and Adventure Soft. It was originally written by Ludvig Strigeus. Released under the terms of the GNU General Public License, ScummVM is free software.  ScummVM is a reimplementation of the part of the software used to interpret the scripting languages such games used to describe the game world rather than emulating the hardware the games ran on; as such, ScummVM allows the games it supports to be played on platforms other than those for which they were originally released.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Sega Dreamcast VMU": {
        "id": 124,
        "name": "Sega Dreamcast VMU",
        "emulated": "true",
        "releasedate": "1998-07-30T00:00:00-07:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "Sanyo LC8670 @ 32.768 KHz",
        "memory": "128 KB flash memory",
        "sound": "1-channel PWM",
        "display": "48Ã\u009732",
        "media": "Dreamcast GD-ROM",
        "maxcontrollers": "1",
        "notes": "The Visual Memory Unit (VMU), also referred to as the Visual Memory (VM) in Japan and Europe, is the primary memory card produced by Sega for the Dreamcast home video game console. The device features a monochrome liquid crystal display (LCD), multi-player gaming capability (via connectors at the top), second screen functionality, a real-time clock, file manager, built-in flash memory, and sound capability. Prior to the launch of the Dreamcast, a special Godzilla edition VMU, preloaded with a virtual pet game, was released on July 30, 1998 in Japan.  While its most basic function is as a removable storage device, the VMU may also serve as an auxiliary display during normal gameplay and, through the use of additional software (distributed as extras on Dreamcast GD-ROMs), acts as a handheld game console. Console-like features of the VMU include a screen, speaker, proper directional pad, four action buttons, the ability to connect and interact with other VMUs, and the ability to download additional games. While the standard VMU is white, colors were expanded to include many variations. Japan even saw the release of branded VMUs, such as those by Sonic Team, Capcom and Hello Kitty.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Dreamcast VMU"
        ]
    },
    "Sega SC-3000": {
        "id": 125,
        "name": "Sega SC-3000",
        "emulated": "true",
        "releasedate": "1983-07-15T00:00:00-07:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "NEC 780C",
        "memory": "18 KB",
        "graphics": "Texas Instruments TMS9928A VDC",
        "sound": "Texas Instruments SN76489, 4 channel mono",
        "display": "256x192",
        "media": "ROM cartridge",
        "maxcontrollers": "2",
        "notes": "The SC-3000 (Sega Computer 3000) is the first and only computer to be designed and manufactured by Sega. It was first released in July of 1983 in Japan, and serves as the home computer equivalent of the SG-1000 cartridge-based video game console. The SC-3000, often known simply as the \"Sega Computer\" or even just the \"Sega\", is an 8-bit home computer almost identical in nature to the SG-1000, but with a built-in keyboard and support for more hardware expansions.  Unlike later Sega systems, the SC-3000 did not receive a worldwide release, but in markets where it did compete, including Japan, Australia, New Zealand, France, Italy and Finland, the computer fared well as a low price, entry-level machine for the home. By 1985, the SC-3000 had been displaced by more popular computer standards, but is nevertheless said to have fared better than the SG-1000 console on the global stage, and has a strong group of followers to this day.  The SC-3000 was also Sega's last home computer to be released to the general public. The company would partner with Amstrad and IBM for the Amstrad Mega PC and TeraDrive respectively in later years, but other endeavours such as the extremely rare Sega AI Computer saw only a small fraction of the success the SC-3000 received, and were built with very different aims.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "SC-3000"
        ]
    },
    "Sega ST-V": {
        "id": 126,
        "name": "Sega ST-V",
        "emulated": "true",
        "releasedate": "1994-08-01T00:00:00-07:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "2x Hitachi SH-2",
        "memory": "2 MB",
        "graphics": "VDP 1, VDP 2",
        "sound": "Yamaha YMF292-F SCSP",
        "media": "ROM cartridge",
        "maxcontrollers": "2",
        "notes": "The Sega ST-V (Sega Titan Video game system) was an arcade system board released by Sega in 1995. Departing from their usual process of building custom arcade hardware, Sega's ST-V is essentially identical to the Sega Saturn home console system. The only difference is the media; ST-V used ROM-cartridges instead of CD-ROMs to store games. Being derived from the Saturn hardware, the ST-V was presumably named after the moon Titan, a satellite of Saturn. The majority of ST-V titles were released in Japan only, but a notable exception was the port of Dynamite Deka, which became Die Hard Arcade. Games released for the ST-V includes the arcade version of Virtua Fighter Remix, Golden Axe: The Duel and Final Fight Revenge. The shared hardware between Saturn and ST-V allowed for very \"pure\" ports for the Saturn console.",
        "category": "Arcade",
        "usemamefiles": "true",
        "alternate": [
            "ST-V"
        ]
    },
    "Sinclair ZX-81": {
        "id": 127,
        "name": "Sinclair ZX-81",
        "emulated": "true",
        "releasedate": "1981-03-05T00:00:00-08:00",
        "developer": "Sinclair Research",
        "manufacturer": "Sinclair",
        "cpu": "Zilog Z80",
        "memory": "1 KB (64 KB max. 56 KB usable)",
        "sound": "Basic sound",
        "display": "64 x 48",
        "media": "Cassette tape",
        "notes": "The ZX81 is a home computer produced by Sinclair Research and manufactured in Scotland by Timex Corporation. It was launched in the United Kingdom in March 1981 as the successor to Sinclair's ZX80 and was designed to be a low-cost introduction to home computing for the general public. It was hugely successful, and more than 1.5 million units were sold before it was discontinued. The ZX81 found commercial success in many other countries, notably the United States, where it was initially sold as the ZX-81. Timex manufactured and distributed it under licence and enjoyed a substantial but brief boom in sales. Timex later produced its own versions of the ZX81 for the US market â\u0080\u0093 the Timex Sinclair 1000 and Timex Sinclair 1500. Unauthorised clones of the ZX81 were produced in several countries.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "ZX-81",
            "Sinclair ZX81"
        ]
    },
    "Sord M5": {
        "id": 128,
        "name": "Sord M5",
        "emulated": "true",
        "releasedate": "1982-11-18T00:00:00-08:00",
        "developer": "Sord Computer Corporation",
        "manufacturer": "Sord Computer Corporation",
        "cpu": "Zilog Z80",
        "memory": "20 KB (of which 16KB is screen memory)",
        "graphics": "TMS9918",
        "sound": "SN76489",
        "media": "Cartridge",
        "notes": "The Sord M5 is a home computer launched by Sord Computer Corporation in 1982. Primarily the Sord M5 competed in the Japanese home computer market. It was also sold as the CGL M5 in the United Kingdom by Computer Games Limited, and was reasonably popular in Czechoslovakia, where the M5 stood as one of the first affordable computers available to the general public. Takara also sold models in Japan as the Game M5, and models were also exported to South Korea.  Original models of the Sord M5 are relatively small by home computing standards, with a built in keyboard with rubber keys, similar to the ZX Spectrum. The specifications of the computer are very similar to the MSX, a computer which likely forced the Sord M5 (along with many similar Japanese computers) out of the market by the mid-1980s.  The CGL M5 was released in the UK with an introductory price of Â£195, higher than many of the system's competitors including the ZX Spectrum, and Commodore VIC-20. Whereas the M5 contained a cartridge slot in an age where most computers were using compact cassettes or floppy disks, the small amount of built-in RAM led to few games being produced for the system.  In South Korea, two electronics companies released different personal computers based on Sord M5. The FC-150 was produced and released by LG and the TommyCom was manufactured and launched by Koryo Systems. Both computers supported the Korean alphabet, Hangul. The system specifications of these computers were identical to the original M5 but they had differently shaped cartridge slots. Cartridges from the Sord M5 or other manufacturers could not be used on these computers directly. LG released some original software including several educational programs and games.  Despite its short production run, the M5 was supported by various big Japanese game developers such as Namco and Konami.  Other models include the M5 Pro and M5 Jr.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Texas Instruments TI 99\/4A": {
        "id": 129,
        "name": "Texas Instruments TI 99\/4A",
        "emulated": "true",
        "developer": "Texas Instruments",
        "manufacturer": "Texas Instruments",
        "cpu": "Texas Instruments TMS9900",
        "memory": "256 bytes",
        "graphics": "Texas Instruments TMS9918A",
        "sound": "Texas Instruments TMS9919",
        "media": "Cassette tape, Cartridge, Floppy disk",
        "notes": "The Texas Instruments TI-99\/4A is a home computer, it is a redesign of the TI-99\/4 system, which was discontinued. The new \"4A\" has a new graphics chip and a better keyboard.  About the only way to expand the original TI-99\/4A was from the expansion port on the right side of the console. Memory expansion, a serial interface, a floppy drive and other peripherals can be plugged in here for added capabilities.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Texas Instruments TI 99-4A"
        ]
    },
    "Touhou Project": {
        "id": 130,
        "name": "Touhou Project",
        "emulated": "true",
        "developer": "Team Shanghai Alice (formerly ZUN Soft)",
        "manufacturer": "Team Shanghai Alice",
        "notes": "The Touhou Project, also known as Toho Project or Project Shrine Maiden, is a series of Japanese bullet hell shooter video games developed by the single-person Team Shanghai Alice. Team Shanghai Alice's sole member, ZUN, independently produces the games' graphics, music, and programming.  Plots in the Touhou Project games revolve around the strange phenomena occurring in Gensokyo, a fictional realm inhabited by humans and yokai, supernatural beings. Prior to the events of the games, Gensokyo was sealed off from the outside world by a magical barrier. The main protagonist of the series, Reimu Hakurei, is a shrine maiden who manages the border, fighting antagonistic yokai. The first five games were produced for the Japanese NEC PC-9801 computer series; bullet hell mechanics were introduced in the second game, Story of Eastern Wonderland. The Embodiment of Scarlet Devil, released in August 2002, marked a shift to the Microsoft Windows platform, bringing the games to a larger audience. Several sequels followed, including spin-off fighting games that diverged from the series' traditional mechanics.  The series was inducted into the Guinness World Records in October 2010 for being the \"most prolific fan-made shooter series\". The Touhou Project has spawned a media franchise including commercial fan books, music, light novels, and manga, in addition to the main series.",
        "category": "Arcade",
        "usemamefiles": "false"
    },
    "Pinball": {
        "id": 131,
        "name": "Pinball",
        "emulated": "true",
        "notes": "Pinball is a type of arcade game, in which points are scored by a player manipulating one or more steel balls on a play field inside a glass-covered cabinet called a pinball machine (or \"pinball table\"). The primary objective of the game is to score as many points as possible. Many modern pinball machines include a story line where the player must complete certain objectives in a certain fashion to complete the story, usually earning high scores for different methods of completing the game. Points are earned when the ball strikes different targets on the play field. A drain is situated at the bottom of the play field, partially protected by player-controlled plastic bats called flippers. A game ends after all the balls fall into the drain a certain number of times. Secondary objectives are to maximize the time spent playing (by earning \"extra balls\" and keeping the ball in play as long as possible) and to earn bonus games (known as \"replays\").",
        "category": "Pinball",
        "usemamefiles": "false"
    },
    "VTech CreatiVision": {
        "id": 132,
        "name": "VTech CreatiVision",
        "emulated": "true",
        "releasedate": "1982-12-31T00:00:00-08:00",
        "developer": "VTech",
        "manufacturer": "VTech",
        "cpu": "Rockwell 6502A (8-bit) 2 MHz",
        "memory": "RAM: 1 Kb, Video RAM: 16 KB",
        "graphics": "Custom On Board Chip",
        "sound": "Texas Instruments SND76489 (4 Channels - 3 Tonal, 1 Noise)",
        "display": "256 Ã\u0097 192",
        "media": "Cassette Tape, Floppy Disk",
        "maxcontrollers": "2",
        "notes": "The VTech CreatiVision, usually just referred to as CreatiVision, is a second generation (1976-1992) video game console developed and distributed by VTech. It was released in early 1982 in Europe at a retail price of Â£499. The console was also released in Australia (1988) and New Zeland (1988) as the Dick Smith Wizard. The CreatiVision was a hybrid computer and home video game console. The console was discontinued in early 1986.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "CreatiVision"
        ]
    },
    "Watara Supervision": {
        "id": 133,
        "name": "Watara Supervision",
        "emulated": "true",
        "releasedate": "1992-12-31T00:00:00-08:00",
        "developer": "Watara",
        "manufacturer": "Watara",
        "cpu": "65SC02 (8-bit) at 4 Mhz",
        "memory": "8 kB RAM , 8 kB VRAM",
        "sound": "Mono Speaker",
        "display": "160 Ã\u0097 160",
        "media": "Cartridge",
        "maxcontrollers": "1",
        "notes": "The Watara Supervision, usually just referred to as Supervision, is a fourth generation (1987-2004) handheld video game console developed and distributed by Watara. It was released in 1992 in the United States of America at a retail price of $49.95. The console was also released in the United Kingdom (1992) as the QuickShot Supervision. The Supervision was known as a budget friendly cartridge based handheld system that could also be linked to a TV via a link cable. The console was discontinued in early 1996.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Supervision"
        ]
    },
    "WoW Action Max": {
        "id": 134,
        "name": "WoW Action Max",
        "emulated": "true",
        "releasedate": "1987-01-01T00:00:00-08:00",
        "developer": "Worlds of Wonder",
        "manufacturer": "Worlds of Wonder",
        "cpu": "HD401010 (8-bit)",
        "memory": "32 bytes",
        "graphics": "N\/A",
        "sound": "Internal Speaker",
        "display": "320 x 200 NTSC; 320 x 256 PAL",
        "media": "VHS Cassette Tape",
        "maxcontrollers": "1",
        "notes": "The WoW Action Max, usually just referred to as Action Max, is a third generation (1983-2003) video game console developed and distributed by Worlds of Wonder. It was released in September 1987 in North America at a retail price of $99.99. The console was also released in Europe (1987) in a limited capacity. The Action Max system required the owner to have a VCR to play it's games which were on VHS tapes. The console was discontinued in early 1988.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Action Max"
        ]
    },
    "ZiNc": {
        "id": 135,
        "name": "ZiNc",
        "emulated": "true",
        "notes": " Zinc is the Z Interpreter with Network Capabilities.  Zinc allows you to play text adventure games (also known as interactive fiction) either on your own, or cooperatively over a network. It comes with interpreters for two of the most popular interactive fiction file formats -- Z-machine games, and TADS games.",
        "category": "Arcade",
        "usemamefiles": "false"
    },
    "Nintendo Famicom Disk System": {
        "id": 136,
        "name": "Nintendo Famicom Disk System",
        "emulated": "true",
        "releasedate": "1986-02-21T00:00:00-08:00",
        "developer": "Nintendo",
        "manufacturer": "Mitsumi",
        "cpu": "Famicom CPU",
        "memory": "32 KB RAM, 8 KB VRAM",
        "graphics": "Famicom GPU",
        "sound": "PSG 5 channel mono",
        "display": "256x240",
        "media": "Mitsumi Quick Disk ",
        "maxcontrollers": "2",
        "notes": "The Family Computer Disk System, sometimes shortened as the Famicom Disk System or simply the Disk System, and abbreviated as the FDS or FCD, is a peripheral for Nintendo's Family Computer home video game console, released in Japan on February 21, 1986. It uses proprietary floppy disks called \"Disk Cards\" for data storage. Through its entire production span, 1986â\u0080\u00932003, 4.44 million units were sold.  The device is connected to the Famicom deck by plugging a special cartridge known as the RAM Adapter into the system's cartridge port, and attaching that cartridge's cable to the disk drive. The RAM adapter contains 32 kilobytes (KB) of RAM for temporary program storage, 8 KB of RAM for tile and sprite data storage, and an ASIC known as the 2C33. The ASIC acts as a disk controller for the floppy drive, and also includes additional sound hardware featuring a single-cycle wavetable-lookup synthesizer. Finally, embedded in the 2C33 is an 8KB BIOS ROM. The Disk Cards used are double-sided, with a total capacity of 112 KB per disk. Many games span both sides of a disk, requiring the user to switch sides at some point during gameplay. A few games use two full disks, totaling four sides. The Disk System is capable of running on six C-cell batteries or the supplied AC adapter. Batteries usually last five months with daily game play. The battery option is due to the likelihood of a standard set of AC plugs already being occupied by a Famicom and a television.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Famicom Disk System",
            "Famicon Disk System",
            "Nintendo Famicon Disk System"
        ]
    },
    "NEC PC-FX": {
        "id": 137,
        "name": "NEC PC-FX",
        "emulated": "true",
        "releasedate": "1994-12-23T00:00:00-08:00",
        "developer": "NEC Home Electronics",
        "manufacturer": "NEC Home Electronics",
        "cpu": "32-Bit NEC V810",
        "memory": "2 MB main RAM, 1 MB shared RAM, 32 KB back-up RAM",
        "graphics": "Digitized Y'UV",
        "sound": "16-Bit Stereo CD-DA",
        "display": "256x240p, 341x240p, 256x480i, 341x480i",
        "media": "CD-ROM",
        "maxcontrollers": "2",
        "notes": "The PC-FX is a 32-bit home video game console made by NEC Home Electronics. It was released in Japan on December 23, 1994, just weeks after Sony's PlayStation and a month after the Sega Saturn. It is the successor to the PC Engine (and its many add-ons), known as TurboGrafx-16 in North America.  Unlike its predecessors the PC-FX was only released in Japan. The console is shaped like a tower PC and was meant to be similarly upgradeable. However the PC-FX lacked a 3D polygon-based graphics chip that rendered the system underpowered in comparison to its competitors. It was also expensive and lacked developer support, and as a result it was unable to compete effectively with its fifth generation peers. The PC-FX was NEC's last home video game console, and was discontinued in February 1998.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "PC-FX"
        ]
    },
    "PC Engine SuperGrafx": {
        "id": 138,
        "name": "PC Engine SuperGrafx",
        "emulated": "true",
        "releasedate": "1989-12-08T00:00:00-08:00",
        "developer": "NEC Home Electronics",
        "manufacturer": "NEC Home Electronics",
        "cpu": "8-bit Hudson HuC6280 @ 7.16 MHz",
        "memory": "32 KB RAM, 128 KB video RAM",
        "graphics": "Hudson HuC6260 @ 10 MHz, 2x 16-bit Hudson HuC6270 @ 10 MHz, Hudson HuC6202",
        "sound": "HuC6280A",
        "display": "256x224p, 352x224p, 512x224p, 256x240p, 352x240p, 512x240p, 256x448i, 352x448i, 512x448i, 256x480i, 352x480i, 512x480i",
        "media": "HuCard",
        "maxcontrollers": "1 (up to 5 with TurboTap)",
        "notes": "The PC Engine SuperGrafx, also shortened as the SuperGrafx or PC Engine SG, is a video game console by NEC Home Electronics, released exclusively in Japan. It is an upgraded version of the PC Engine, released two years prior. Like the PC Engine, the SuperGrafx was also imported and sold in France.  Originally announced as the PC Engine 2, the machine was purported to be a true 16-bit system with improved graphics and audio capabilities over the original PC Engine. Expected to be released in 1990, the SuperGrafx was rushed to market, debuting several months earlier in late 1989 with only modest improvements over the original PC Engine.  Only seven games were produced which took advantage of the improved SuperGrafx hardware, and two of those could be played on a regular PC Engine. However, the SuperGrafx is backwards compatible with all PC Engine software in both, HuCard and CD-ROM format, bringing the compatible software total up to nearly 700. The system was not widely adopted and is largely seen as a commercial failure.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "SuperGrafx",
            "NEC SuperGrafx"
        ]
    },
    "NEC TurboGrafx-CD": {
        "id": 139,
        "name": "NEC TurboGrafx-CD",
        "emulated": "true",
        "releasedate": "1989-11-01T00:00:00-08:00",
        "developer": "NEC Corporation, Hudson Soft",
        "manufacturer": "NEC Corporation, Hudson Soft",
        "cpu": "Uses the TurboGrafx-16 CPU",
        "memory": "64 KB (system), 64 KB (sound), plus TurboGrafx-16 Video RAM",
        "graphics": "Uses the TurboGrafx-16 GPU",
        "sound": "Oki MSM5205 @ 1.53 MHz",
        "display": "256x224p, 352x224p, 512x224p, 256x240p, 352x240p, 512x240p, 256x448i, 352x448i, 512x448i, 256x480i, 352x480i, 512x480i",
        "media": "CD-ROM",
        "maxcontrollers": "1 (up to 5 with TurboTap)",
        "notes": "The TurboGrafx-CD is an add on for the TurboGrafx-16. It was released to expand the library of games of the TurboGrafx 16.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "NEC PC Engine-CD",
            "TurboGrafx CD",
            "NEC TurboGrafx-CD",
            "NEC TurboGrafx CD",
            "PC Engine CD",
            "NEC PC Engine CD"
        ]
    },
    "TRS-80 Color Computer": {
        "id": 140,
        "name": "TRS-80 Color Computer",
        "emulated": "true",
        "developer": "Tandy Corporation",
        "manufacturer": "Motorola",
        "cpu": "Motorola 6809E",
        "memory": "4 KB \/ 16 KB \/ 32 KB \/ 64 KB \/ 128 KB \/ 512 KB",
        "graphics": "MC6847 Video Display Generator",
        "media": "Cassette tape, Cartridge",
        "maxcontrollers": "2",
        "notes": "The Radio Shack TRS-80 Color Computer (also marketed as the Tandy Color Computer and affectionately nicknamed CoCo) is a line of home computers based on the Motorola 6809 processor. The Color Computer was launched in 1980, and lasted through three generations of hardware until being discontinued in 1991.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Nintendo Game & Watch": {
        "id": 141,
        "name": "Nintendo Game & Watch",
        "emulated": "true",
        "releasedate": "1980-04-28T00:00:00-07:00",
        "developer": "Nintendo",
        "manufacturer": "Nintendo",
        "display": "LCD",
        "media": "Pre-installed software",
        "maxcontrollers": "1",
        "notes": "The Game & Watch series are a total of 60 handheld electronic games produced by Nintendo from 1980 to 1991. Created by game designer Gunpei Yokoi, each Game & Watch features a single game to be played on an LCD screen in addition to a clock, an alarm, or both. This console inspired Nintendo to make the Game Boy. It was the earliest Nintendo product to gain major success.",
        "category": "Handhelds",
        "usemamefiles": "false",
        "alternate": [
            "Game & Watch",
            "Game and Watch",
            "Nintendo Game and Watch",
            "Tricotronic"
        ]
    },
    "SNK Neo Geo CD": {
        "id": 142,
        "name": "SNK Neo Geo CD",
        "emulated": "true",
        "releasedate": "1994-09-09T00:00:00-07:00",
        "developer": "SNK",
        "manufacturer": "SNK",
        "cpu": "Motorola 68000 @ 12 MHz, Zilog Z80 @ 4 MHz",
        "memory": "2 MB RAM, 4,5 MB VRAM",
        "graphics": "SNK NEO-GRC @ 6 MHz",
        "sound": "Yamaha YM2610 15 sound channels",
        "display": "304 x 224",
        "media": "CD-ROM",
        "maxcontrollers": "2",
        "notes": "The Neo Geo CD, released in 1994, was initially an upgrade from the original AES. This console uses CDs instead of ROM cartridges like the AES. The unit's (approximately) 1X CD-ROM drive was slow, making loading times very long with the system loading up to 56 Mbits of data between loads. Neo Geo CD game prices were low at US$50, in contrast to Neo Geo AES game cartridges which cost as much as US$300. The system could also play Audio CDs. All three versions of the system have no region-lock.  The Neo Geo CD was bundled with a control pad instead of a joystick like the AES. However, the original AES joystick can be used with all 3 Neo Geo CD models (top loader, front loader and CDZ, an upgraded version of the CD console, that was only released in Japan), instead of the included control pads.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "SNK Neo-Geo CD",
            "Neo-Geo CD",
            "NeoGeo CD",
            "Neo Geo CD",
            "SNK NeoGeo CD",
            "NGCD"
        ]
    },
    "Nintendo Satellaview": {
        "id": 143,
        "name": "Nintendo Satellaview",
        "emulated": "true",
        "releasedate": "1995-04-23T00:00:00-07:00",
        "developer": "Nintendo",
        "manufacturer": "Nintendo",
        "memory": "512 KB RAM",
        "display": "256x224p up to 512x448i",
        "media": "ROM cartridge, flash memory",
        "maxcontrollers": "2",
        "notes": "The Satellaview is a satellite modem peripheral for Nintendo's Super Famicom system that was released in Japan in 1995. Available for pre-release orders beginning February 13, 1995, the Satellaview retailed for between Â¥14,000 and 18,000 (at the time between USD$141 and 182) and came bundled with the BS-X Game Pak and an 8M Memory Pak.  The Satellaview system was developed and released by Nintendo to receive signals broadcast from satellite TV station WOWOW's satellite radio subsidiary, St.GIGA. St.GIGA was responsible for file server management, maintenance, and vocalization for \"SoundLink\" games. Nintendo data broadcasts were given a fixed time slot known as the Super Famicom Hour during which scrambled Satellaview-related data was streamed via radio waves to be unscrambled by St.GIGA's \"BS digital hi-vision TV.\" As a subscription-based station for ambient and New Age music, St.GIGA listeners were already equipped with \"BS tuners\" prior to St.GIGA's contract with Nintendo. Satellaview owners who lacked a \"BS tuner\" had to purchase one separately from St.GIGA at a price of Â¥33,000, as well as sign up for Nintendo's and St.GIGA's monthly joint membership fees. Alternatively, users could rent \"BS tuners\" from St.GIGA for a 6-month period at a price of Â¥5,400. Even at this premium price, St.GIGA reported subscriptions peaking at 116,378 households by March 1997, and dropping to around 46,000 by June 2001.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Satellaview"
        ]
    },
    "Taito Type X": {
        "id": 184,
        "name": "Taito Type X",
        "emulated": "false",
        "usemamefiles": "false",
        "alternate": [
            "ArcadePC",
            "Type X"
        ]
    },
    "XaviXPORT": {
        "id": 181,
        "name": "XaviXPORT",
        "emulated": "false",
        "releasedate": "2004-01-01T00:00:00-08:00",
        "developer": "SSD COMPANY LIMITED",
        "cpu": "65816 CPU",
        "notes": "The XaviXPORT, sold as the Domyos Interactive System in Europe in Decathlon stores, is a fitness-based home video game console developed by Japanese company SSD COMPANY LIMITED and released in the United States in 2004 during the sixth generation of video game consoles.",
        "usemamefiles": "false"
    },
    "Mattel HyperScan": {
        "id": 182,
        "name": "Mattel HyperScan",
        "emulated": "false",
        "releasedate": "2006-10-23T00:00:00-07:00",
        "manufacturer": "Mattel",
        "cpu": "Sunplus SPG290 SoC",
        "memory": "16 MB SDRAM system RAM",
        "graphics": "Sunplus SPG290 SoC",
        "display": "640Ã\u0097480 native resolution, 65,535 colors (RGB 565 mode)",
        "media": "CD-ROM",
        "maxcontrollers": "2",
        "notes": "The HyperScan is a video game console from the toy company Mattel. It uses radio frequency identification (RFID) along with traditional video game technology. The included game was rated \"T\" and the remaining titles were rated \"E10+\", by the ESRB, despite this, it was marketed toward boys between the ages of five and nine who were not ready for high-end video games in terms of maturity or expense. The console used UDF format CD-ROMs. The HyperScan has two controller ports, as well as a 13.56 MHz RFID scanner that reads and writes to the \"cards\" which, in turn, activate features in and save data from the game. Players are able to enhance the abilities of their characters by scanning cards. Games retailed for $19.99 and the console itself for $69.99 at launch, but at the end of its very short lifespan, prices of the system were down to $9.99, the games $1.99, and booster packs $0.99.",
        "usemamefiles": "false",
        "alternate": [
            "HyperScan"
        ]
    },
    "Game Wave Family Entertainment System": {
        "id": 147,
        "name": "Game Wave Family Entertainment System",
        "emulated": "true",
        "releasedate": "2005-10-31T00:00:00-08:00",
        "developer": "ZAPiT Games",
        "manufacturer": "ZAPiT Games",
        "cpu": "Mediamatics 8611",
        "memory": "16 MB SRAM",
        "graphics": "N\/A",
        "sound": "2 Channel D\/A Full Stereo",
        "display": "480p,480i,720p,720i,1080i",
        "media": "DVD",
        "maxcontrollers": "6",
        "notes": " The ZAPiT Game Wave Family Entertainment System, usually just referred to as the Game Wave, is a seventh generation (2005-2017) video game console developed and distributed by ZAPiT Games. It was released in October 2005 in North America, starting in Canada, at a retail price of $99.99. The Game Wave was a hybrid DVD player and home console, mostly focused on trivia based games. The console was discontinued in sometime in 2009.",
        "category": "Consoles",
        "usemamefiles": "false"
    },
    "Sega CD 32X": {
        "id": 148,
        "name": "Sega CD 32X",
        "emulated": "true",
        "releasedate": "1994-11-21T00:00:00-08:00",
        "developer": "Sega",
        "manufacturer": "Sega",
        "cpu": "Motorola 68000 @ 7.67 MHz (Genesis\/Mega Drive) + Motorola 68000 @ 12.5 MHz (Sega CD) + 2x Hitachi SH-2 @ 23 MHz (32X)",
        "memory": "832 KB RAM (64 KB Genesis\/Mega Drive, 512 KB Sega CD, 256 KB (32X), 576 KB VRAM (64 KB Genesis\/Mega Drive, 256 KB Sega CD, 256 KB 32X)",
        "graphics": "Yamaha YM7101 @ 13.42 MHz (Genesis\/Mega Drive) + Sega VDP @ 6.25 MHz (Sega CD) + Sega VDP @ 23 MHz (32X)",
        "sound": "Pulse-width modulation",
        "display": "320 Ã\u0097 240",
        "media": "ROM cartridge, CD-ROM (with Sega CD)",
        "maxcontrollers": "2",
        "notes": "The Sega Mega Drive console received two add-on hardware upgrades during its life time: the Sega Mega-CD and Sega 32X. It is possible to install both of these on the same base console, creating a system called the Sega Mega-CD 32X (PAL region) or Sega CD 32X (USA). This opens the possibility of software that can utilise both the Mega-CD's enhanced storage capacity and ability to play Red Book CD audio, and the 32X's enhancements in graphics and sound capabilities.  Six games were released that require both add-on units in order to be played. All of these titles are full motion video based games, which were previously available as standalone Mega-CD games, and later had their FMV assets upgraded to take advantage of the 32X's improved graphics. As such, all six were released on CDs, with the cart slot of the 32X being unused during gameplay.  Japan did not receive any Mega-CD 32X games, however North America received five while Europe recieved four of those five. Surgical Strike, once bound for a North American release, ended up being an exclusive title in Brazil (and curiously wound up being the only Mega-CD 32X game to reach this region). A further half-dozen titles were in development for the Mega-CD 32X at one stage, but were all cancelled, some merely appearing in Mega-CD form and some being moved to the Sega Saturn.",
        "category": "Consoles",
        "usemamefiles": "false",
        "alternate": [
            "Sega Mega CD 32X",
            "Mega CD 32X"
        ]
    },
    "Aamber Pegasus": {
        "id": 149,
        "name": "Aamber Pegasus",
        "emulated": "true",
        "releasedate": "1981-01-01T00:00:00-08:00",
        "developer": "Technosys Research Labs",
        "manufacturer": "Technosys Research Labs",
        "cpu": "MC6809C",
        "memory": "4k RAM, later versions had 64k",
        "graphics": "",
        "sound": "",
        "display": "",
        "media": "",
        "maxcontrollers": "",
        "notes": "The Aamber Pegasus is a home computer designed by Technosys Research Labs. The computer was released in early 1981 in New Zealand for an unknown retail price. The computer was not released outside of New Zealand. The Pegasus sold around only 100 units when it was first released, due to the popularity of Apple II computers. The computers were manufactured until Technosys's collapse in late 1981.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "Pegasus"
        ]
    },
    "Apogee BK-01": {
        "id": 150,
        "name": "Apogee BK-01",
        "emulated": "true",
        "releasedate": "1988-01-01T00:00:00-08:00",
        "developer": "",
        "manufacturer": "ARB Plant",
        "cpu": "KR580VM80A, 1.78 MHz",
        "memory": "56.25 kb RAM, 4 kb ROM",
        "graphics": "Text Only with a Character Generator",
        "sound": " KR580VI53, 3-Channel, 1 Bit per channel",
        "display": "64 x 25 Characters, 6 x 8 Pixels",
        "media": "CD, Cassette",
        "maxcontrollers": "",
        "notes": "The Apogee BK-01 or Apogey BK-01 is a Soviet 8-bit personal computer built on the Radio 86RK and released in 1988. Its later version, the Apogee BK-01C featured color support.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "BK-01",
            "BK01",
            "Apogee BK01",
            "Apogey BK01",
            "Apogey BK-01"
        ]
    },
    "Commodore MAX Machine": {
        "id": 151,
        "name": "Commodore MAX Machine",
        "emulated": "true",
        "releasedate": "1982-01-01T00:00:00-08:00",
        "developer": "Commodore Business Machines",
        "manufacturer": "Commodore Business Machines",
        "cpu": "MOS Technology 6510, 1.02 MHz",
        "memory": "2 KB RAM",
        "graphics": "VIC-II 6566",
        "sound": "SID Sound Chip",
        "display": "320 x 200",
        "media": "ROM Cartridge",
        "maxcontrollers": "1",
        "notes": "The Commodore MAX Machine, also known as Ultimax in the United States and VC-10 in Germany, was a home computer designed and sold by Commodore International in Japan, beginning in early 1982, a predecessor to the popular Commodore 64. The Commodore 64 manual mentions the machine by name, suggesting that Commodore intended to sell the machine internationally; however, it is unclear whether the machine was ever actually sold outside Japan. It is considered a rarity.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Commodore PET": {
        "id": 152,
        "name": "Commodore PET",
        "emulated": "true",
        "releasedate": "1977-10-01T00:00:00-07:00",
        "developer": "Commodore Business Machines",
        "manufacturer": "Commodore Business Machines",
        "cpu": "MOS Technology 6502, 1 MHz",
        "memory": "4 KB up to 96 KB",
        "graphics": "TTL Video Circuit",
        "sound": "None",
        "display": "40 x 25",
        "media": "Cassette Tape, 5.25\" Floppy, 8\" Floppy",
        "maxcontrollers": "1",
        "notes": "The Commodore PET (Personal Electronic Transactor) is a line of home\/personal computers produced starting in 1977 by Commodore International. A top-seller in the Canadian and United States educational markets, it was Commodore's first full-featured computer, and formed the basis for their entire 8-bit product line, including the Commodore 64. The first model, which was named the PET 2001, was the first personal computer ever made available to retail consumers.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Exelvision EXL 100": {
        "id": 153,
        "name": "Exelvision EXL 100",
        "emulated": "true",
        "releasedate": "1984-08-01T00:00:00-07:00",
        "developer": "Exelvision",
        "manufacturer": "Exelvision",
        "cpu": "TMS 7020, 4.91 MHz",
        "memory": "34 KB RAM",
        "graphics": "8 Colors",
        "sound": "TMS-5220A",
        "display": "320 x 200",
        "media": "ROM Cartridge, Cassette Tape, 3.4\" Floppy",
        "maxcontrollers": "2",
        "notes": "The EXL 100 of the French brand Exelvision is a microprocessor computer based on the TMS7020 from Texas Instruments. It was original for the time because almost all home computers in France were equipped with microprocessors of the series 6502 of MOS Technology or the Zilog Z80.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Exidy Sorcerer": {
        "id": 154,
        "name": "Exidy Sorcerer",
        "emulated": "true",
        "releasedate": "1978-01-01T00:00:00-08:00",
        "developer": "Exidy",
        "manufacturer": "Exidy",
        "cpu": "Zilog Z80, 2.106 MHz",
        "memory": "4 KB RAM",
        "graphics": "Monochrome Graphics",
        "sound": "None",
        "display": "64 x 30 Character Display",
        "media": "Cassette Tape",
        "maxcontrollers": "1",
        "notes": "The Sorcerer is one of the early home computer systems, released in 1978 by the videogame company Exidy. It was comparatively advanced when released, especially when compared to the contemporary more commercially successful Commodore PET and TRS-80, but due to a number of problems, including a lack of marketing, the machine remained relatively unknown.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Fujitsu FM-7": {
        "id": 155,
        "name": "Fujitsu FM-7",
        "emulated": "true",
        "releasedate": "1982-11-01T00:00:00-08:00",
        "developer": "Fujitsu",
        "manufacturer": "Fujitsu",
        "cpu": "2x MBL 68B09, 2 MHz",
        "memory": "64KB RAM",
        "graphics": "8 - 262144 Colors",
        "sound": "3-Channel AY-3-8910 PSG Chip",
        "display": "640 x 200",
        "media": "Cassette Tape, 5.25\" Floppy",
        "maxcontrollers": "1",
        "notes": "The FM-7 (\"Fujitsu Micro 7\") is a home computer created by Fujitsu, first released in 1982, only sold in Japan. It is a stripped down version of their earlier FM-8; during development, the FM-7 was known as the \"FM-8 Jr.\".",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "FM7",
            "Fujitsu Micro 7"
        ]
    },
    "Hector HRX": {
        "id": 156,
        "name": "Hector HRX",
        "emulated": "true",
        "releasedate": "1983-01-01T00:00:00-08:00",
        "developer": "Micronique",
        "manufacturer": "Micronique",
        "cpu": "Zilog Z80A, 5 MHz",
        "memory": "64 KB RAM",
        "graphics": "4 Colors",
        "sound": "1 Channel",
        "display": "243 x 231",
        "media": "Cassette Tape, Floppy",
        "maxcontrollers": "2",
        "notes": "The Hector HRX follows the 2HR, and takes over exactly the same machine, while technically stretching it on certain points. The main evolution comes from the amount of RAM that goes to 64 KB, allowing it to display double the number of colors on screen. The machine also now has a cartridge port, which ultimately was used very little, mostly only near the end of its life. It is indeed the last machine of the French firm for the Victor \/ Hector range.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Lviv PC-01": {
        "id": 157,
        "name": "Lviv PC-01",
        "emulated": "true",
        "releasedate": "1987-01-01T00:00:00-08:00",
        "developer": "",
        "manufacturer": "",
        "cpu": "i8080",
        "memory": "48 KB RAM",
        "graphics": "16 KB VRAM, 4 Color Palette",
        "sound": "",
        "display": "256 x 256",
        "media": "Cassette Tape",
        "maxcontrollers": "1",
        "notes": "The Lviv PC-01 was an i8080 clone first introduced in the city of Lviv in the Soviet Union. The PC-01 started to appear in computer shops in 1987 but was in development since the early 1980s.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Matra and Hachette Alice": {
        "id": 158,
        "name": "Matra and Hachette Alice",
        "emulated": "true",
        "releasedate": "1983-09-23T00:00:00-07:00",
        "manufacturer": "Matra, Hachette, & Tandy",
        "cpu": "Motorola 6803",
        "memory": "4 KiB on-board",
        "display": "SCART",
        "media": "Cassette",
        "notes": "The Matra & Hachette Ordinateur Alice was a home computer sold in France beginning in 1983. It was a clone of the TRS-80 MC-10, produced through a collaboration between Matra and Hachette in France and Tandy Corporation in the United States. The Alice is distinguished by its unique, bright red casing. Functionally, it is equivalent to the MC-10, with a PÃ©ritel (SCART) connector replacing the RF modulator for video output.Unlike its progenitor, the Alice became a popular computer in its home country, aided by its presence in schools as part of the country's Informatique pour tous (\"Information technology for everyone\") programme. ",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Microsoft MSX2": {
        "id": 159,
        "name": "Microsoft MSX2",
        "emulated": "true",
        "releasedate": "1985-01-01T00:00:00-08:00",
        "developer": "Microsoft",
        "manufacturer": "Various",
        "cpu": "Zilog Z80A",
        "memory": "64 KB minimum, 128 KB common, 512 KB some",
        "graphics": "Yamaha V9938",
        "sound": "Yamaha YM2149",
        "display": "512Ã\u0097212 and 256Ã\u0097212 plus text mode 80Ã\u009724",
        "media": "Cassette tape, Cartridge, Floppy disk",
        "notes": "The MSX2 was the second generation of the MSX1 standard, unofficially also known as \"MSX2\", released by Microsoft in 1985.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "MSX2"
        ]
    },
    "Microsoft MSX2+": {
        "id": 160,
        "name": "Microsoft MSX2+",
        "emulated": "true",
        "releasedate": "1988-01-01T00:00:00-08:00",
        "developer": "Microsoft",
        "manufacturer": "Various",
        "cpu": "Zilog Z80A",
        "memory": "64 KB minimum, 128 KB common, 512 KB some",
        "graphics": "Yamaha V9958",
        "sound": "Yamaha YM2149",
        "display": "256Ã\u0097212",
        "media": "Cassette tape, Cartridge, Floppy disk",
        "notes": "After 1986, Microsoft stopped with supporting MSX and ASCII in Japan took over further development of the MSX system. Due to ASCII's lack of interest in European market the MSX2+ was never manufactured and sold outside Japan. Rumours and plans existed in the Netherlands to make a European MSX2+, but they never came to reality.",
        "category": "Computers",
        "usemamefiles": "false",
        "alternate": [
            "MSX2+"
        ]
    },
    "NEC PC-8801": {
        "id": 161,
        "name": "NEC PC-8801",
        "emulated": "true",
        "releasedate": "1981-12-11T00:00:00-08:00",
        "developer": "NEC",
        "manufacturer": "NEC",
        "cpu": "uPD780C-1 (Z80A compatible)",
        "memory": "64 KB (up to 576 KB)",
        "sound": "3 FM channels + 3 SSG + 6 rhythms + 1 ADPCM",
        "display": "640 x 200 (8 colours), 640 x 400 (Monochrome)",
        "media": "Cassette tape",
        "notes": "Featuring a 4MHz Z80A-compatible processor and a 640x200-pixel, 8-color display, the PC-8801 was twice as fast as the PC-8001, with eight times as many pixels and up to four times as much RAM. However, the biggest selling point was its backwards compatibility with PC-8001 software, providing a smooth upgrade path for customers who had already bought into the NEC ecosystem. Games were not the primary focus, as NEC intended to sell its high-end 8-bit machine to a whole spectrum of customers ranging from computer enthusiasts to small businesses and educational institutions.   Major models: - PC-8801 (November 1981). Original model. - PC-8801mkII (November 1983). Minor upgrade over original model. Built-in floppy disk drives. - PC-8801mkIISR (January 1985). Graphics significantly upgraded with the introduction of a new V2 mode, and built-in FM synthesis using a YM2203 (OPN) chip. This model marks the repositioning of the PC-8801 as a system for hobbyists and gamers. - PC-8801FH (November 1986). CPU upgraded to 8MHz, but switchable to 4MHz for compatibility. A sleek jet-black model was also available. - PC-88VA (March 1987). Featuring a 16-bit CPU, up to 65536 colors, a video processor providing hardware-based scrolling and spriting, and a custom OS, the PC-88VA was a powerhouse of a system that was unfortunately plagued by compatibility problems, and ultimately overshadowed by the Sharp X68000. Although technically part of the PC-8801 series, it's best to think of the PC-88VA as a completely separate system. - PC-8801FA (October 1987). Audio upgraded to the Yamaha YM2608 (OPNA) FM synthesis chip. Older models could also be upgraded to OPNA by purchasing the Sound Board II expansion board. - PC-98DO (June 1989). A hybrid computer that could switch between PC-8801 and PC-9801 modes. - PC-8801MC (November 1989). Included a built-in CD-ROM drive, but very few games took advantage of it.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "NEC PC-9801": {
        "id": 162,
        "name": "NEC PC-9801",
        "emulated": "true",
        "releasedate": "1982-10-01T00:00:00-07:00",
        "manufacturer": "NEC",
        "cpu": "8086 @ 5 MHz",
        "memory": "128 KB RAM, expandable to 640 KB",
        "graphics": "Two ÂµPD7220 display controllers (one for text, the other for video graphics)",
        "sound": "Commonly PC-9801-26 sound card ",
        "display": "8-color display running at 640 x 400 resolution",
        "media": "8\" floppy diskette",
        "notes": "The PC-9800 series, commonly shortened to PC-98, is a lineup of Japanese 16-bit and 32-bit personal computers manufactured by NEC from 1982 through 2000. The platform established NEC's dominance in the Japanese personal computer market, and by 1999, more than 18 million PC-98 units had been sold. The first model, the PC-9801, was launched on October 1982, and employed an 8086 CPU. It ran at a clock speed of 5 MHz, with two ÂµPD7220 display controllers (one for text, the other for video graphics), and shipped with 128 KB of RAM, expandable to 640 KB. Its 8-color display had a maximum resolution of 640Ã\u0097400 pixels. Its successor, the PC-9801E, which appeared in 1983, employed an 8086-2 CPU, which could selectively run at a speed of either 5 or 8 MHz. The NEC PC-9801VM used NEC V30 CPU.  When the PC-9801 was launched in 1982, it was initially priced at 298,000 yen (about US$1,200 in 1982 dollars). In the 1980s and early 1990s, NEC dominated the Japan domestic PC market with more than 60% of the PCs sold as PC-9801 or PC-8801.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Nintendo 64DD": {
        "id": 163,
        "name": "Nintendo 64DD",
        "emulated": "true",
        "releasedate": "1999-12-01T00:00:00-08:00",
        "developer": "Nintendo, Alps Electric",
        "manufacturer": "Alps Electric",
        "media": "Magnetic disk (64 MB)",
        "notes": "The 64DD, colloquially referred to as the Nintendo 64DD, is a magnetic disk drive peripheral for the Nintendo 64 game console developed by Nintendo. It was originally announced in 1995, prior to the Nintendo 64's 1996 launch, and after numerous delays was finally released only in Japan on December 1, 1999. Only ten software titles were released until the unit was discontinued in February 2001. It was a commercial failure, with at least 15,000 total units sold and another 85,000 units unsold.",
        "category": "Consoles",
        "usemamefiles": "false"
    },
    "Nintendo Pokemon Mini": {
        "id": 164,
        "name": "Nintendo Pokemon Mini",
        "emulated": "true",
        "releasedate": "2001-11-16T00:00:00-08:00",
        "developer": "Nintendo",
        "manufacturer": "Nintendo",
        "cpu": "Timex S1C88",
        "memory": "4 KB RAM",
        "display": "Monochrome LCD, 96 Ã\u0097 64 pixels",
        "media": "ROM cartridge",
        "notes": "The PokÃ©mon Mini is a handheld game console that was designed and manufactured by Nintendo and themed around the PokÃ©mon media franchise. It is the smallest game system with interchangeable cartridges ever produced by Nintendo, weighing just under two and a half ounces (70 grams). It was first released in North America on November 16, 2001, then in Japan on December 14, 2001, and in Europe on March 15, 2002. The systems were released in three colors: Wooper Blue, Chikorita Green, and Smoochum Purple.  Features of the PokÃ©mon mini include an internal real-time clock, an infrared port used to facilitate multiplayer gaming, a reed switch for detecting shakes, and a motor used to implement force feedback. The GameCube game PokÃ©mon Channel features playable demo versions of several PokÃ©mon mini games via console emulation. Also included in the game is Snorlax's Lunch Time, a PokÃ©mon Channel exclusive. Some games were only released in Japan, such as Togepi's Adventure.",
        "category": "Handhelds",
        "usemamefiles": "false"
    },
    "Othello Multivision": {
        "id": 165,
        "name": "Othello Multivision",
        "emulated": "true",
        "releasedate": "1983-07-15T00:00:00-07:00",
        "developer": "Tsukuda Original",
        "manufacturer": "Tsukuda Original",
        "cpu": "Zilog Z80A",
        "memory": "1 Kb + 2 KB of embedded game",
        "graphics": "Texas Instruments TMS9918A",
        "sound": "Texas Instruments SN76489",
        "display": "256 x 192",
        "media": "ROM cartridge",
        "maxcontrollers": "1",
        "notes": "The Othello Multivision is an SG-1000 clone manufactured by Tsukuda Original. It exists because Sega's original intention for the SC-3000 computer was to allow other manufacturers to produce compatible computers in the hope of having a worldwide standard. Unfortunately, possibly with the emergance of the MSX, this tactic failed, and very few SG-1000\/SC-3000 compatible machines were produced. The Othello Multivision was one of those machines.  Similar to the SG-1000, there are two versions of the Othello Multivision, named the FG-1000 (released 1983) and FG-2000 (released 1984) respectively. As well as being able to run SG-1000 and SC-3000 cartridges, the Othello Multivision saw a number of games and software released with Othello Multivision branding. The system also came with the game Othello built-in.  One of the major problems with the Othello Multivision is that rather than rely on external game controllers, all the controls are built into the unit. It is compatible with several SG-1000 add-ons, however, including the SK-1100 which would enable the SC-3000's keyboard functions. FG-1000 models shipped with an overlay which would explain the functions of each key.  The FG-2000 model brought support for a second controller. This model can easily be identified by the fact it uses blue keys rather than red ones and the fact the built-in joystick has been replaced with a directional pad.",
        "category": "Consoles",
        "usemamefiles": "false"
    },
    "VTech Socrates": {
        "id": 166,
        "name": "VTech Socrates",
        "emulated": "true",
        "releasedate": "1988-07-11T00:00:00-07:00",
        "developer": "VTech",
        "manufacturer": "VTech",
        "cpu": "Zilog Z80A 3.58Mhz",
        "memory": "64 KB",
        "graphics": "Custom",
        "sound": "Toshiba tc8802AF",
        "display": "256 x 228",
        "media": "Cartridge",
        "maxcontrollers": "2",
        "notes": "The VTech Socrates, usually just referred to as Socrates, is a third generation (1983-2003) video game console developed and distributed by VTech. It was released in July 1988 in North America at a retail price of $129.99. The console was also released in Germany (1988) as the Prof. Weiss-Alle and France (1988) as the Professeur Saitout. The Socrates was an educational machine that featured standard wireless controllers which communicated via infrared reception. The console was discontinued quietly in the early 1990's.",
        "category": "Consoles",
        "usemamefiles": "false"
    },
    "Vector-06C": {
        "id": 167,
        "name": "Vector-06C",
        "emulated": "true",
        "cpu": "KR580VM80A",
        "memory": "64 KB",
        "sound": "KR580VI53",
        "display": "512Ã\u0097256",
        "media": "Cassette tape",
        "notes": "Vector-06C is a home computer with unique graphics capabilities that was designed and mass-produced in USSR in the late 1980s.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Tomy Tutor": {
        "id": 168,
        "name": "Tomy Tutor",
        "emulated": "true",
        "developer": "Tomy",
        "manufacturer": "Matsushita",
        "cpu": "TMS 9995",
        "memory": "16KB",
        "display": "256 x 192",
        "notes": "The Tomy Tutor, originally sold in Japan as the Pyuta and in the UK as the Grandstand Tutor, is a home computer produced by the Japanese toymaker Tomy. It was architecturally similar, but not identical, to the Texas Instruments TI-99\/4A, and used a similar 16-bit CPU. The computer was launched on the UK and European markets in late 1983. Outside Japan, however, sales were not significant.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Spectravideo": {
        "id": 169,
        "name": "Spectravideo",
        "emulated": "true",
        "notes": "Spectravideo, or SVI (Spectravideo International), was an American computer company founded in 1981 as \"SpectraVision\" by Harry Fox. They originally made video games for Atari 2600 and VIC-20. Some of their computers were MSX-compliant or IBM PC compatible. They ceased operations in 1988.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Sony PSP Minis": {
        "id": 170,
        "name": "Sony PSP Minis",
        "emulated": "true",
        "releasedate": "2009-10-01T00:00:00-07:00",
        "notes": "PlayStation minis launched on October 1, 2009 for the PSP and the PSPGo in all regions. Under 100MB these games are smaller, cheaper, and download only. In December of 2009, an update was released on the PlayStation 3 (3.15) which enables most Minis to be played on the home console.",
        "category": "Handhelds",
        "usemamefiles": "false"
    },
    "Sony PocketStation": {
        "id": 171,
        "name": "Sony PocketStation",
        "emulated": "true",
        "releasedate": "1999-01-23T00:00:00-08:00",
        "developer": "Sony Computer Entertainment",
        "manufacturer": "Sony",
        "cpu": "ARM7TDMI @ 2 MHz",
        "memory": "2 KB",
        "sound": "1 miniature speaker (10-bit PCM)",
        "display": "32Ã\u009732 dot monochrome LCD",
        "media": "PlayStation CD-ROM (used for content transfer)",
        "maxcontrollers": "1",
        "notes": "The PocketStation is a Memory Card peripheral by Sony Computer Entertainment for the PlayStation home video game console. Categorized by Sony as a combination of a Memory Card and a miniature personal digital assistant, the device features a monochrome liquid crystal display (LCD), infrared communication capability, a real-time clock, built-in flash memory, and sound capability. To use the device's memory card functionality, it must be connected to a PlayStation through a memory card slot. It was released exclusively in Japan on January 23, 1999.  Software for the PocketStation was typically distributed as extras for PlayStation games, included in the CD-ROM, enhancing the games with added features. Stand-alone software could also be downloaded through the PlayStation console. The software is then transferred to the PocketStation for use. A built-in infrared data interface allows direct transfer of data such as game saves between PocketStation units, as well as multiplayer gaming.  The original Japanese ship date for the PocketStation was set for December 23, 1998, but it was delayed a full month. Sony only shipped an initial 60,000 units of the peripheral when it was released on January 23, 1999. It was initially available in two case colors: white and clear. It proved extremely popular, selling out all over the region. Sony planned to release the PocketStation outside Japan, engaging in promotional activity in Europe and North America, but the release did not occur. SCEA cited an inability meeting Japanese demand as the reason for the PocketStation's absence. A few games, such as Final Fantasy VIII and SaGa Frontier 2, retained PocketStation functionality in their localized versions.  The PocketStation's most popular game was Dokodemo Issho, which sold over 1.5 million copies in Japan and is the first game to star Sony's mascot Toro. The PocketStation was discontinued in July 2002 after having shipped nearly five million units.  On November 5, 2013, it was announced that the PocketStation would be revived as an application for the PlayStation Vita, allowing users to play PocketStation format minigames for any classic PlayStation games that they own. Originally it was only available to PlayStation Plus members, it was later released to the general public. It remains an exclusive to the Japanese PlayStation Vitas.  The PocketStation also shares similarities with Sega's VMU for the Dreamcast.",
        "category": "Handhelds",
        "usemamefiles": "false"
    },
    "Sharp X1": {
        "id": 172,
        "name": "Sharp X1",
        "emulated": "true",
        "developer": "Sharp",
        "manufacturer": "Sharp",
        "cpu": "Sharp Z80 A",
        "memory": "64 KB",
        "sound": "General Instrument AY-3-8910 or Yamaha YM2149",
        "display": "320 x 200 \/ 640 x 200",
        "media": "Cassette tape",
        "notes": "The X1, sometimes called the Sharp X1, is a series of home computers released by Sharp Corporation from 1982 to 1988. It was based on a Z80 CPU.  Despite the fact that the Computer Division of Sharp Corporation had released the MZ series, suddenly the Television Division released a new computer series called the X1. At the time the original X1 was released, all other home computers generally had a BASIC language in ROM. However the X1 did not have a BASIC ROM, and it had to load the Hu-BASIC interpreter from a cassette tape. On the plus side however, this concept meant that a free RAM area was available that was as big as possible when not using BASIC. This policy was originally copied from the Sharp MZ series, and they were called clean computers in Japan. The cabinet shape of X1 was also much more stylish than others at that time and a range of cabinet colors (including Red) was selectable.  The RGB display monitor for the X1 had a television tuner, and a computer screen could be super-imposed on TV. All the TV functions could be controlled from a computer program. The character font was completely programmable (A.K.A. PCG) with 4bit color, and it was effectively used into a lot of games. The entirety of the VRAM memory was mapped on to the I\/O area, so it was controlled without bank change. Since X1 had these features, it was very powerful for game software.  While X1 was struggling to sell, the PC8801 (from NEC) was quickly becoming popular in the Japanese market. In 1984, Sharp released the X1 turbo series with high resolution graphics (640x400, while X1 had 640x200). It had a lot of improvements, but the clock speed was still only 4 MHz. In 1986, Sharp released the X1 turbo Z series with a 4096 color analog RGB monitor. An X1 twin, which had a PC-Engine in the cabinet, was finally released as the last machine of the X1 series in 1987. Then this series was succeeded by the X68000 series.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Sharp MZ-2500": {
        "id": 173,
        "name": "Sharp MZ-2500",
        "emulated": "true",
        "developer": "Sharp",
        "manufacturer": "Sharp",
        "cpu": "Zilog Z80B",
        "memory": "128 KB",
        "sound": "YM2203 FM",
        "display": "320 x 200 \/ 640 X 200 \/ 640 x 400",
        "media": "Floppy disk",
        "notes": "The Sharp MZ-2500 (SuperMZ) series was launched on the Japan market in 1985, the computers in this series all used a Z80B processor running at 6MHz. They included a data recorder and at least one 3.5 internal floppy disk drive, as well as a YM2203 FM sound chip, hardware scrolling, and a palette of 256 colors (upgradable to 4096) and it takes from 2 to 8 seconds to define P.C.G (user generated characters, similar to sprites).  This makes them among the most powerful 8-bit machines ever released for home use. Some models are also compatible with the MZ-80B and MZ-2000.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "Sega Triforce": {
        "id": 174,
        "name": "Sega Triforce",
        "emulated": "true",
        "developer": "SEGA\/Namco\/Nintendo",
        "manufacturer": "SEGA\/Namco\/Nintendo",
        "cpu": "IBM Power PC \"Gekko\"",
        "memory": "48 MB MoSys 1T-SRAM",
        "graphics": "\"Flipper\" (Custom ATI\/Nintendo)",
        "sound": "Custom Macronix 16bit DSP",
        "display": "15k \/ 31k",
        "media": "GD-ROM",
        "maxcontrollers": "2",
        "notes": "The Triforce is an arcade system board developed jointly by Namco, Sega, and Nintendo, with the first games appearing in 2002. The name \"Triforce\" is a reference to Nintendo's Legend of Zelda series of games, and symbolized the three companies' involvement in the project. The system hardware is based on the Nintendo GameCube with several differences, like provisions for add-ons such as Sega's GD-ROM system and upgradeable RAM modules.",
        "category": "Arcade",
        "usemamefiles": "true"
    },
    "Sega Hikaru": {
        "id": 175,
        "name": "Sega Hikaru",
        "emulated": "true",
        "releasedate": "1999-05-01T00:00:00-07:00",
        "manufacturer": "Sega",
        "cpu": "2Ã\u0097 Hitachi SH-4 @ 200 MHz",
        "memory": "100 MB",
        "graphics": "2Ã\u0097 NEC-VideoLogic PowerVR 2 (PVR2DC\/CLX2) @ 100 MHz",
        "sound": "2Ã\u0097 Yamaha AICA Super Intelligent Sound Processor @ 45 MHz",
        "display": "Single monitor: 496Ã\u0097384 to 800Ã\u0097608 pixels, Dual monitor: 992Ã\u0097768 to 1600Ã\u0097608 pixels",
        "media": "ROM Board, up to 352 MB",
        "notes": "An evolution of the NAOMI hardware with superior graphics capabilities, the Hikaru was used for a handful of deluxe dedicated-cabinet games, beginning with 1999's Brave Fire Fighters, in which the flame and water effects were largely a showpiece for the hardware. The Hikaru hardware was the first arcade platform capable of effective Phong shading. Since it was comparatively expensive to produce, and most games did not necessarily need Hikaru's extended graphics capabilities, Sega soon abandoned the system in favor of continued NAOMI and NAOMI 2 development.",
        "category": "Arcade",
        "usemamefiles": "true"
    },
    "Radio-86RK Mikrosha": {
        "id": 176,
        "name": "Radio-86RK Mikrosha",
        "emulated": "true",
        "releasedate": "1986-01-01T00:00:00-08:00",
        "manufacturer": "Various",
        "cpu": "K580IK80A",
        "memory": "16 KB",
        "display": "25x80",
        "notes": "The Radio-86RK was the second DIY computer featured in Radio magazine, in an edition published in 1986. It was more popular than the Micro-80 because it was much simpler (29 ICs, i8080 @1.78 MHz with i8257 and i8275-based CRT terminal). Many factories started production of home computers based on this design (such as the Apogey BK-01, Mikrosha, Krista, Partner 01.01, and the Spektr-001). These computers had limited compatibility with the original software, although their schematics were very close to the original.",
        "category": "Computers",
        "usemamefiles": "false"
    },
    "SNK Neo Geo MVS": {
        "id": 177,
        "name": "SNK Neo Geo MVS",
        "emulated": "true",
        "releasedate": "1990-01-31T00:00:00-08:00",
        "developer": "SNK",
        "manufacturer": "SNK",
        "cpu": "Motorola 68000, Zilog Z80A co-processor",
        "memory": "64 KB main + 2 KB sound and 68 KB video RAM",
        "graphics": "SNK chipset (LSPC2-A2, PRO-B0, PRO-A0)",
        "sound": "Yamaha YM2610 15 sound channels",
        "display": "320x224",
        "media": "Cartridge",
        "maxcontrollers": "2",
        "notes": "The Neo Geo, stylised as NEOÂ·GEO, also written as NEOGEO, is a cartridge-based arcade system board and fourth-generation home video game console released on April 26, 1990, by Japanese game company SNK Corporation. It was the first system in SNK's Neo Geo family. The Neo Geo was marketed as 24-bit; its CPU is technically a parallel processing 16\/32-bit 68000-based system with an 8\/16-bit Z80 coprocessor much like the Sega Genesis, while its GPU chipset has a 24-bit graphics data bus.  The Neo Geo originally launched as the MVS (Multi Video System) coin-operated arcade machine. The MVS offers owners the ability to put up to six different cartridges into a single cabinet, a unique feature that was also a key economic consideration for operators with limited floorspace, as well as saving money in the long-run. With its games stored on self-contained cartridges, a game cabinet can be exchanged for a different game title by swapping the game's ROM Cartridge and cabinet artwork. A home console version was also made, called AES (Advanced Entertainment System). It was originally launched as a rental console for video game stores in Japan (called Neo Geo Rental System), with its high price causing SNK not to release it for home use â\u0080\u0093 this was later reversed due to high demand and it came into the market as a luxury console. The AES had the same raw specs as the MVS and had full compatibility, thus managed to bring a true arcade experience to home users. As of 2013 it was the most expensive home video game console ever released, costing US$1,125 adjusted for inflation. The Neo Geo was revived along with the brand overall in December 2012 through the introduction of the Neo Geo X handheld and home system.",
        "category": "Arcade",
        "usemamefiles": "true"
    },
    "Nintendo Switch": {
        "id": 178,
        "name": "Nintendo Switch",
        "emulated": "true",
        "releasedate": "2017-03-03T00:00:00-08:00",
        "developer": "Nintendo",
        "manufacturer": "Nintendo PTD",
        "cpu": "Nvidia Tegra X1 T210 SoC: ARM Cortex-A57 + ARM Cortex-A53 (Unused) @ 1.02 GHz",
        "memory": "4 GB LPDDR4",
        "graphics": "Nvidia Tegra X1 T210 SoC: Maxwell GM20B @ 307.2 - 384 MHz while undocked, 307.2 - 768 MHz while docked",
        "sound": "Linear PCM 5.1ch (via HDMI), Stereo speakers, Headphone jack",
        "display": "6.2-inch, 1280 Ã\u0097 720 LCD @ 237 ppi Up to 1080p via HDMI while docked",
        "media": "Nintendo Game Card",
        "maxcontrollers": "8",
        "notes": "The Nintendo Switch is an eighth generation (2012-present) home video game console developed and distributed by Nintendo. It was released on March 3, 2017 in North America at a retail price of $299.99. The console was simultaneously released in Japan (2017), Europe (2017), South America (2017), Australia (2017) and other World Wide Markets (2017). The Switch is designed to be a hybrid console, allowing games to be played at a TV, and then on the go by undocking the system and playing from the handheld unit itself. As of this date, the console is still in production.",
        "category": "Consoles",
        "usemamefiles": "false"
    },
    "Windows 3.X": {
        "id": 179,
        "name": "Windows 3.X",
        "emulated": "false",
        "releasedate": "1990-05-22T00:00:00-07:00",
        "developer": "Microsoft",
        "notes": "Windows 3.0, a graphical environment, is the third major release of Microsoft Windows, and was released on May 22, 1990. It became the first widely successful version of Windows and a rival to Apple Macintosh and the Commodore Amiga on the graphical user interface (GUI) front. It was followed by Windows 3.1.  Windows 3.0 originated in 1989 when David Weise and Murray Sargent independently decided to develop a protected mode Windows as an experiment. They cobbled together a rough prototype and presented it to company executives, who were impressed enough to approve it as an official project. Windows 3.0 succeeded Windows 2.1x and included a significantly revamped user interface as well as technical improvements to make better use of the memory management capabilities of Intel's 80286 and 80386 processors. Text mode programs written for MS-DOS can be run within a window â\u0080\u0094 a feature previously available in a more limited form with Windows\/386 2.1 â\u0080\u0094 making the system usable as a crude multitasking base for legacy programs. However, this was of limited use for the home market, where most games and entertainment programs continued to require raw DOS access.",
        "usemamefiles": "false"
    },
    "Nokia N-Gage": {
        "id": 180,
        "name": "Nokia N-Gage",
        "emulated": "false",
        "releasedate": "2003-10-07T00:00:00-07:00",
        "developer": "Nokia",
        "manufacturer": "Nokia",
        "cpu": "ARM920T @ 104 MHz",
        "memory": "3.4 MB internal memory",
        "sound": "Mono, Stereo for MP3 and FM radio only",
        "display": "TFT, 4096 colors, 35 x 41 mm, 176 x 208 pixels",
        "media": "MultiMediaCard (MMC)",
        "maxcontrollers": "1",
        "notes": "The N-Gage is a PDA combining features of a telephone and a handheld game system from Nokia, released on 7 October 2003. It runs the original Series 60 platform on Symbian OS v6.1, and it's able to run all Series 60 software as well as Java MIDP apps. Multiplayer gaming was accomplished with Bluetooth or the Internet (via the N-Gage Arena service). The N-Gage also included MP3 and Real Audio\/Video playback. While the N-Gage did not have any significant financial successes, it did have a handful of critical successes.",
        "usemamefiles": "false"
    },
    "GameWave": {
        "id": 183,
        "name": "GameWave",
        "emulated": "false",
        "releasedate": "2005-10-01T00:00:00-07:00",
        "manufacturer": "ZAPiT Games",
        "cpu": "Altera MAX II",
        "media": "DVD-ROM",
        "maxcontrollers": "4",
        "notes": "The Game Wave Family Entertainment System, commonly abbreviated as Game Wave, is a hybrid DVD player and home video game console manufactured by ZAPiT Games. It was first released in Canada in October 2005. It is part of the seventh generation of video game consoles.",
        "usemamefiles": "false"
    },
    "Linux": {
        "id": 185,
        "name": "Linux",
        "emulated": "false",
        "releasedate": "1991-09-17T00:00:00-07:00",
        "developer": "Community",
        "manufacturer": "\tCommunity",
        "maxcontrollers": "1",
        "notes": "is a name that broadly denotes a family of free and open-source software operating systems (OS) built around the Linux kernel. Typically, Linux is packaged in a form known as a Linux distribution (or distro for short) for both desktop and server use. The defining component of a Linux distribution is the Linux kernel, an operating system kernel first released on September 17, 1991, by Linus Torvalds. Many Linux distributions use the word \"Linux\" in their name. The Free Software Foundation uses the name GNU\/Linux to refer to the operating system family, as well as specific distributions, to emphasize that most Linux distributions are not just the Linux kernel, and that they have in common not only the kernel, but also numerous utilities and libraries, a large proportion of which are from the GNU project. This has led to some controversy",
        "usemamefiles": "false"
    },
    "Sony Playstation 5": {
        "id": 186,
        "name": "Sony Playstation 5",
        "emulated": "true",
        "releasedate": "2020-11-12T00:00:00-08:00",
        "developer": "Sony",
        "manufacturer": "Sony",
        "cpu": "AMD Zen 2 APU @ 3.5 GHz",
        "memory": "16 GB GDDR6 SDRAM + 512 MB DDR4 RAM (for background tasks)",
        "graphics": "AMD RDNA 2  \"Oberon\" @ 2.23 GHz",
        "sound": "Custom Tempest Engine 3D Audio, Dolby Atmos & DTS:X (Blu-ray video & UHD Blu-ray video), 7.1 surround sound",
        "display": "Video output formats: HDMI: 720p, 1080i, 1080p, 4K UHD, 8K UHD",
        "media": "Ultra HD Blu-ray, Blu-ray, DVD, Digital distribution",
        "maxcontrollers": "4",
        "notes": "The PlayStation 5 (PS5) is a home video game console developed by Sony Interactive Entertainment. Announced in 2019 as the successor to the PlayStation 4, the PS5 was released on November 12, 2020, in Australia, Japan, New Zealand, North America, and South Korea, with worldwide release following a week later. The PS5, along with Microsoft's Xbox Series X and Series S consoles were released in the same month, is part of the ninth generation of video game consoles.",
        "category": "Consoles",
        "usemamefiles": "false"
    }
}